[{"heading":"Bharat Benz taps used commercial vehicle market with new exchange program","summary":"'bharatbenz Exchange' will provide buyers with a carefully-picked pool of used trucks that have undergone thorough quality checks. The truckmaker will also support used vehicle buyers (both individuals and companies) with large portfolio of vehicles suitable to their application by providing the right AMC and Extended Warranty options for their range of refurbished trucks. They will assist in identifying the appropriate financing partner. Ev buyers will be able to exchange their used vehicles of any brand for new or used british vehicles.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Bharat_Benz.jpeg?dOMtfUwJUFj9AGFx45YjzViBckOqBp6K&size=770:433"},{"heading":"Delhi's electric vehicle policy announced: What it means for EV buyers","summary":"The new electric vehicle policy aims at boosting the economy, reducing pollution, and encourages usage of e-vehicles for the next three years. The state government announced that the Delhi government will give a benefit of up to Rs 30,000 and for four-wheeler, the benefit is 1.5 lakh. In the near future the open-permit system for electric autos in Delhi will promote zero-emission last and the first-mile green mobility.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Hyundai_KONA_electric_main_KV_.jpeg?g_XDT3CRYx4_SzsHdXttAeyRTm0QYMlb&size=770:433"},{"heading":"Kia Sonet revealed: A winner again","summary":"The Kia Sonet compact SUV looks like a ‘baby’ Seltos. The headlights are cool too thanks to the uniquely shaped LED DRL. The front bumper also gets scuff plates and also houses fog lights. At the back the sonet’s design is even more appealing. Led tail lights mimic the design of the headslamps. This makes it look wider and imposing. Spot on with the designs.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/The_Kia_Sonnet_sure_looks_spor.jpeg?VrKGo8hUWq4WyJxzDsFIo1FmhRVPacdl&size=770:433"},{"heading":"Kia Sonet breaks cover; to rival Maruti Suzuki Vitara Brezza, Hyundai Venue","summary":"The sonet is Kia Motors India's third offering in the country after the Seltos and the Carnival. The automaker claims that the prototypes of the 'kia Sonet' have been tested for more than 1 lakh km on the Indian roads. We first saw the concept form at the Auto Expo 2020, but it must be added here that it looks equally awe-inspiring, if not more. It will be exported to other countries.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Kia_Sonet__Exterior_0.jpeg?DHeEf29qvt1tJ9kcn_QTAcrnEzrsMvhX&size=770:433"},{"heading":"Kia Sonet debut today; price, features, specs, other details you should know","summary":"Kia Motors India is set to unveil its third product for the Indian market today which will be a sub-4m compact SUV offering. The Sonet first made an appearance at the 2020 Auto Expo in february albeit in concept form. It will have its world premiere today followed by commencement of bookings over the coming weeks ahead of its launch in September. We already know that the exterior features will include LED DRLs, LED tail lights and kia’s signature ‘tiger nose’ grille.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/065A9629.png?0KCUSxuZVdelwaYcM.aU6dPYcF9rIU0p&size=770:433"},{"heading":"Tata Nexon EV now available at monthly subscription of Rs 41,900","summary":"The new electric vehicle subscription programme makes available the Tata Nexon EV to the customers at an all-inclusive fixed monthly rental starting at Rs 41,900. The automaker is initially offering the service in Delhi\/NCR, Mumbai, Pune, Hyderabad and Bengaluru. Once the subscription tenure is over, the customer can either choose to extend it or just return the vehicle. A new subscription model allows customers to choose between three separate tenures -- 36 months, 24 months and 18 months.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Nexon_EV.png?uoFGXSX6nAaLNq7YgPqRq04oDqXG4GIG&size=770:433"},{"heading":"2020 Maruti Suzuki S-Cross: 5 things you should know","summary":"The 2020 maruti Suzuki S-Cross has finally been launched in India. The automaker had initially planned to introduce the vehicle in March - but the launch had to be postponed. Now that it is here, it has again taken the position of the flagship product in Nexa's portfolio. Despite the Covid-19 pandemic, the launches have been delayed and it will be announced in january. There are five important things you should know about it.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/S-Cross_new_image_0.jpeg?qv_j1PfymdMG.t.t7VnNWDZeD384Tb.O&size=770:433"},{"heading":"Jawa, Jawa Forty Two: Price-colour combination explained","summary":"The BS6 Jawa is available in three different colours -- black, grey and maroon. The two motorcycles are powered by the same engine that belts out 26.51PS of max power and 27.05Nm of peak torque. They sit on a double-cradle frame, with telescopic hydraulic fork, 18-inch tyre and 280mm disc\/153 drum.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/pjimage_1.jpeg?Kkcfe8JOd1LVMEgG_5Z1PCk0wMDTfSHa&size=770:433"},{"heading":"New Toyota Fortuner TRD limited edition launched in India, price starts at Rs 34.98 lakh","summary":"The bookings for the new Toyota Fortuner TRD limited edition are now open at all the Toyota dealerships across the country. Toyota Kirloskar Motor has designed the company's new tv series for a starting price of Rs 34.98 lakh (ex-showroom, Delhi) it features dual-tone exteriors and interiors, and is equipped with plethora of fresh features.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Fortuner_TRD.jpeg?XUNYCV9oq9M.pcqKS_LP.x5L5LCbiism&size=770:433"},{"heading":"New Audi RS Q8 bookings open in India for Rs 15 lakh","summary":"The new Audi RS Q8 can be booked at any Audi India dealership or official company website for an initial amount of Rs 15 lakh. It is the fastest series production SUV on the Nurburgring, but also the most powerful SUV coupe from the Audi family. A V8 twin-turbo, 4.0-litre, TFSI petrol engine that develops 600hp. This is an epitome of performance and aggressive styling.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/New_Audi_RS_Q8.png?36yweLYMpF6bCfLtDa5eb3Q0rtKhDW5M&size=770:433"},{"heading":"Buying a used Royal Enfield? Here are five things you need to watch out for","summary":"Royal Enfield was one of the brands which revived itself from the brink of extinction. Now the company has become the heartthrob in the nation and the used bike market is thriving - but not many can afford a new one. In this story we will tell you what all to watch out for so that you can buy yourself one good example. The Bullet 350 and Classic 350 sport classic mudguard designs, while the Classic range sport more rounded off units.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/1J7A9010.jpeg?aOkW_0Bc9t1EZmT7DfWPskBilGws0qKA&size=770:433"},{"heading":"New 2020 helmet norms announced by MoRTH: Explained ","summary":"The ministry repealed its previous ban on the sale of helmets that weigh more than 1200gm(1.2kg) allowing foreign players to stock and sell in the market from September 4th 2020 as long as the helmet manufacturer met current ISI standards. Now, extrapolating on existing norms, MoRTH has announced an additional ban - all players must be certified by the ISi under the BIS Act, 2016. The rules are set to come into play on 31 March 2021.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Helmet-Collage_C_2.jpeg?0h_ZYGZiTq72f9LVXEAWeBLoTcp.meIl&size=770:433"},{"heading":"Nissan Magnite exterior and interior design preview","summary":"Nissan has announced its intention to enter the highly lucrative sub-4m compact SUV space with the upcoming Nissan Magnite. The car maker?s current line up comprises just two vehicles Kicks and GT-R, while the company isn?t exactly planning a product offensive over the coming year or two, it will be launching its new compact crossover space in the next few years - the new model is expected to be released in january. If you have any questions, please contact the Nissan Motor Corporation.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Nissan_Magnite_side_profile.jpeg?rCakFF1bTpmX6_T5iQv1z9ZLDhSLvSIZ&size=770:433"},{"heading":"Maruti Suzuki S-Cross Petrol vs Hyundai Creta vs Kia Seltos vs Renault Duster vs Nissan Kicks: Specifications Comparison","summary":"The new maruti Suzuki S-Cross petrol replaces the outgoing diesel version of the NEXA flagship product. It will be the only engine option on offer in the Indian market, but what we would like to address here is how it stacks up against its rivals in terms of price. The carmaker announced its official launch at a starting price of Rs 8.39 lakh (ex showroom, India) the 2020 update features minor cosmetic changes both on the outside and the inside.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Maruti_Suzuki_S-Cross_vs_Rival_0.jpeg?2jiXaLjoyB.7WuOvMyTtxPHUMX6dLsmK&size=770:433"},{"heading":"BS6 KTM 250 Duke launched in India, price starts at Rs 2.09 lakh","summary":"The new BS6 KTM 250 Duke is powered by a single-cylinder, 4-valve, liquid-cooled, DOHC, 248.8cc engine that delivers 30PS of maximum power and 24Nm of peak torque. The quarter-liter motorcycle is also equipped with an open-cartridge USD WP 43mm forks, while the rear gets 10-step adjustable wp monoshock.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/1._250_Duke_Black_LED_Front_Ri.jpeg?aZjQbt7PDjqLlPSdSq8svvhrwNZHxnvq&size=770:433"},{"heading":"2020 Mahindra Thar to break cover in India on August 15","summary":"The 2020 Mahindra Thar has been spied testing on numerous occasions in india. It will come with standard safety features like dual front airbags, ABS with EBD, seat belt reminder, reverse parking assist and high-speed alert. The diesel option might be in the form of a 140bhp 2.2-litre mHawk turbo powertrain. An automatic transmission is also expected with both the mills.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Thar_Image.png?MpSZ0yyXr8dyxEoFyxp8obUcq7JTKEjh&size=770:433"},{"heading":"Tata Motors refute reports about selling stake in PV business","summary":"Tata Motors denies selling up to 49 per cent stake in its domestic passenger vehicle (PV) business. The company says it's not an imperative for today but an opportunity to be secured for tomorrow. It also clarifies that it does not have any such plans in the near future either. A cash improvement programme of Rs 6,000 crore has been called out to the capital expenditure for FY21, which is expected to cost around Rs 1,500 crore for the year 2020.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Altroz_1.jpeg?pFEjtXjdh8YqDy_RCw3wWmCQa4UcOqK7&size=770:433"},{"heading":"2020 Maruti Suzuki S-Cross launched in India, price starts at Rs 8.39 lakh","summary":"The 2020 maruti Suzuki S-Cross was showcased at the Auto Expo 2020. It was scheduled to be introduced in march 2020 but the plan got delayed in the wake of the Covid-19 pandemic. The plans were delayed by a spokesman for the automaker, who said: 'i'm not going to have to wait until the end of this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/New_Pic_0.jpeg?p8svRygDBDeuBF1cxy8MeKGEjDT.sOWj&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]