[{"heading":"Gold, silver prices continue to climb, touch record levels","summary":"Gold price surged for the 16th straight session on friday. Silver price jumped by Rs 576 compared to the closing level of Rs 77,264 per kg on Thursday. Gold prices for 24 carat in Delhi continued to scale new highs by gaining Rs 6. Gold prices are trading higher in the international market, both gold and silver were trading marginally lower at USD 2,061 per ounce and USD 28.36 per anounce, respectively.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/gold_reutres.jpeg?lyxAkybWpISTsuO.pTVHFxN5HYIAALX6&size=770:433"},{"heading":"Sensex, Nifty end flat as virus cases top 2 million","summary":"India's coronavirus infections jumped by a daily record of 62,538 on friday to 2.03 million. The Sensex ended up 0.04% at 38,040.57, while the Nifty closed 0.12% higher at 11,214.80, and the Nasdaq climbed 0.9% on Thursday, down 0.2% to 11.14 million, the third biggest caseload after the united states and brazil - the second biggest in the world despite the covid-19 pandemic.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/sensex_reuters-647x363.jpeg?YV0bVgd4AUoDJrIeSmKmaX4Ugg5ZtVLF&size=770:433"},{"heading":"Immunity boosters to comfort food: How Indians are spending during coronavirus pandemic","summary":"The coronavirus pandemic has drastically changed the spending habits of millions in india and most other countries across the globe. More than 60,000 cases were reported in the country due to the rising Covid-19 cases, which has sparked a rise in cases of the deadly virus. The number of cleanliness products on household shelves has also increased significantly.since eating out doesn't seem viable at the moment, comfort food has seen sharp demand in India. Spending more time at home has resulted in increased spending on digital services.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_3.42._0.png?xmRGsb1Nltq9dwyi7SgSOaNbwDv4lVI1&size=770:433"},{"heading":"Gold smashes record high as coronavirus pandemic worsens","summary":"Gold smashed a record high at $2,069.78 per ounce by 0308 GMT. It has added 4.7% so far this week in what would be its ninth straight weekly gain. Gold futures rose 0.6% to $28,081.60.Silver too continued its stellar run. The greenback was headed for its seventh consecutive weekly decline.Gold is likely to hover around $22,020-2,080 an oz in the near term, said national Australia Bank economist John Sharma.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_1.22._0.png?sDDOPAnwabXuZZlo3we10Pa88MRhZCzL&size=770:433"},{"heading":"GDP will contract, but by how much? Why RBI's silence is worrisome","summary":"Rbi has been giving out a projection of the GDP growth rate in the country for decades. However, in coronavirus pandemic-hit year - when the economy looks extremely fragile, the RBI have gone silent on GDP projections. The fact that India's economy will be in contraction zone is clear with shops, factories and businesses reporting losses since March. Despite this, many economic hubs are still waiting for labourers to return. They do not have enough money or confidence to go back.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Shaktikanta_Das_Reuters_file.jpeg?YKICGPE6CzgRLNnGTYlhSirtOLCYVhR_&size=770:433"},{"heading":"Global Markets: Shares tumble after Trump takes aim at China tech firms","summary":"World stock markets tumble after u.s. President ratcheted up tensions with china by banning transactions with two popular Chinese apps. The move is set to trigger retaliatory action by Beijing, stoking fears that a'silicon curtain' is emerging between the two superpowers, including apple and Microsoft, the information sector growingly looks divided into two camps. China could block Apple or Microsoft from China. We could be seeing just the beginning of an information technology war.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_12.03_0.png?8pUHCk0EVRaTnpl4RDa7R7FDIa0tm3Kp&size=770:433"},{"heading":"Do more, focus on priorities: Raghuram Rajan’s formula for protecting Indian economy","summary":"Ex-reserve bank of India governor says policymakers should focus on protecting the economy as businesses struggle amid the coronavirus pandemic. The central bank has reduced the key lending rate by 115 basis points on top of the 135 bps last year but decided to hold rates steady earlier in the day against market expectations as inflation pressures have risen.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_10.22_0.png?xUVAYdI.0JDCqKAhMy4XZOflzV84yhFZ&size=770:433"},{"heading":"Sensex, Nifty slip as coronavirus cases cross 20 lakh in India","summary":"The NSE Nifty 50 index fell 0.21% to 11,175.35 by 9:20 am. The S&P BSE Sensex slipped 0.34% lower at 37,897.63. Hdfc Bank and ICICI Bank were among the top drags on the new index, falling roughly 1% each. Experts praise RBI’s monetary policy announcements, call it a positive step, say experts say it is an important step for the world's third worst pandemic-hit nation.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_9.50._0.png?WOXBr6MA_bL64.uO1O24.OyKgrDRoX4b&size=770:433"},{"heading":"Oil prices slip on uncertainty over US recovery, stimulus","summary":"Resurgence of coronavirus infections remains the main uncertainty in the oil market, analysts say. A weaker dollar has helped support higher oil prices, as oil is priced in U.S. Dollars, making it more attractive to crude buyers in other currencies. The dollar index drops to its lowest since May 2018 on Thursday, which is expected to weaken ahead of the u.s. Non-farm. Talks have stalled on the new stimulus deal.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_9.07._0.png?mdt7JXOhL8_Pejg4MZSDW4Ki6V42z1jC&size=770:433"},{"heading":"Saudi Arabia, Iraq stress full commitment to OPEC+ deal","summary":"Opec, Russia and other producers agreed to cuts of 9.7 million bpd, or 10% of global output, from May 1. The two ministers discussed the latest developments in oil markets, continued recovery in global demand and progress made towards implementing the occ+ agreement - citing a joint statement from both ministries. Iraq agrees to cut output by 1.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/opec.png?4FygAewKqqqZ81FfSeV0qGM65CDc3Tze&size=770:433"},{"heading":"Experts praise RBI’s monetary policy announcements, call it a positive step","summary":"The RBI has recognised the need for continued support to micro, small and medium enterprises (MSME) meaningful restructuring. Rbi holds rates amid rising inflation, maintains accommodative stance to allow elbow room for further policy interventions if required. 'rbi’s focus on improving financial stability through additional liquidity of Rs 5,000 crore each at repo rate to protect the primary and the housing sectors from liquidity challenges is a welcome move,' said Dr Reddy.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_8.51._0.png?F3hiX7vuZrwKPrmdVDACL_wAm8nrZKXK&size=770:433"},{"heading":"Donald Trump reimposes tariffs on raw Canadian aluminum, Canada promises retaliation","summary":"President Donald Trump moved to reimpose 10 per cent tariffs on some Canadian aluminum products. The tariff announcement could be aimed at showing voters he intends to fight for their jobs and upend trade policy further if a spokesman remains in office. But some prominent business groups criticized the move as counterproductive and unhelpful to US interests.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/trump_reuters-647x363.jpeg?.xeymc4VU3Cmt3Dt9oDt0KeHaR08wPYQ&size=770:433"},{"heading":"Sensex, Nifty settle higher after RBI keeps rate steady","summary":"The central bank vowed to do \"whatever is necessary\" to revive an economy battered by the Covid-19 pandemic. The Sensex closed 0.96% higher at 11,200.15, the benchmark 10-year bond yield closed at 5.86% from 5.81% pre-policy. It comes amid a recent rise in retail consumer prices. Two-thirds of economists polling by Reuters had expected the RBI to cut the repo rate by another 25 basis points.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/sensex_reuters-647x363.jpeg?YV0bVgd4AUoDJrIeSmKmaX4Ugg5ZtVLF&size=770:433"},{"heading":"Bank of England sees slower recovery from coronavirus hit","summary":"The bank of England said on Thursday it expected the economy to take longer to get back to its pre-Covid pandemic size. The BoE said it would not recover its end-2019 size until the end of next year.in May, it had said its protections for 2020 were less grim than in May.Unemployment was expected to peak at 7.5% at the beginning of this year, almost double the most recent rate but lower than the previous estimate of just under 10%.the overall economy now looked on course for a 9.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/london_0.jpeg?AKQVwOq6TbPxoHic5Edx8f3Mxu1cTsDx&size=770:433"},{"heading":"RBI holds rates amid rising inflation, maintains accommodative stance","summary":"Rbi Governor Shaktikanta Das said 6-member Monetary Policy Committee decided to keep rates unchanged, but added that the central bank will continue to maintain an accommodative stance. The repo rate stands unchanged at 4% and 3.35 per cent respectively, he said. It may be noted the RBI has already cut the rate by a total of 115 basis points since february on top of 135 base points in easing cycle last year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_1.05._0.png?4jCTeRiYEPXSZlLc.QJdRfkevc6YmN8b&size=770:433"},{"heading":"Gold holds near record high as dollar dips, growth outlook dims","summary":"Gold was up 0.1% at $2,042.14 per ounce by 0351 GMT. U.s. Gold futures rose 0.4% to $1,056.60 on thursday, boosting worries about a recovery in the pandemic-ravaged global economy. Experts say low or negative interest rates were pushing capital into assets like gold that offer nominally better returns.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_11.02_1_0.png?qxH0OzktFwB1.G8ACzCSrfpPNKzNOhyJ&size=770:433"},{"heading":"Sensex, Nifty rise ahead of RBI interest rate decision","summary":"Indian shares clocked broad-based gains ahead of a bi-monthly monetary policy decision by the country’s central bank. The NSE Nifty 50 index climbed 0.52% to 11,159.45 by 9:20 am and the S&P BSE Sensex was 0.0% higher at 37,846.10.All 11 major sectoral indexes were trading higher.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_10.58_0.png?tFUgXK8BezoQU8ncGXk5D.0Pu8YJkRwT&size=770:433"},{"heading":"Will RBI go for another rate cut today? Here’s all you need to know","summary":"The RBI governor is expected to announce key measures to tackle the economic crisis as part of his bi-monthly Monetary Policy Address (MPC) on Thursday. Several analysts and economists have predicted the central bank to go for a 25 basis point (bps) rate cut, but some believe that RBI would keep that option aside for the future.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_9.20._0.png?FKENwpA8BYyIzpoMj5W__Pq9O9PAZzFj&size=770:433"},{"heading":"Indian pharma industry expected to be stable this year, says credit rating agency","summary":"The growth could be attributed to the outbreak of many diseases in many parts aiding growth of the anti-infective segment. The global demand scenario is largely expected to remain stable for Indian pharmaceutical industry owing to inelastic nature of prescription drugs, a study by information and credit rating agency (ICRA) it expects the domestic pharmacy industry to grow at 4 to 6 percent in the financial year 2021 - due to coronavirus impact, the study found.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/medicine_reuters.jpeg?1ROrzJVf1d28APNZWMAAApLYM5h_L8Dg&size=770:433"},{"heading":"Indian shares end flat as earnings reports fail to offset concerns; metal stocks gain","summary":"A string of upbeat quarterly earnings reports failed to offset concerns over rising domestic coronavirus cases. The index ended 0.06 per cent higher at 11,101.65, followed by heavyweights Reliance Industries (RELI.NS) and HDFC Bank (HDBK.n.) turned negative to end roughly 1per cent lower. The S&P BSE Sensex closed 0.07 percent lower at 37,663.33.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/BSE__PTI_.jpeg?QFJ7cZ38se0pkzNCdhr4x2mWPNjJulc7&size=770:433"},{"heading":"More than 10,000 companies served notice by Delhi govt for tax evasion","summary":"970 of these companies have paid no tax to the government from January to March this year. All the defaulters have been served notice under 3A of GST Act to pay taxes that are due within 15 days. Government will take stringent action against the tax defaulter if they do not comply immediately. A total of 111 liquor firms have also been issued notice as they have not paid VAT. In case they fail to file their return within the prescribed time (15 days), the department will proceed with further actions.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-05_at_11.50_0.png?HJGYpGM9Eg34mXTabZBqIBnmSG.PXuaS&size=770:433"},{"heading":"Sensex, Nifty rally again; Axis Bank shares rise over 2%","summary":"The NSE Nifty 50 index climbed 0.83% to 11,187.40 by 9:25 am. The S&P BSE Sensex was 0.8% higher at 37,992.44.Axis Bank Ltd jumped 2.4% as the lender launched a 100-billion-rupee ($1.3 billion) share sale. Global investors count on fresh Covid-19 stimulus in the u.s., as britain's new stimulus stimulus comes to an end in america.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-05_at_11.03_0.png?GqW2TWeuCEflIWcJWDjbp9fbZliacuZv&size=770:433"},{"heading":"TV actor Sameer Sharma's last Instagram posts hint at depression, loneliness","summary":"Actor Sameer Sharma was found dead at his apartment on friday. The 44-year-old actor died by suicide two to three days ago, according to the police. He had been a television actor for the last 14 years and had seen many ups and downs in his career. His Instagram is filled with his poems.sameer was battling liver disease, which kept him away from work for some time. In the past few weeks, sameer had shared many cryptic posts on social media.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sameer_sharma_committed_suicid_2_0.jpeg?cHluqQCsDESyzV_63mzp8lOToLvor2Kd&size=770:433"},{"heading":"Coronavirus: Help a call away for home isolation patients in Bihar","summary":"The nearest Covid care centres have been provided with the database of the patients under home isolation in Bihar. A system has been created to ensure that specialised medical care reaches them in the shortest possible period in case of any medical need. The state health department has set up control rooms at dedicated covid-19 hospitals, which are headed by probationary IAS and IPS officers, and officers of provincial services and health care workers have also been stationed there.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/PTI_corona_new.jpeg?JWvdxejX3TJ5tee1bHutZbftKJhJB3BM&size=770:433"},{"heading":"Good governance, socio-economic development reflects return to 'complete normalcy' in J&K: MEA","summary":"Several positive changes have taken place in terms of development in Jammu and Kashmir in the last one year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/CRPF_vehicle_Lal_Chowk_Srinaga.jpeg?3jyA0fXkXB0Fuk1tLonXmiekL8HNXPRz&size=770:433"},{"heading":"Pakistan should refrain from communal incitement: India rejects criticism of Ram temple construction","summary":"India strongly rejects pakistan's criticism of construction of the Ram temple in Ayodhya.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Anurag_Srivastava.png?6_JE7tYbp8ChUEkOICHzQY8_2Gi2sqAA&size=770:433"},{"heading":"Kerala gold smuggling case: Swapna Suresh had established links with CM Pinarayi Vijayan's office","summary":"Key accused in the Kerala gold smuggling case established a link in NIA court. Swapna Suresh had casual association with the chief minister's office through former principal secretary to the CMO M Sivasankar, who was also her mentor, despite repeated pleas from the CM, the court said. During the investigation, they discovered that she was working even after resigning and was being paid USD 1,000 as rmuneration.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Swapna_Suresh__PTI_0.jpeg?9qZHBX0oamqsjfwwuWWcn3Fs0GEuCsrx&size=770:433"},{"heading":"Heavy rains, landslides cripple Sikkim","summary":"Heavy rains in the low-lying areas of Sikkim on Thursday triggered panic among people living along the Rangit river. The rain has affected people in areas such as Legshep, Reshi, Rohtak, Baiguney, Pippaley, Sikkip and Jorethang, officials said. Authorities have issued a red alert and cautioned people from going towards the river.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rain_rep_pti.jpeg?c7wL6SjtKZ6QxS.cYJgKohSMTxvaR6dc&size=770:433"},{"heading":"Sushant Singh Rajput death: CBI files FIR against Rhea Chakraborty but can't investigate in Mumbai","summary":"The central bureau of Investigation (CBI) has filed an FIR against actor Rhea Chakraborty. However, the federal probe agency will not be able to investigate the case in Mumbai and in other places in Maharashtra. Experts have told India Today TV that the government’s notification recommending CBI probe gives consent for the agency to exercise territorial jurisdiction in the whole state of Bihar.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rhea_SSR_1_0_0.jpeg?jYH7QUg30.AVU5sndearkQ6JXPRGftiX&size=770:433"},{"heading":"J&K: LG designate Manoj Sinha arrives in Srinagar, to take oath on Friday","summary":"The 61-year-old former minister of state for railways will succeed Girish Chander Murmu who resigned from the post late on Wednesday night. Mru served as the first lieutenant governor after the Centre revoked the special status of the erstwhile state and sliced it into two union territories. It is tipped to be the next Comptroller and auditor general of India - served in the office for just over nine months.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Manoj_Sinha_file__PTI_.jpeg?Mry09xkLt9nFVOkPranp.mXGLvJbt3L0&size=770:433"},{"heading":"Rohit Sharma's adorable photo with wife Ritika Sajdeh: Just two weirdos in love","summary":"India vice-captain Rohit Sharma shared an adorable photo of his wife in his pose. The photo is being widely shared on social media and the caption has caught the attention of the fans. \"just two weirdos in love,\" he wrote.Rohit returned from new Zealand as early as the first week of February and hasn't played competitive cricket since. A calf injury kept him out of ODI and Test series.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rohitritikasajdeh.jpeg?827dSQk.BhFmInj20zd9zRR9izKuMo3v&size=770:433"},{"heading":"Gaganyaan: Astronauts-elect complete training on abnormal descent module landing in Russia","summary":"The four astronauts-elect for india's first manned space mission Gaganyaan have completed training in Russia on crew actions in the event of an abnormal descent module landing. They were in good health and determined to continue their training, a subsidiary of Russian space organisation Roscosmos said on friday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202005\/Tweetreosccps-647x363.jpeg?7GTR6DT7XgVVjtFXanjUFrJ8Dn5Gx66C&size=770:433"},{"heading":"IMD forecasts heavy rains, thunderstorm in parts of Madhya Pradesh","summary":"Heavy rainfall accompanied by thunderstorm and lightning was very likely to occur at isolated places in eastern parts of the state, the IMD said. A total of 14 cm rainfall was recorded in rehti area of Sehore district during this period, an official said. It is so far received 13 per cent less than the average rainfall in the country. The iMD forecasts are valid till Friday morning, but it's valid until friday morning..","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Bhadbhada_Vishram_Ghat_drain_B.png?ey0UAsnKn78of.fpV9u2sVcJzHgIYeOU&size=770:433"},{"heading":"Sensex, Nifty settle higher after RBI keeps rate steady","summary":"The central bank vowed to do \"whatever is necessary\" to revive an economy battered by the Covid-19 pandemic. The Sensex closed 0.96% higher at 11,200.15, the benchmark 10-year bond yield closed at 5.86% from 5.81% pre-policy. It comes amid a recent rise in retail consumer prices. Two-thirds of economists polling by Reuters had expected the RBI to cut the repo rate by another 25 basis points.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/sensex_reuters-647x363.jpeg?YV0bVgd4AUoDJrIeSmKmaX4Ugg5ZtVLF&size=770:433"},{"heading":"Bank of England sees slower recovery from coronavirus hit","summary":"The bank of England said on Thursday it expected the economy to take longer to get back to its pre-Covid pandemic size. The BoE said it would not recover its end-2019 size until the end of next year.in May, it had said its protections for 2020 were less grim than in May.Unemployment was expected to peak at 7.5% at the beginning of this year, almost double the most recent rate but lower than the previous estimate of just under 10%.the overall economy now looked on course for a 9.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/london_0.jpeg?AKQVwOq6TbPxoHic5Edx8f3Mxu1cTsDx&size=770:433"},{"heading":"RBI holds rates amid rising inflation, maintains accommodative stance","summary":"Rbi Governor Shaktikanta Das said 6-member Monetary Policy Committee decided to keep rates unchanged, but added that the central bank will continue to maintain an accommodative stance. The repo rate stands unchanged at 4% and 3.35 per cent respectively, he said. It may be noted the RBI has already cut the rate by a total of 115 basis points since february on top of 135 base points in easing cycle last year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_1.05._0.png?4jCTeRiYEPXSZlLc.QJdRfkevc6YmN8b&size=770:433"},{"heading":"Gold holds near record high as dollar dips, growth outlook dims","summary":"Gold was up 0.1% at $2,042.14 per ounce by 0351 GMT. U.s. Gold futures rose 0.4% to $1,056.60 on thursday, boosting worries about a recovery in the pandemic-ravaged global economy. Experts say low or negative interest rates were pushing capital into assets like gold that offer nominally better returns.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_11.02_1_0.png?qxH0OzktFwB1.G8ACzCSrfpPNKzNOhyJ&size=770:433"},{"heading":"Sensex, Nifty rise ahead of RBI interest rate decision","summary":"Indian shares clocked broad-based gains ahead of a bi-monthly monetary policy decision by the country’s central bank. The NSE Nifty 50 index climbed 0.52% to 11,159.45 by 9:20 am and the S&P BSE Sensex was 0.0% higher at 37,846.10.All 11 major sectoral indexes were trading higher.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_10.58_0.png?tFUgXK8BezoQU8ncGXk5D.0Pu8YJkRwT&size=770:433"},{"heading":"Will RBI go for another rate cut today? Here’s all you need to know","summary":"The RBI governor is expected to announce key measures to tackle the economic crisis as part of his bi-monthly Monetary Policy Address (MPC) on Thursday. Several analysts and economists have predicted the central bank to go for a 25 basis point (bps) rate cut, but some believe that RBI would keep that option aside for the future.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_9.20._0.png?FKENwpA8BYyIzpoMj5W__Pq9O9PAZzFj&size=770:433"},{"heading":"Indian pharma industry expected to be stable this year, says credit rating agency","summary":"The growth could be attributed to the outbreak of many diseases in many parts aiding growth of the anti-infective segment.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/medicine_reuters.jpeg?1ROrzJVf1d28APNZWMAAApLYM5h_L8Dg&size=770:433"},{"heading":"Indian shares end flat as earnings reports fail to offset concerns; metal stocks gain","summary":"A string of upbeat quarterly earnings reports failed to offset concerns over rising domestic coronavirus cases. The index ended 0.06 per cent higher at 11,101.65, followed by heavyweights Reliance Industries (RELI.NS) and HDFC Bank (HDBK.n.) turned negative to end roughly 1per cent lower. The S&P BSE Sensex closed 0.07 percent lower at 37,663.33.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/BSE__PTI_.jpeg?QFJ7cZ38se0pkzNCdhr4x2mWPNjJulc7&size=770:433"},{"heading":"More than 10,000 companies served notice by Delhi govt for tax evasion","summary":"970 of these companies have paid no tax to the government from January to March this year. All the defaulters have been served notice under 3A of GST Act to pay taxes that are due within 15 days. Government will take stringent action against the tax defaulter if they do not comply immediately. A total of 111 liquor firms have also been issued notice as they have not paid VAT. In case they fail to file their return within the prescribed time (15 days), the department will proceed with further actions.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-05_at_11.50_0.png?HJGYpGM9Eg34mXTabZBqIBnmSG.PXuaS&size=770:433"}]