[{"heading":"Will university exams be conducted in Delhi or not? Students confused","summary":"There is still confusion among students studying in two of the universities in the capital. The reason for the confusion is two separate guidelines by the Delhi Government and University Grants Commission (UGC) the validity of any degree being issued without conducting assessments is questionable as per the UGC guidelines.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/delhi_university_0_1_0.jpeg?JiIynOWwuYlFV66D7hpIBV4Tllvs.WmH&size=770:433"},{"heading":"IIT Guwahati collaborates with Imperial College London to work on overall performance of LED","summary":"Researchers from the Indian Institute of Technology Guwahati, India, and Imperial College London, UK, have developed a tailored ‘meta-grid’ of nanoparticles.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/IIT_Guwahati_campus.jpeg?GvrZb4.fp5yfwbrYRr0plSvSvVROlUQ6&size=770:433"},{"heading":"Govt chalks out plan to reopen schools from Sept: States confused, parents against idea","summary":"The central government is in discussions to chalk out a plan to reopen schools. In the month of august, india touches the 20 lakh benchmark from 15 lakh cases in 9 days, the government has outlined plans to open schools between September and November. The timings of the school will be halved -- from 5 to 6 hours to just 2 to 3 hours. Schools have been proposed to run on 33% staff and student strength; in such cases online studies must continue.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/coronavirus_students_reuters_0.jpeg?HXVkKO4OHzVRoTy19QW.BRcj5EVfN2o8&size=770:433"},{"heading":"Odisha govt to reduce school syllabus for academic session 2020-21","summary":"The state government of Odisha has decided to reduce the syllabus of students for the academic year 2020-21 amid the ongoing Covid-19 pandemic. The specifics of the reduction will be finalised after a meeting is held by the curriculum committee of CHSE olympics through video conferencing in the upcoming weeks.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/classroom-2093744_1280_0.jpeg?ciiJGY93JZXMLhVZW.3_gyPn6qzpnHqD&size=770:433"},{"heading":"I followed 10+8+6 technique for UPSC, says former Miss India finalist who cracked UPSC exam","summary":"Aishwarya sheoran secured the all-India rank of 93 in the Civil Services Examination. The ultimate success story of the former Miss India finalist got all eyes on her after the results came in on August 4, 2020 - a few days back! she shared her entire journey with us-- from the glamour world to the hard-core UPSC studies. Her success mantra was 10+8+6 i.e. 10 hours of study, 8 hours sleep and 6 hours other activities.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/WhatsApp_Image_2020-08-07_at_1_0.jpeg?OQaDSs_qL_FqSUAwm6MxQw_CDs.JBLAY&size=770:433"},{"heading":"Cancelling compartment exams not an option: CBSE","summary":"The central board of Secondary Education has decided not to cancel the compartment exams for students who failed in subject papers this year. Despite the Covid-19 pandemic, the board had received several requests from students and parents and they recently decided against it as it can have a negative effect on the future of the students. Cbse has also talked about the several exemptions granted by the Home Ministry to the Education Ministry for the safe and responsible conduction and evaluation of exams amid the 'covid' pandémic.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cbse-students-delhi-pti.jpeg?1xakgRuylUoLiXMAfDMmZDabh2BNcWTy&size=770:433"},{"heading":"West Bengal WBJEE Result 2020 declared, Souradeep Das tops","summary":"1.1 lakh students appeared in the engineering exam on february 2, 2020. A student of Ramkrishna Mission, Deogarh, Souradeep Das, from Uttar Dinajpur has bagged rank 1 in WBJEE 2020. The percentage of successful candidates from other boards is, CBSE- 31%, ISC- 3%, other board- 15%The pass percentage recorded for state JEE is 71 per cent.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/result-2153618_1920.jpeg?SzjwmZyEUfiAEqMo2YarB.qV39P5zc_N&size=770:433"},{"heading":"WBJEE Result 2020 to be out at 3 pm: How to check on website","summary":"Candidates who appeared for the west Bengal Joint Entrance Examination can use the following ways to check their WBJEE 2020 result. The result is usually declared around May or June but it was delayed this year due to the Covid-19 pandemic - there would be no WbJe merit list for successful candidates if the board had informed earlier this week 'it's time to make sure that the results are accurate' the entire counselling process will be carried out online because of the ongoing covid-era pandémic.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/homework-2521144_640_0.jpeg?bAfHNCpzLyrvQal2T6dn5fhgw6oHnaoI&size=770:433"},{"heading":"Prime Minister Narendra Modi addresses NEP conclave: Key highlights","summary":"Pm Narendra Modi delivered the inaugural address at the ‘Conclave on transformational reforms in Higher Education under New Education Policy’ through video conferencing. He said that with this policy, students could grow up to become nation-builders.“how can we boost critical thinking and innovative thinking in children if there is no passion for education and no philosophy of education,” a former HRD minister said. The national education policy speaks about how students can be skilled to make them ready for the future.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/narendra_modi_pti_0_0.jpeg?tW7tDOwLqcRO7YYIA8F4IvYVrXGx0JiM&size=770:433"},{"heading":"Independence Day 2020: HRD Ministry invites applications for online essay competition","summary":"This would be open for school students studying in classes 9 to 10 or secondary stage and 11 to 12 or higher secondary. The subtopics under the main topic for essay writing are as follows:1. For Atma Nirbhar Bharat the Indian Constitution and Democracy are the biggest enablers. 2. India at 75: A Nation Marching towards Atmanirbet3 and 3: Digital India: Opportunities in Covid-19 and Beyond6. A team of experts decided by NCERT.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/ramesh_pokhriyal_janta_curfew.png?9RcykJ._TVB5WEO5rP4urkdML6VRhtxu&size=770:433"},{"heading":"Andhra Pradesh colleges to reopen from October 5","summary":"The government is gearing up to reopen colleges from October 5. Schools, colleges, and other educational institutions have remained closed in the state since march to curb the spread of Covid-19 in a bid to stop spread in india - and now, it has decided to open them. If the student completes 20 additional credits in 4 years, they will receive BTech honours in that discipline too. The u.s. Government will set up employment and skill development courses for students after the completion of their apprenticeship.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Jagan_Mohan_Reddy_pti.jpeg?Orr1.kBViaxM1KkqWWXjrecdUmEBMw9d&size=770:433"},{"heading":"Delhi HC supports DU’s decision to conduct Open Book Exam for final year students","summary":"The exams will be held in compliance with the UGC guidelines this month, along with some of the guidelines set by the high court. Students and teachers of Delhi University have been actively protesting the conduction of exams for final year students this year due to the lack of proper resources and technical glitches on the university’s end. Du had conducted several mock OBE exams in July and the first week of August but students still reported problems in the official examination portal.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/DU_PTI_3_0.jpeg?pN9vmKCVEDrJ7h4t_UrJSW9Yzf6V9GiD&size=770:433"},{"heading":"Bihar Board gives grace marks to Class 10, 12 students","summary":"Out of 340633 candidates, 214287 were given grace marks. The results were delayed like any other results due to the Covid-19 pandemic, a sign that the board is trying to avoid compartment exams amid the corruption of the u.s. Bbc has released the intermediate results on march 24, while matriculation results are published on may 26, 2020 - amid coronavirus lockdown. This appeared to be an excellent relief for the students.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/students_coronavirus_quarantin.jpeg?TEiuDnTFe1xkCCI_3xcdd.FPd_VBLtVa&size=770:433"},{"heading":"Fashion Friday: Deepika's gajra mohabbat wala and half-sarees in Chennai Express ","summary":"Deepika Padukone wore colourful half-sarees in Chennai Express. Her make-up, on the other hand, was basic all throughout the film, including dewy base, light kohl and nude lipsticks. She tied her hair in a plait, adorned with gajras and gold hair accessories. More on that later. If you're looking for something new, you can check out the video below for more details.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/chennaiexpressff.jpeg?Gf684vmVkVAuIIHhKf70mRNjbGCaT2fh&size=770:433"},{"heading":"Celebrities wear their favourite sarees on National Handloom Day","summary":"Eminent personalities, including celebrities, took to social media to commemorate the day. A post shared by smriti Irani shared the picture with the caption, \"Handloom can enrich our daily lives and surrounding in many ways\" Priyanka Chopra captioned the image: \"Indian handlooms are known to be unique... Let's lend our support to the weavers and artisans of the textile industry (sic).","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Smriti_Irani_and_Priyanka_Chop.jpeg?5eM_eQ4vlJ9Pt0zViAcpfvKW6BJUMkEt&size=770:433"},{"heading":"Bhagyashree's latest workout post is all about balancing","summary":"Bhagyashree shared the workout video and wrote about maintaining balance in life. She captioned the post, “Life is about balance! The good with the bad. The happy with a sad The sugar and the salt The detox has the malt. Glad to be able to get back to balancing life again at home.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_1.49._0.png?GEfL3jMAQsMJ0hnIxRQ5u62XO7du17GG&size=770:433"},{"heading":"Huma's morning yoga post will inspire you to exercise","summary":"The actress is currently in Glasgow, UK for the shooting of Bell Bottom. Her Instagram is a testimony to her love for working out. She captioned the picture, “7am yoga anyone?? #Morningpractice #yoga #glasgow (sic).” Huma Qureshi shared an Instagram story which featured yoga mat and props.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/imgonline-com-ua-FrameBlurred-_6.jpeg?4D1lD1QizqK1i9i7AP8hxKxQvi5MhiFt&size=770:433"},{"heading":"Milind's new pic with wife Ankita is all about being lazy","summary":"Supermodel and actor Milind Soman shared an adorable picture with his wife. He said that laziness is a natural instinct and it is okay to feel lazy at times. In fact, the actor wrote that Taking rest is important to conserve energy which can be later used when necessary.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/milind_soman_ankita_konwar_laz.jpeg?syRWCxun3yI2KY4pvknPCXMUOfwUM7fv&size=770:433"},{"heading":"Priyanka describes 2020 with perfect meme and it is hilarious","summary":"A new meme challenge has taken over social media, and it is the perfect depiction of the year 2020. The trend perfectly captures how we have all been feeling in the past few months, right from January to August, revealing what September might look like and we are scared. Priyanka Chopra posted the meme with the caption, \"2020. Same @reesewitherspoon @mindykaling @kerrywashington,\" and, should we say she nailed it quite perfectly.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/priyanka.png?i06_J_lP2A.sQC1UXEd9.Kli6h5KjrHc&size=770:433"},{"heading":"Rakul Preet shows how to do Cat Tail pose in new post","summary":"Rakul Preet has shared on her Instagram that she starts her day with 108 Surya Namaskars. She shared a picture of herself doing the Cat Tail pose and wrote, “I love being twisted.” she captioned it, '& then we twist @rakulpreeted cat Tail Pose - this is one of my favourite Yin Yoga poses.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_11.13_0.png?V4KUSVUh2kb9yGZW3AhT3FmPzcdtpZpa&size=770:433"},{"heading":"One hour at a time: Mandira Bedi's new Instagram post is so beautiful","summary":"The 48-year-old actress shared two beautiful black and white images of herself on Instagram and told her fans and followers about Sabr or patience. In the pictures, Mandira, pretty in a white kurta and pants, posed by the window at her home and said: \"Sabr: one hour at the time\" the actress has over one million followers and shares messages of hope, positivity and faith at regular intervals.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/mandirasabr.jpeg?ktfWtD70ugf.4mWLBi0uE1aUU0JnnJcC&size=770:433"},{"heading":"Taiwan's award-winning winemaker aims to revive fading tradition","summary":"China is famed for a thriving food scene centred on traditional night markets. It makes an award-winning whisky, Kavalan, but is scarcely known to wine enthusiasts, he says. \"we are trying to give new life to Taiwan's wine culture,\" the 52-year-old tells Reuters. The wine spirit renaissance is an initiative to rejuvenate the sub-tropical island, which has nearly died out on the island.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/taiwan.png?iqqzqQEmCcJROeGOepOAks.ko9Nbs6.H&size=770:433"},{"heading":"Prince Harry says social media is stoking crisis of hate","summary":"Prince Harry says social media is stoking a \"crisis of hate\" he appealed to companies to rethink their roles in advertising on digital platforms. The grandson of queen Elizabeth called for online communities to be defined more by compassion than hate; by truth instead of misinformation; and by free, rather than weaponised, speech. She urged teen girls and young women to drown out sometimes \"painfully loud\" negative online chatter with positivity.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/princeharrym1.jpeg?EFbdo5JHeXiVRVOg25lj2e3_VGe8jz0K&size=770:433"},{"heading":"Ankita dances to Beyonce's Single Ladies. Watch video","summary":"The beyhive is the collective term used for Beyonce’s fans. She shared a video of herself dancing to the most famous song single ladies on her Instagram account on august 6, 2020 at 4:59am pDT. The marathon runner shared the gram with the caption, “when you belong to... The boredom at bay And the husband likes to record all of it.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/ankita.jpeg?b9cwC9r6VpHcDKy_gzUXUV3vBymh8WHj&size=770:433"},{"heading":"Milind shares throwback picture from pre-modeling days. Fans love it","summary":"He took to Instagram to share a monochrome photograph from his pre-modeling days and called it 'rare one' in the gram, Milind can be seen looking away from the camera with the subtle smile on his face. In fact, mr. Soman even revealed that his camera-shy person earlier, who did not enjoy being photographed, was not an avid fan of being snapped.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/imgonline-com-ua-FrameBlurred-_5.jpeg?5P7cMEU.SeN_bff.PUWEIp1GlrPekkzl&size=770:433"},{"heading":"Windsor Castle opens terrace garden for first time in 40 years","summary":"The east terrace garden at Windsor Castle, created by George IV in the 1820s, will open to the public at weekends for the first time in 40 years. It features 3,500 rose bushes planted around a central fountain, which served different monarchs' tastes through the centuries. The news was announced by the royal family on their Instagram account. From Saturday, 8 August, the garden will be open for visitors and young children to join family activities on Thursdays and Fridays in August.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/117075909_636791803627651_3901.jpeg?ya2OmZa0hNqZg4evywi7Po.UyKMBPD_L&size=770:433"},{"heading":"Miheeka Bajaj makes seashell jewellery look cool for her haldi ceremony","summary":"Rana Daggubati and Miheeka Bajaj are all set to tie the knot on august 8. The wedding ceremony will be bio-secure and will have a special theme on the day before the lockdown was announced. He will get married to the couple on july 8 in january, which will take place in the city of london on september 25 - november 20 – october 20.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/miheeka_bajaj_haldi_ceremony_s.jpeg?ETxYCVOCAonuITioMNWFBgYvJfXHS.98&size=770:433"},{"heading":"Music producer Detail accused of sexual assault","summary":"Detail was arrested on more than a dozen charges of sexual assault, authorities said. The 41-year-old producer was held on nearly USD 6.3 million (Rs 47,18,38,500) bail, according to the los Angeles County Sheriff’s Department. Detail, whose real name is Noel Christopher Fisher, was charged on July 31 with 15 counts of sex assault and five counts felony assault - he is accused of crimes between 2010 and 2018.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_11.46_0.png?xYC7uEUwgyoNBhDzaJYwjhuPB10u_D9o&size=770:433"},{"heading":"Celebrated author Sadia Dehlvi dies at 63 in Delhi","summary":"Noted writer and activist Sadia Dehlvi died at her home on friday. She was admitted to a city hospital recently and was undergoing treatment, she died on tuesday at 63. Her grandfather, Hafiz Yusuf, founded in 1938 Shama, an iconic Urdu film and literary monthly. Sad to hear about the tragic demise of her beloved, eminent historian S Irfan Habib.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sadia.jpeg?3k3C5GBUT3.twzkvMeNsoaogI7TvJGEw&size=770:433"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"}]