[{"heading":"Fashion Friday: Deepika Padukone's gajra mohabbat wala and half-sarees in Chennai Express","summary":"Deepika Padukone wore colourful half-sarees in Chennai Express. Her make-up, on the other hand, was basic all throughout the film, including dewy base, light kohl and nude lipsticks. She tied her hair in a plait, adorned with gajras and gold hair accessories. More on that later. If you're looking for something new, you can check out the video below for more details.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/chennaiexpressff.jpeg?Gf684vmVkVAuIIHhKf70mRNjbGCaT2fh&size=770:433"},{"heading":"Miheeka Bajaj makes seashell jewellery look cool for her haldi ceremony. See pics","summary":"Rana Daggubati and Miheeka Bajaj are all set to tie the knot on august 8. The wedding ceremony will be bio-secure and will have a special theme on the day before the lockdown was announced. He will get married to the couple on july 8 in january, which will take place in the city of london on september 25 - november 20 – october 20.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/miheeka_bajaj_haldi_ceremony_s.jpeg?ETxYCVOCAonuITioMNWFBgYvJfXHS.98&size=770:433"},{"heading":"What is the future of fashion shows? Top designers tell us","summary":"The fashion industry is trying to adapt to the 'new normal' this year. It's the first time a designer has showcased his collection at the digital Paris Haute Couture Week in July 2014. He also presented 13 looks in an film. The designer says it was an experience to showcase digitally. But, temporarily, the online showcases have allowed us to compensate for the new trends in fashion shows. Click here for all the latest fashion trends and trends.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/tarun_tahiliani_and_rahul_mish.jpeg?.9K2or_6kmdAJtG.YADZruUt5H907Ean&size=770:433"},{"heading":"Kenya man matches his bright-coloured suits with face masks. See pics","summary":"The 59-year-old jack of all trades modelled his collection of face masks for Reuters. He now has about 160 suits, over 200 pairs of shoes, and 300 hats in colours ranging from saffron yellow to grass green, scarlet and plum. His clothes drew curiosity, then admirers when they first started wearing them 25 years ago. This country has no money, despite the fact that many of us don't know how to wear them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Kenyan_fashionista_James_Maina.jpeg?wHQDCZ0C9FajsQjqzvb2RbbjfRSfTv_M&size=770:433"},{"heading":"Rihanna reveals she felt like a clown in 2015 Met Gala cape gown: I remember being so scared","summary":"The 32-year-old singer wore a yellow floor-sweeping cape gown to the Met Gala in 2015. She was afraid of getting out of the car wearing the gown because she felt overdressed for the occasion, she told Access TV. Reutersshe said she circled like three times, 'i'm not even joking. This is like too much.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Rihanna_at_2015_met_gala_1.jpeg?j0YH.LGYVeYpnKEBPLnONrZ1xO8iBoMD&size=770:433"},{"heading":"Fashion Friday: Birthday Girl Kiara Advani has a lehenga collection worth drooling over","summary":"The actress opted for a pastel pink Manish Malhotra lehenga. The voguish blouse design is among the most stylish blouses you will ever lay your eyes upon, and also the heavily-embellished border can make any girl feel weak in the knees. She has always turned heads in lehengas and made remarkable statements. This week's Fashion Friday will be held on thursday at 8pm on wednesday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/BeFunky-collage__2__0.jpeg?dQ7.qwge90kDfSGAFkx6B9f9.NbFolK3&size=770:433"},{"heading":"Priyanka Chopra's sage-coloured satin shirt will cost you Rs 73k","summary":"The sky Is Pink actress was crowned Miss India and Miss World in 2000. She recently released a video on Instagram, going down the memory lane and recalling the moment when she won the miss India pageant - but what caught our eye was the stunning sage-coloured shirt that she wore in the video. If you wish to add this shirt in your wardrobe it will cost you Rs 73,323. We are not kidding, Priyanka Chopra's shirt costs Rs.73k.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/imgonline-com-ua-FrameBlurred-_45.jpeg?fLirt6NM3TtxWX8.CYHssizY94Tcagef&size=770:433"},{"heading":"Vidya Balan in red saree for Shakuntala Devi promotions reminds us of Dia Mirza. See pics","summary":"Actress opted for a red silk saree from Studio Medium. She also made heads turn in shibori sleeves while promoting her film Shakuntala Devi in the last few weeks. This ensemble takes on fun twists to the'sarae' with traditional tie dye. #vocalforlocal is innovating with age old techniques. It took us back to special screening of the film Thappad. Dia wore it in green colour and picked from the same label.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_and_dia_mirza_in_s.jpeg?VE4cZzB2dOHorHweo0p_KcXPLLfCQ.XD&size=770:433"},{"heading":"Vidya Balan pairs printed kurta set with pretty jhumkis for Shakuntala Devi e-promotions","summary":"Vidya balan wore a kurta set for the digital promotions of her upcoming film Shakuntala Devi. The actress left us speechless, once again, as she opted for an elegant set to promote the film. She took to Instagram to share pictures in the beautiful ensemble.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_in_mix_match_kurti.jpeg?CZRzWbJdkde39jNRgAiNzETv86q1IxBE&size=770:433"},{"heading":"Vidya Balan’s black chiffon saree comes with a stylish twist. We love it","summary":"The actress has been e-promoting her film for the digital promotions of her upcoming film Shakuntala Devi. She dresses up for each session and shares her photographs on the gram. On monday, she slipped into a beauteous black saree with elaborate golden border. But Vidya's six-yard drape came with red-checkered pleats - making it the half-and-half of voguish number with utmost grace.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_half_and_half_sare.jpeg?kdFUQEFA8Aqv9MVQ5YHM2z5VLADlqo82&size=770:433"},{"heading":"Nithiin completes his wedding outfit with red matching ornate mask. See pics","summary":"The protective gear which was meant to keep the virus at bay, is now being used as an accessory as well. The couple tied the knot at the Taj Falaknuma Palace amid the presence of only close family members and friends. Several photos from their revelries have been doing rounds on the internet. In some pictures, one also gets a glimpse of the groom's dapper look, completed with an ornate mask.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/nithiin_wears_ornate_mask_at_h.jpeg?Twt_oGpHpS5vB0rp5ebk9axE4_ZEMbJ5&size=770:433"},{"heading":"Fashion Friday: How Vidya Balan made the saree sexy for Millennial Bollywood","summary":"Vidya balan is a national award-winning actor. The 41-year-old star's name rarely pops up, but she is one of the only actors who embraced the six-yards and effortless clothing with such elan and flamboyance. She was even criticised massively for her weight, and the actor has talked about the same in several interviews where she addressed her struggle with weight loss and comments on her fashion.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Fashion_Friday_Vidya_Balan_sar.jpeg?.v9QPt7g41VVs.Z8C8YnmYhxvGtqSowu&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]