[{"heading":"The new Disney Plus movies and shows to watch right now","summary":"Gamesradar's picks for the new Disney Plus movies and shows to binge-watch right now.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/jYxNytZPvuFEbodihmXuiK-320-80.jpg"},{"heading":"The new Netflix movies and shows to binge-watch right now","summary":"Gamesradar's picks for new Netflix movies and shows to watch right now. From serial killer dramas to true-crime epics, these are the most widely available? but also have some US and UK-only movies & shows - including the creme de la crème of what you should be adding to your watchlist. The entire Twilight Saga is now available on Netflix so your weekend is pretty much sorted.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/2qgi7LhoMxeX6ACkgnnvmC-320-80.jpg"},{"heading":"You can become so good with a weapon in Cyberpunk 2077 that \"it’ll be like you’re using an aimbot”","summary":"Cd Projekt Red has said that the more you use a weapon, the better your character will be at using it in combat. This proficiency can reach the point where \"eventually it?ll be like you?re using an aimbot,\" says Dobrowolski in an interview with Edge Magazine. To read the full interview, be sure to pick up the latest issue of Edge magazine, out now, or subscribe to have every new copy delivered straight to your door each month.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/JRCiNWD2RQ9ex56uuYNqF6-320-80.jpg"},{"heading":"6 New Netflix, Disney Plus, and Amazon Prime movies and shows to watch this August weekend","summary":"New movies on Netflix, Disney Plus, and Amazon Prime are available. If you want more streaming recommendations, check out our list of new Netflix movies and new Disney+ movies worth watching - including a new movie on amazon and amazon.com. The best shows on Disney plusDogville? amazon Prime(Image credit: Canal+)Available: UKDoggedville is based on the lyricist who penned songs for The Little Mermaid and Beauty and the Beast.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/kGwTNBvUyFpafxJDyptgoh-320-80.jpg"},{"heading":"Future Umbrella Academy comic books may use elements from the show","summary":"The latest volume of the book is titled 'Hotel Oblivion', published in 2018 and 2019. A fourth volume has been announced, but with no projected release date. The graphic novel was used as an inspiration and springboard for the comic book's creator, Steve blackman, explains how he and his writing team have come up with new ideas for future comic stories. \"i love talking to them, and I'm very collaborative with them,\" Blackman tells LRM Online.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/4mshoxABcmokStNN7AaMti-320-80.jpg"},{"heading":"Seth Rogen says The Boys creator \"has an endgame in sight\"","summary":"The boys season 2 is set to premiere on september 4 with the first three episodes. New episodes, as well as a new aftershow hosted by Aisha Tyler, will follow weekly, and you can read the full interview with Rogen here.Best movies on Amazon Prime?Best shows on amazon Prime.best shows in amazon prime.com. - if you're interested in the series, please contact us on 0800 555 111 or visit www.amazon.co.uk.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/drhwR4LnaqvK5ABtdJZCbn-320-80.jpg"},{"heading":"PS5 has reportedly secured \"huge\" multi-platform games as timed exclusives","summary":"Former Game Informer editor imran Khan is a podcast host and contributor at Kinda Funny. Khan and cohost Tim Gettys discussed Sony's plans for timed exclusivity deals on otherwise multi-platform games. The news comes after Khan weighing the controversial PlayStation exclusive for Spider-Man in Avengers. He says there are things you will be shocked to find out that Sony is moneyhatting, that they are locking up for 'timed exclusives'.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/2aw4wfXmfAfSdad5qqKRK8-320-80.jpg"},{"heading":"DC FanDome special guests and hosts announced: The Rock, Zack Snyder, and more set to appear","summary":"The DC FanDome will begin on august 22 at 10am Pacific\/1pm Eastern\/6pm BST. The 24-hour online-only event dedicated to all things DC? unveils a slate of upcoming video games, comics, movies, and more. Everyone from The Batman himself, Robert Pattinson, to Black Adam (The Rock) will be appearing. Zack Snyder has been confirmed too, so expect something Justice League Snyder Cut-related.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/7ohyQgvkSqcrh7TqzXyXZ5-320-80.jpg"},{"heading":"Gotham readies for Harley - Punchline rematch in Batman #98 preview","summary":"'the Joker War' part four of six goes on sale on september 1 by the creative team of writer James Tynion IV,?artist Jorge Jimenez, and covers artists.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/ijLnHNMafDsNyaEv5aqhNW-320-80.jpg"},{"heading":"Suicide Squad game is the next project for Batman: Arkham dev Rocksteady","summary":"The developer of Batman: Arkham Knight has finally revealed its next game: Suicide Squad. The rocksteady Games Twitter account shared a teaser image for the project, telling fans to expect more news at the online DC FanDome event set for august 22 - the event is set to take place on thursday, august 7, 2020.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/u2QeKaPJcywWChzcj28evL-320-80.jpg"},{"heading":"Get a gaming laptop deal at Lenovo in the US or UK today with these great savings","summary":"Us readers can save 15% on most Lenovo Legion gaming laptops and desktops. In the UK our exclusive code FUTURE15 will save you the same amount on Lenovo's gaming machines Stateside. This is a great deal as we really think the Legion machines are some of the best going. Head there to check out how it stacks up against the competition. Get 15% off on the Lenovo Y740 15-inch laptop with code SAVE15Save 150% on all the ray-tracing capable beasts.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/mPKwJJNdXX5Grs2uAEu46A-320-80.jpg"},{"heading":"The best Samsung Galaxy Watch prices and deals right now","summary":"The Samsung Galaxy Watch is the premium model in Samsung's wrist-bound smart tech devices. It offers a 3-4 day battery life, really great fitness, health and stress trackers, and very slick operating system and bezel design which allows you to navigate said system. The screen is excellent and clear and great for previewing messages, emails and even pictures, as well as glancing at it for fitness updates mid-workout. And the removable and changeable straps are also great bonus too.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/pzeerZXKHNjdrHiPxZFQEA-320-80.jpg"},{"heading":"Things get messy in Dceased: Dead Planet #3 preview","summary":"Writer Tom Taylor's other digital-first DC series DCeased: Dead Planet is on sale this week. The publisher will preview the next issue on september 1 - the second issue of the series'might even be better than the first series' he illustrates this through the lens of several characters, but also makes us feel something for these characters and their innateinnate ability to make them feel like they're a part of their own saga.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/enpqPwKjQRzHVXdp4Nzjcc-320-80.jpg"},{"heading":"Destiny 2 Solstice of Heroes 2020 armor, rewards, and rules revealed ","summary":"The Destiny 2 2020 Solstice of Heroes event kicks off on august 11. The event will be open to all players, including new light newcomers, and will run through september 8, giving players a month to complete everything it has to offer. This includes acquiring and upgrading sets of armor through the European Aerial Zone event, which functions just like it did last year: kill waves of Hive, Cabal and Fallen to spawn bosses.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/3MwmxAJMnjhhfJ8YF6vnmW-320-80.jpg"},{"heading":"Halo Infinite 64 video takes Master Chief to Craig's Crash Site","summary":"The Halo Infinite campaign trailer debuted. The demake trailer starts with Master Chief and the pilot crash landing on Zeta halo, all narrated by the pessimistic pilot. It's an N64 version, his voice lines are replaced with a bunch of Banjo-Kazooie style grunts and \"No!\" effects that play as his text appears on screen.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/NZi9Q8Em6Tqcdj7tgWu82A-320-80.jpg"},{"heading":"Hush and Flashpoint get the DC Dark Multiverse treatment","summary":"Dc's don't-call-it-What-If? series of one-shots will continue in November.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/emTCz62SmzydDHMovramxS-320-80.jpg"},{"heading":"Eddie Brock and Virus go \"Beyond\" in Venom #27 preview","summary":"Comics releases a preview of interior pages from 'Venom Beyond'. The issue continues the arc that launched in #26, leading into the new eponymous King In Black event later this year. It's the beginning of the next episode of Venom #27, which focuses on Knull, the dark god of symbiotes, finally arriving on Earth to challenge Eddie Brock and whichever Marvel heroes he can convince to join his cause.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/ceKc3onSnGoUr2qWEkYcyX-320-80.jpg"},{"heading":"Xbox One multiplayer and 10 games including Modern Warfare will be free to play this weekend","summary":"Xbox One multiplayer will be free to all players this weekend, as will several big games that you can play with friends. Some games have more specific trial windows, with a few opening as early as 12am PDT\/ 3am EDT \/ 8am BST on August 6 - but they're all clustered around those days! despite persistent rumors suggesting otherwise, there are no big changes coming to the experience of Xbox Live Gold, although some aren't available until the event officially stats.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/mG6zGqiX7TrrNDpfF9bP8V-320-80.jpg"},{"heading":"King In Black prequel puts Peter Parker back in the Venom suit","summary":"Author and artist Greg Land recently collaborated on a symbiote Spider-Man title. He has been at work at the edge of the Marvel Universe for years, and is the creator of all-black, the Necrosword, dark blade with the power to kill gods. Black Knight's inclusion in the story is interesting for several reasons. For one thing, Dane Whitman\/Black Knight wields the Ebony Blade.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/5QtXAfUkjSmPCrhpJ5cEcg-320-80.jpg"},{"heading":"God of War director Cory Barlog drops hints about what PS5 could mean for a sequel","summary":"Director cory barlog has dropped hints about what PS5 could mean for the God of War sequel. He said the studio has been playing around with the new possibilities presented by the super fast-loading SSD, and how that plays into something the god of war series has always strived toward. For me, the SSD is amazing. I'm impatient and I don't like any kind of load times,\" Barlog said in the interview in animal crossing.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/y77iN6hZL7cU5SLJsDY9qL-320-80.jpg"},{"heading":"The Elder Scrolls Online and Doom Eternal will be free upgrades on PS5 and Xbox Series X","summary":"If you've yet to buy Doom Eternal or The Elder Scrolls Online, you can grab a console copy now. Both titles will support backwards compatibility when the new consoles launch, but the updated next-gen versions with graphical upgrades and other enhancements won't arrive until later. Bethesda says more information, including more precise release windows for each game, and list of next gen improvements, will be shared in the weeks and months ahead.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/iPKatp6VvEFwBwMeYXSwhR-320-80.jpg"},{"heading":"Fortnite Tenet Easter egg could kick off a new crossover event ","summary":"There is a Tenet easter egg in the secret basement of Steamy Stacks Unit 4. It's possible that either we'll be getting an upcoming tenet crossover in Season 4 or maybe something to do with the live event. You may hear snippets of music from the latest trailer, though it seems to be faint, so some users have reported not hearing it at all.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/wm955TGa5baeebYSPK8WcT-320-80.jpg"},{"heading":"NBA 2K21 gameplay trailer brings dunks, dribbles, and Stormzy","summary":"2k has already confirmed the game will be coming to PS5 and Xbox Series X at a later date following its initial release on PS4, Xbox One, and PC on september 4. The new trailer shows footage of NBA 2k21 running on current gen platforms, but it's already being confirmed that it will cost more on those platforms - but those who purchase the Mamba Edition will receive an upgrade once they make the jump to new consoles.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/oCP8QcedcVBUFjpccZ23Rb-320-80.jpg"},{"heading":"Cyberpunk 2077 Night City Wire part 2 is coming on Monday","summary":"The next Cyberpunk 2077 Night City Wire event will begin on august 10 at 9 am. That's Monday of next week, meaning there will only be a four-day wait between the initial announcement and the broadcast going live.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/3dHrvsQm6FmAWezfd93ATW-320-80.jpg"},{"heading":"The best Disney Plus bundles: Hulu, ESPN+ and global offers compared","summary":"Disney Plus bundles include Hulu and ESPN Plus at a discount. You can sign up for longer-term deals or get extra streaming services at discounted prices - and you're making $4.98 saves each month here in the u.s. This new streaming service isn't just about Disney cartoons, but it's growing all the time","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/EwekVaQgd4k7HRgF99JEYG-320-80.jpg"},{"heading":"How to stream Hamilton online and on TV around the world","summary":"The popular show is available via Disney Plus on July 3 2020. The musical's cinematic release has been fast-tracked to July thanks to the coronavirus pandemic (it was originally scheduled to land in theatres October 2021)","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/otC8xkqhAa4GwPbZNH9H86-320-80.jpg"},{"heading":"Disney Plus gift cards: delivery, info, prices, and alternatives explained","summary":"Disney Plus offers a digital gift card that can be delivered to any email address you like at the time of your choice. It saves about $14 compared to paying for the new streaming service monthly - so you're effectively getting two months for free by buying one year upfront.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/BtLRif9743FH7is2Awxc7f-320-80.jpg"},{"heading":"Disney Plus free trial - are they still available?","summary":"The free trial no longer seems to be available at the time of writing (July 2020) but we're not sure why they've disappeared. A single month costs $6.99 in the u.s., $8.99 for the united states,?5.99, and $89.99 in australia. You can stream Hamilton via Disney Plus as of July 3 2020","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/rFAJoe4iDXKCL9gru4yKBk-320-80.jpg"},{"heading":"Sony still questioning whether Silver & Black movie could work without Spider-Man, director Gina Prince-Bythewood reveals","summary":"The female duo were originally scheduled to appear in a movie together. But plans have since changed and the last we heard Sony was developing solo movies for both heroes.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/bVube2g7Khshq4PeJEF4gR-320-80.jpg"},{"heading":"Jurassic World: Dominion will have larger roles for its Jurassic Park returning cast than just cameos","summary":"Jurassic World: Dominion is set to resume filming momentarily. The original trilogy is now available on the streaming service. Here's what else you should be watching on Netflix this month?","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/hvLf6FkDM7PdDbGFw6gdh3-320-80.jpg"},{"heading":"\"It's a very unique take on Macbeth\" ? Harry Melling teases Joel Coen's The Tragedy of Macbeth","summary":"The director will next helm The Tragedy of Macbeth, a new take on Shakespeare's classic work. Despite the movie missing one coen brother, it looks set to be an 'unique' take in the classic story. The film has halted filming due to the Coronavirus pandemic.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/ePCbbPxQAqWJvzRyYjnjkB-320-80.jpg"},{"heading":"Halo Infinite toy potentially reveals death of major Halo 5 character","summary":"Another Halo Infinite toy set has potentially leaked a major character death for the upcoming Xbox Series X game. However, be warned that the following contains potential spoilers, though we can't confirm anything this far from the game's Holiday 2020 release.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/GEc5ycq4Hk68oKyBM7RUbf-320-80.jpg"},{"heading":"Fallout 76, Soulcalibur 6, more coming to Game Pass for July","summary":"Fallout 76, Soulcalibur 6, CrossCode, and Out of the Park Baseball 21 will be available on both console and PC Game Pass when it goes live on the platform.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/fxnjUHhQJY5oYbnim5ukCG-320-80.jpg"},{"heading":"Spider-Man: Into the Spider-Verse 2 producer says the sequel's art will make the original look \"quaint\"","summary":"\"groundbreaking art techniques\" used to develop Into the Spider-Verse 2 will make the original movie like \"quaint\" the movie still looks incredible two years later.","picture":"https:\/\/cdn.mos.cms.futurecdn.net\/vaeXgcEedBEhzowNhahWtd-320-80.jpg"}]