[{"heading":"Chelsea boss Lampard says he will hold no grudge if Willian joins Arsenal","summary":"Brazilian winger Willian is on the verge of joining arsenal next season. The 31-year-old's contract expires at the end of a champions league campaign in january - after his current employers only offered him two years extension which left him disappointed. He has scored 63 goals and provided 62 assists in 339 appearances for Chelsea since his arrival from Russian club Anzhi Makhachkala in 2013.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RTS34LMF.png?1XIu.QfrbfnDpEqPBTB9TiYyATEEXB5B&size=770:433"},{"heading":"Raphael Varane takes responsibility for Real Madrid Champions League exit","summary":"Defender Raphael Varane took full responsibility for his side's 2-1 defeat at Manchester City. The 27-year-old made two catastrophic errors which saw the spanish side knocked out of the champions league 4-2 on aggregate on tuesday night. He was missing his usual defensive partner Sergio Ramos who was suspended and the frenchman lost his concentration in two crucial moments.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/2020-08-07T190804Z_1837217698_.png?yDM36HFuH8yA_NFnwVuWFUhjjHSlbWke&size=770:433"},{"heading":"Sarri indirectly blames coronavirus lockdown for Juventus' Champions League exit","summary":"Maurizio Sarri is devastated by his team's last 16 exit to olympique Lyonnais. The 61-year-old says he doesn't think top-level executives decide based on a single game. His side were unbeaten in the competition until their 1-0 first leg defeat to Lyon in march.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/AP20220745910907.jpeg?Qa1SqYUDYPM9eIk32Ed_6TxBSzgZBItO&size=770:433"},{"heading":"Shoaib Malik needs to clear 2 coronavirus tests before flying to England ","summary":"The PCB is planning to fly-out t20 specialist Shoaib Malik to Southampton on 15 August. He will need to clear two negative Covid-19 tests before leaving on august 15 to join the Pakistan team at Southampton ahead of the three-match series against England beginning august 28.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/malik.jpeg?ed21PXCWZ7L3KiiwB_oAVlOzzbs5VpUd&size=770:433"},{"heading":"Champions League: Juventus exit, Man City beat Real Madrid to reach quarterfinals","summary":"Manchester city beat real madrid 2-1 (4-2 on aggregate) at the Etihad stadium on friday. City keeper Ederson forced into fine saves to keep out efforts from Karim Benzema and Eden Hazard in the ninth minute of the game - but it was not enough as the french side reached the quarter-finals on away goals.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/ronaldo.png?ggJEuXRbMZuKJZquhikTbQnl1xT2xxmb&size=770:433"},{"heading":"Manchester Test: England hope after Pakistan batting flops on Day 3","summary":"The visitors were reeling at 137 for 8 with their lead reading 244 at stumps on Friday. They lost 7 wickets for 117 runs in the post-tea session day 3 of the 1st Test which saw them lose 7 batting for the first time in a row. The hosts had resumed the day on 92 for four and Ollie Pope (62) looked relatively assured as he moved to his fifth test half-century.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/stokesrootengvspakday3.png?5.n.9U2OKoB8PaBbZpgMGIfFU4BUEpjx&size=770:433"},{"heading":"Virat Kohli, Rohit Sharma lead prayers for Kerala Air India flight crash victims","summary":"India cricket stars offer their prayers and support to the victims of the plane crash. The aircraft skidded off the runway at the Kozhikode international airport in the southern Indian state - the country's 'Vande Bharat' repatriation initiative to bring back expatreates from foreign countries.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/airindiaplanecrashviratkohli.png?S95KBWlnIyUhPffhWdm0I33s4Keb5hli&size=770:433"},{"heading":"More time for preparations: Mithali Raj on Women's World Cup postponement","summary":"India's ODI captain Mithali Raj will be 39 when the women’s world cup is played in 2020. The batting great is not perturbed about the postponement of the tournament due to the novel coronavirus pandemic, the international cricket council announced on friday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/mithaliwomensworldcuppostponed.png?tzlsUlRVlCWuSR2XjRRUSuRlpx0msWOf&size=770:433"},{"heading":"India to host T20 World Cup in 2021, 2022 edition in Australia","summary":"India will host the ICC Men’s T20 World Cup 2021 as planned. The decision comes after the international cricket council (ICC) Board met via teleconference on friday. It will be held in australia in 2022, the board of control for cricket in India (BCCI) retains its hosting rights.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rohitsharma.jpeg?fVHV5HiUw.KVt_mpfdHjUjeYpbH5UH2s&size=770:433"},{"heading":"Women's World Cup postponed until 2022 due to coronavirus pandemic","summary":"The women's world cup has been postponed until 2022 due to the novel coronavirus pandemic. The decision to delay in the 12th edition of the premier 50-over tournament was taken at the ICC Board Meeting on tuesday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/mithaliraj.jpeg?6OJ606P1qSGOGCebq85S63HAgV.YGOzl&size=770:433"},{"heading":"IPL clash sees England, India limited-overs series moved to early 2021","summary":"The BCCI and the ECB confirmed the mutual decision.england were scheduled to play 3 ODI and as many T20Is in the lead up to the world cup but the global tournament getting postponed due to a Covid-19 pandemic, the British cricket board and britain have agreed to delay the series. The IPL will be held from September 19 to November 10 in egypt from september 10 to march 2021.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/viratkohliodiscoronavirus.jpeg?1dqJjCK_SDIOdojhFBo9RXL5y9Tkz3Yo&size=770:433"},{"heading":"Rahul offers career advice to Hardik's newborn baby: Ask him to become all-rounder","summary":"Hardik Pandya and Natasa Stankovic became first-time parents after the birth of their baby boy on July 30. The couple threw a mini party that involved cake-cutting and physical distancing as well. He mentioned the doctors in his post and thanked them for 'bringing my baby' to this world. Will be grateful forever,\" kL Rahul wrote. \"let's talk cricket,\" the photo captioned.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/hardikpandysonphoto.jpeg?H5.ZuQ9iuSb1rT89d1LIIX.hcrM26i_8&size=770:433"},{"heading":"How can Pakistan players claim India got T20 World Cup postponed? Madan Lal","summary":"Former india fast bowler madan Lal has rubbished allegations from a few Pakistan players. Lal said the t20 world cup was postponing due to the novel coronavirus pandemic, keeping in mind the absence of crowd and other sponsorship issues. The BCCI confirmed Indian Premier League (IPL) 2020 in the September-November window only after the T20 World Cup was delayed by the International Cricket Council (ICC).","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/madanlal.jpeg?6Mp8R4s8IP.TZpWqhPBHektBiudClQcV&size=770:433"},{"heading":"IPL 2020: Franchises start quarantining, coronavirus testing processes for players","summary":"The biggest Indian cricket festival is set to kick off in united arab emirates on september 19. The eight franchises have already started to gear up their preparations for the world's biggest T20 league which goes by the name of Indian Premier League (IPL) the IPL was originally scheduled to start from March 29 was postponed indefinitely after April 15 due to the rising number of coronavirus cases in the nation.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Ik1RjW0N_0_0.jpeg?q3giu9mMsERAjf3176.C7CqtkCvlUJTV&size=770:433"},{"heading":"Former captain Sarfaraz shouldn't carry shoes: Akhtar slams Pakistan management","summary":"The former Pakistan captain was seen carrying shoes in the middle after the wicket of his replacement Mohammad Rizwan. The incident did not go unnoticed by fans, commentators and even former cricketers who have slammed pakistan team management for showing disrespect to the Karachi-born. He called Sarfaraz Ahmed a 'docile and weak man' who must have led Pakistan team in same timid manner. It's why Mickey Arthur always dominated him.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/stokesazhar_flicks__26_.jpeg?QeyTQDfppGqpjyYzmSiO.jDCSibiq3wX&size=770:433"},{"heading":"Harmanpreet Kaur rues WBBL clash but bullish about Women's T20 Challenge","summary":"Rearranged women's T20 Challenge will come as a boost for the game after the COVID-19 shutdown. The three-team challenge looked uncertain this year after it was postponed in march following the novel coronavirus outbreak - but the scheduling clash with the WBBL in the united arab emirates isn't ideal, says captain Harmanpreet Kaur, who has been named brand ambassador for fantasy sports gaming platform WTF Sports.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/womensiplt20challenge_0.jpeg?6Li8QpkNwDuI66LWXr8fLsmu22LiOfqb&size=770:433"},{"heading":"Top shuttlers including Nehwal, Sindhu resume training at Pullela Gopichand Academy ","summary":"Sports authority of india has decided to resume the Badminton National Camp for 8 athletes. The decision was taken after clearance for the camp was received from the Telangana government on august 1 allowing resumption of sporting activities from Aug 5. The eight athletes who will resume training at the academy include PV Sindhu, Saina Nehwal, Kidambi Srikanth, Ashwini Ponnappa, Chirag Shetty, Satwiksairaj and N Sikki Reddy.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/SIndhu.jpeg?AKGfWZX5xjmo3mi1i1VKdqXz1zRqMI2m&size=770:433"},{"heading":"Really important that youngsters learn right technique: Ex-hockey captain Chetri ","summary":"Former india captain believes learning the right technique at an early age is key to success. Former goalkeeper says youngsters in the country are learning right techniques early in their respective careers, because that sets them apart if they want to achieve their dreams. A good coaching structure is important for the development of the game and hailed Hockey India's coaching initiatives.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Dn85l2sU0AAsIDp_0.jpeg?ZpvbWOAlTFK.iOSSaEVbEKGAXqA_zH1.&size=770:433"},{"heading":"Australian Open 2021: NSW ready to host event as Melbourne battles Covid-19 spike","summary":"New south Wales deputy premier says his state would be willing to act as a temporary host for major sports events such as the Australian Open tennis grand Slam. The event is due to start in January and tennis Australia said organisers had not drawn up contingency plans for the tournament to be moved out of Victoria if they cannot be held in neighbouring Victoria because of COVID-19.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/download__3_.jpeg?iNaoqLSc3ZLAWOVg2_.wuHNzpRjX9rqE&size=770:433"},{"heading":"Shan Masood only 2nd Pakistan opener to hit 3 successive Test hundreds","summary":"Shan Masood is the first Pakistan opener in 24 years to score a century in England.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/shanmasoodengvwi.png?IoTUs4qFMqxbRT3zag28wRiJGQ7xBHo_&size=770:433"},{"heading":"Mithali Raj defends BCCI scheduling of Women's T20 Challenge ","summary":"India ODI captain Mithali Raj understands the frustration of foreign internationals on overlapping of T20 Challenge and WBBL dates. But firmly believes that BCCI \"did its best\" to fit in the four-match tournament in these unusual COVID-19 times, he said. The decision last week ended months of uncertainty for the Indian players whose 2021 World Cup preparations have been badly affected by the pandemic.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/womensipl2020t20challenge_3.jpeg?ZrbqGvsZMqFXQXFblKmV3lXCFGv.DfIE&size=770:433"},{"heading":"Premier League clubs vote against 5 substitutes for next season","summary":"Teams will revert to using up to three substitutes per match in the 2020-21 campaign. If the league restarted in June, it will be a three-month hiatus due to the outbreak of the novel coronavirus. Teams could continue to use five substitutions next season, but individual federations and leagues have agreed to adopt the rule.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/jurgenklopparsliv.png?fnj4GZjE_nYjnncC2AmrSh6o5hoiR6Jv&size=770:433"},{"heading":"Cricket Australia considers moving Boxing Day Test to Adelaide amid coronavirus fears","summary":"Cricket Australia is contemplating moving the traditional Boxing Day Test against India from Melbourne to Adelaide due to rising COVID-19 cases in the state of Victoria. A senior cricket official told the country's leading daily that there is no way the current schedule can go ahead as planned with state border restrictions in place amid the coVId-19 pandemic.Victoria has so far reported over 13000 positive cases for the coronavirus besides 170 deaths.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/viratkohlitimpaine.jpeg?kFAsNdDScxDNZ1CKEns3XDlaqN0HxGFq&size=770:433"},{"heading":"ICC Board Meeting: BCCI, CA to discuss swapping of T20 World Cups in 2021, 2022","summary":"The ICC's all-powerful board meets on friday. The decision will also be impacted by the stand of the two boards on the next chairman, the nomination process of which is yet to be announced formally. It is expected that BCCI president sourav Ganguly and secretary Jay Shah will reach a consensus on hosting of 2021 and 2022 editions in early next year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/souravgangulypmmodi.jpeg?jjFNc5zMbPuX2RsvXxdD257iqSQC0O5e&size=770:433"},{"heading":"IPL 2020: Looking forward to seeing a driven Virat Kohli, says Aaron Finch","summary":"Rcb snapped up the services of australia captain Aaron Finch for Rs 4.4 crore after a bidding war with Kolkata Knight Riders at IPL 2020 auction in December 2019. The big-hitting openers is keen on joining the team in the UAE as he is excited to see the drive and competitive nature of the captain upclose in Indian Premier League (IPL) 2020. It was postponed due to the novel coronavirus pandemic and it missed the April-May window.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/viratkohliaaronfinchrcbipl2020.jpeg?Sq5frBoidlLo51eFYG2xub3O.U4eF5Bk&size=770:433"},{"heading":"Fans will see MS Dhoni in his best fighting spirit in IPL 2020: Suresh Raina","summary":"Chennai Super Kings star Suresh Raina says fans will soon see MS Dhoni's helicopter shots in the UAE. He says his CSK captain is pumped for the 13th edition of the IPL, scheduled to be held from September 19 to November 10th. It is expected to take place from september 19 - November 10. Despite having not played competitive cricket for more than a year, raina said. The three-time champion has been working hard on his fitness and skills over the last few months.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/msdhoniipl2020.jpeg?DWBmr9HHWvqNLCHs42UPOepkKP8rpVtf&size=770:433"},{"heading":"Badminton: Tai Tzu Ying plans to play on at least until 2021","summary":"World number one says she plans to compete on the badminton circuit for at least another year. The 26-year-old said last year she would consider retiring after this year's Tokyo Olympics but with the Games pushed back to 2021 due to the COVID-19 pandemic she will stick around a bit longer. I will play until the end of next season before I revisit the decision.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/taitzuyingtokyoolympics.png?PqeMj85I5rUze5qMkZppiKd8RC5yESkD&size=770:433"},{"heading":"Serie A: Cristiano Ronaldo scores from free kick as Juventus beat Torino 4-1","summary":"Goalkeeper Gianluigi Buffon made record 648th Serie A appearance . Cristiano Ronaldo scored from a free kick as Juventus beat Torino 4-1 . It was his first goal in 43 free kick attempts during just under two seasons with the club . The win left the league leaders with 75 points from 30 games, seven ahead of second-placed Lazio who are at home to AC Milan later on Saturday . Lazio are at the etihad to take on ac . -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/2020-07-04T164943Z_1158993309_-770x433.png?6eh81DCF513.ewSoxAngUkU6qJ8QTxbs"},{"heading":"Premier League: Greenwood shines as five-star Man United crush Bournemouth","summary":"Manchester united beat Bournemouth 5-2 in the premier league on saturday . Anthony martial, Marcus Rashford and Bruno Fernandes scored for united . United move into fourth place on 55 points from 33 games, one more than Chelsea who were at home to Watford in the 1900 GMT kickoff . Alan pardew's side have now lost 17 of their last 22 league games . Click here for all the latest premier league news . Read: manchester united v ..","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/2020-07-04T151957Z_1461922447_-770x433.png?TbOy0nw20Dk6QPJ9a5o4rFyTpnlJYdrB"},{"heading":"Covid-19 pandemic has exposed the world?s weaknesses: Leander Paes ","summary":"Leander paes says he felt disgusted after seeing the video of a white police officer kneeling on a black man's neck . The incident has led to massive outrage across the globe . \"i have faced it subtly, a few times,\" he says . He has announced that he will bring the curtains down on his illustrious career in 2020, but has faced racism on certain occasions, he adds he doesn't have the personality to do it .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Paes-770x433.png?_MVJdd4HPpgUMGgY8gZ3EaDLPEIP0XxJ"},{"heading":"Leicester City beat Crystal Palace 3-0 to keep their Champions League hopes alive","summary":"Jamie Vardy nets his 100th premier league goal as Leicester City beat crystal palace 3-0 . The result means Leicester remain third in the table, eight points behind manchester city . Crystal palace are 13th on 42 points, while Leicester are third on 43 points . Chelsea have won three of their last five games, while manchester united have won just one . Man united's aaron ramsey scored his first goal of the season in a 2-0 win over swans -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-04_at_10.47-770x433.png?I17IHVGlqSKbaIsbSrOF1jWUbcOsSOlX"},{"heading":"Working together through ups and downs: Sakshi on 10 years of marriage with MS Dhoni","summary":"Sakshi Singh and MS Dhoni got married in dehradun on July 4 in 2010 . The couple now have a daughter named ziva, who was born on February 6, 2015 . \"walking together for 10 years has been a team work,\" Sakshi wrote in her social media post . 'playing fair by not pushing each other has made us stronger,' she wrote . Missing our loving and caring friends who have been our strong support system at all times. Without them the journey would be bland' .. .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Sakshi-770x433.png?9g_ovO9GdOdH4xNzyufJ_GZgJ1NHmfeu"},{"heading":"Always got your back: Hardik Pandya responds to Kohli, raises push-ups challenge bar","summary":"Hardik Pandya took social media by storm last week when he came up with a video showing him performing superman push-ups . Virat Kohli got motivated and tried out the \"fly push ups\" the all-rounder's latest viral video was shared by virat kohli (@virat.kohli) on Jul 2, 2020 at 4:49am PDT . He took 2 days to think and respond and this time around took his push up game a notch highe .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/2019-06-16T165007Z_1333295708_-770x433.jpeg?2C77S5yxfdO.m2HS_qi3OSOJS_b97Ql8"},{"heading":"Valtteri Bottas to start season-opening Austrian GP on pole position","summary":"The front-row lockout by Mercedes equalled Ferrari's record of 65, and the \"Black Arrows\" were in a private duel at the scenic Red Bull Ring . Hamilton was 0.012 slower than the Finn's time of one minute 02.939 seconds, set on his first run . Bottas will start the formula one season on pole position after denying Hamilton the top slot in Austria . He will start on pole after his third career f1 pole after 2017 and 2018, and one on pole -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/GP-770x433.png?VcdRLdaQaIQCoN.6q.PMMNz1a9BkeTJM"},{"heading":"Frances Tiafoe tests positive for coronavirus, exits Atlanta tennis event","summary":"Frances Tiafoe has withdrawn from the all-American team cup tennis tournament in Atlanta . The 22-year-old defeated Sam Querrey on friday but was showing symptoms after the match . Top-ranked Novak Djokovic and three other pro players had tested positive for the virus after playing in a similar exhibition event in Europe . Pro tennis tours are suspended until august . A limited number of fans and not requiring masks, though will provide them if requested. The event is gra .. .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/AP20186552829920-770x433.jpeg?BUF72IXSNfQ.V4n4Bt9gsvch3c3Ch7Bs"},{"heading":"Current Australian team have best chances of winning Test series in India: Hogg","summary":"Former australia chinaman bowler says Pakistan can beat india in their own backyard . Hogg says the Kangaroos have their best chance of winning a Test series in india . The 49-year-old played 123 ODIs and 7 Tests for australia . He says pandemic has opened the door for the ultimate cricket rebirth - a series between india and pakistan in a four-match test series between the two nations - hogg said fans were starving for gra gragra","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/stokesazhar_flicks__11_-770x433.jpeg?w5yipC28MZH0.ci78toIYvIduhILPEys"},{"heading":"Here's adding a little clap to it: Virat Kohli aces Hardik Pandya's jumping push-ups","summary":"India skipper Virat Kohli attempted all-rounder Hardik Pandya's 'jumping push-ups' challenge. He aced the challenge by adding a clap twist to it and showcasing his physical strength, strength and strength if it was to move forward and backward. His elder brother and teammate Kru","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/RTX4RY8L-770x433-770x433.jpeg?7DA5gErWvDtXv8_0bjqVy4Ko0A.KQSA1"},{"heading":"Will get to learn a lot from Sachin Tendulkar if Mumbai Indians picks me: Sreesanth","summary":"Pacer S Sreesanth said he would uproot the middle stump of world number 1 test batsman Steve Smith. The 37-year-old also said that the way Steve and David Warner made a come back after their 1-year ban due to ball-tampering scandal, motivated him.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/stokesazhar_flicks__8_-770x433.jpeg?cgjAaofU.x2FcBiS.cSoIEl7.Z4wMDoY"},{"heading":"La Liga: No fans at stadiums for rest of the season","summary":"Spain's secretary for sport says fans should be allowed back once it is safe to do so. The league drew up a draft protocol in the event that the government approved their return.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/realmadrid-770x433.png?q3W3RXeKrK2EFh09fbB.3iRO0dUhAIMm"},{"heading":"3rd Test between England and West Indies to go #RedforRuth to support cancer charity","summary":"The 3rd England vs West Indies Test will be played as the Ruth Strauss Foundation Test. The game will go #RedforRuth on July 25 to support families facing the death of a parent to cancer, through the work of the 'rutherforruss foundation'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/RTS2MLOU-770x433.png?q4YXUHI2TfM0Yik8KOh_GyJjFrUOCP7g"},{"heading":"England vs Pakistan: Babar Azam sets sights on triple hundred in Test series ","summary":"Babar Azam says he doesn't want to be compared to india captain Virat Kohli. The 25-year-old averages over 50 in ODI and T20Is and a little over 45 in Tests while not having played as much as his Indian counterpart. 'it would be better if people compare me with one of the Pakistan","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/babarazamviratkohli-770x433.jpeg?2rgcrB3WF1I452NJ0peC0QxSZR6tql5j"},{"heading":"Novak Djokovic and his wife test negative for coronavirus","summary":"The top-ranked player tested positive for the virus after playing in an exhibition series he organized in Serbia and Croatia amid the pandemic. No social distancing was observed at the matches in Belgrade and Zadar, Croatia.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/djoko-770x433.png?xEDiFLdk8krEADF0Tv4gz9u9wjMKt3aD"},{"heading":"Once tried to give batting advice to Younis Khan which he didn't take kindly: Grant Flower","summary":"Grant flower served as batting coach of pakistan cricket team between 2014 and 2019. He said that younis Khan was a tough player to mentor and narrated an incident when the former skipper held knife to his throat during an argument. Flower was speaking on the following on cricket Podcast.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Younis_Khan-770x433.png?i_gdOo56RMyHFKhPhCLeGTY6k9K.TaYw"},{"heading":"Covid-19: Wimbledon donates strawberries to health workers","summary":"The all England club says it will donate 200 portions of strawberries to workers on the front line of the coronavirus pandemic every day.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/wimbledon_0-770x433.png?JYL6IipAMzR7kJkWWGXL.wZMZxHyWPML"},{"heading":"CSK batsmen including Dhoni were playing 200-250 balls per session: Piyush Chawla","summary":"India leg-spinner piyush Chawla revealed that MS Dhoni looked in supreme touch during the Chennai Super Kings preparatory camp ahead of 2020 IPL. The 31-year-old former Kolkata Knight Riders (KKR) player said that the former India captain was showing no signs of rustiness at all.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/EXJOcKAXQAEqHdY-770x433.jpeg?1.bN2ehdfE9uUhDR10RTosqnfrZm_DqK"},{"heading":"When and where to watch Manchester City vs Liverpool live online, TV in India","summary":"Liverpool will be looking to win their first match as premier league champions. They take on rivals Manchester City at the Etihad Stadium on friday (Friday morning - IST) the match between Manchester city and Liverpool is telecasted live on star sports 1 and Star Sports Select 1 in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/premierleaguelivestream-770x433.png?KJFyYwGj9tk4xeS4aLT16GHcP8Icv9sm"},{"heading":"I pray to god that Pakistan don't play to draw series in England: Shoaib Akhtar","summary":"Former fast bowler says he wants to see all Pakistan players test negative for Covid-19 but play with a positive intent and challenge England. The first batch of players have begun training at their bio-secure Worcestershire base. 6 more Pakistan cricketers, including Mohammad Hafeez, Wahab Riaz, Shadab Khan and Fakhar Za","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/babarazampakistanafp-770x433.jpeg?tZN7YOYIu.9J.qo6O7DCfcU2cT2Nshpq"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"}]