[{"heading":"OnePlus 7T Pro, iPhone 11 and more: Best deals, discounts during Amazon Freedom Sale 2020","summary":"Amazon India has announced that it will host a new, \"Freedom Sale\" this sale is already underway and will go on till 11:59 pm on august 11, 2020. Customers will be extended aggressive offers, including bank offer allowing them to get 10% instant discount up to Rs 1,500 while making purchases using SBI Credit cards on minimum purchase of Rs 5,000. There will also be no-cost EMIs on credit cards and Debit cards, Bajaj Finserv, and Amazon Pay Later.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Amazon1.jpeg?KNb87qBIBJkss2JGkcgc_jB07NwC_lTS&size=770:433"},{"heading":"Redmi K30 Ultra confirmed for August 11 launch, to feature 120Hz display, MediaTek Dimensity 1000+ SoC","summary":"The redmi K30 Ultra is expected to be launched in china. It will be the sixth device in the series, with the company previously announcing five devices under the upcoming series. This is the first time the device has been upgraded to Android 11 later this year. The phone will also be powered by the Dimensity 1000+ and will have an 8-megapixel camera main camera instead of 64MP.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Redmi_K30_Pro.png?p3Cge4Fms1jN2Kh8aMGvWMe7xCSk_OhA&size=770:433"},{"heading":"Poco X2 starts getting MIUI 12 update, becomes first Poco phone in India to do so","summary":"The update has been kicked off with the Poco X2, with reports claiming the release of the new software.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Poco_X2.png?8g4BTFBI8eFbxxgnS5NKCMjbtkGeqV7r&size=770:433"},{"heading":"BSNL launches 425GB monthly plan with 100Mbps speed at Rs 849: Get all details","summary":"Bsnl has launched a new circle-specific Bharat Fiber Broadband Combo plan at Rs 849 that offers 425GB per month with 100Mbps speed. Once the data limit is reached, the operator will reduce the speed to 2Mbps. The plan brings with it unlimited local and STD calls to any network across India.Users can subscribe to this plan on an monthly, annual, biennial, and triennial basis.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-03-16_at_4.39._1_0.png?tLwRa3_PMqjaMmW1Cw242HdbQTMPRPh7&size=770:433"},{"heading":"Realme X3 Pro tipped to pack Snapdragon 855 Plus processor","summary":"Realme X3 Pro has surfaced on the Geekbench 5 benchmarking website. It will be powered by a Snapdragon 855+ processor, which also powers its siblings x3 and superZoom, according to the list - first spotted by twitter tipster abhishek Yadav. The single-core points scored by Realme's RMX2121 model are 786 while the multicore scores are 2556.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/realme_phone_weibo.jpeg?vrzi1s_xA3JjQH6RDHI7r1Rc_DZ6diqC&size=770:433"},{"heading":"Google accidentally reveals pre-order details of Pixel 5, Pixel 4a 5G","summary":"Google has reportedly leaked the launch date in its official blog. The pre-order for the Google Pixel 5 would begin from October 8 but it can get further delayed and the phone will arrive only by the end of this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-04_at_10.01_1_0.png?O4dmdZzz8AAhvHk2A08PoziPNSVVrRLu&size=770:433"},{"heading":"Your Qualcomm chip-based Android phone might be at risk, thanks to new vulnerability","summary":"A vulnerability in Qualcomm Snapdragon chip may have put over 40 per cent of global Android devices at risk. The vulnerability has been found in Snapdragon's digital signal processor, also called DSP, which could make it prone to exploits. Hackers would need the user of these devices to install an application that will gain access to most confidential data on the device, such as phone calls, contacts, photos, location, and real-time microphone data.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/android_pixabay.jpeg?evI4Q3u0ITPOK_bRLUBk5of.C0K9CfBG&size=770:433"},{"heading":"Netflix will now be available to users in Hindi on mobile, TV and web","summary":"Netflix has launched its User Interface (UI) in Hindi for those who prefer the language. The aim behind the new UI is to help users easily \"discover, access and enjoy their favourite Indian and international films and series\" the Hindi user interface is available across all devices on mobile, TV, and web - from the sign up to search rows, collections, payment and payment. It will also be available to users outside of India, according to VP-Content, Netflix India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/image005.jpeg?Kna_tWSYpzXyPf7ZwsjiHfC4yzYob.1j&size=770:433"},{"heading":"Twitter mistakenly tells iOS users about reply limiting feature on the app ","summary":"Twitter on Wednesday told all the iPhone users that they would now be able to control who replies to their tweets but turns out Twitter didn’t do it intentionally. The app accidentally revealed in the description of the upcoming feature, which is not rolling out as of now.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-03-19_at_11.16_0.png?2X1_XipEP0PqK9mBFbywJfEOZieGZUQB&size=770:433"},{"heading":"WhatsApp rolls out ShareChat video support for Android, iOS beta users ","summary":"Whatsapp has rolled out the ShareChat video support in its latest Android and iOS beta updates. Users will have to update to the latest beta version of WhatsApp on Play Store to get the sharechat support. The feature would let users search for images, videos, files, audio, links, etc in the search bar that is provided on the app. If you are looking for a particular document that you might have sent to one of your contacts but don’t remember the date, you can enter the details of the documents.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-03-16_at_12.10_1_0.png?S5IJWUaCVtHFS.qInfCMo.NREIpO3HsB&size=770:433"},{"heading":"Facebook allows work from home till July 2021, employees to get $1000 for home office needs","summary":"Facebook will allow corporate employees to work from home till July 2021. It will also provide those employees working from the home with $1000 for home office needs. Facebook has set the cancellation of all major events till June 2022 - a cancellation date for the company's employees is set to be announced on thursday. U.s. President obama has said he will not be able to reopen offices if the government had handled this better.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_1.06._0.png?FM2sjFFskEyteBzwNXcPOJTYzKifG4EZ&size=770:433"},{"heading":"Realme C12 with 6000mAh battery spotted, could launch soon","summary":"Realme has been spotted with a 6000mAh battery, which was last seen on C15. This means it is coming to multiple markets and India could also be one of them, although the smartphone has not been listed on the regulatory BIS website or an e-commerce website. If that happens, the latest C-series from Realme will be totally different from its previous three c-Series smartphones -realme C1 and the re-launched version.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/realme_C11_-_Rich_Grey__5_.jpeg?McFs8WLRNBJBK3.HpvMGwWhk12XTd1xw&size=770:433"},{"heading":"Xiaomi says banned Chinese apps not on its phones, now working on clean MIUI","summary":"A new version of the MIUI will be extended to users in the weeks to come. Some of these apps come pre-loaded on Xiaomi phones and form the core of existing miUI versions. If manu Kumar Jain's statement is anything to go by, then all miuUI apps and services that have been banned by the government will see themselves being removed from the software in future. The announcement comes after the u.s. Government of India recently banned 15 new apps, some are by Xiaomi.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Xiaomi.jpeg?DoWeUr5ZSB2LzDK8_FsnweDAoON5Dpos&size=770:433"},{"heading":"Twitter will now label official govt, state media accounts","summary":"It has started the labelling process of accounts of government officials and state-affiliated media outlets. This would bring in clarity for those following any tweets that are put out on those handles as being the voice of that State. 'we'll also no longer include them or their Tweets in recommendations, as we continue to support a free and independent press,' it added.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Twitter_India_Today_Tech_0.jpeg?S0bl0fx0WomxV_jhmfMYs5lqonbW9tCX&size=770:433"},{"heading":"Mi 10, K20 Pro and more: Best offers, discounts on Xiaomi, Redmi phones during Amazon Prime Days sale","summary":"Xiaomi announced the year's biggest discount offers as a part of amazon Prime Day sale on august 6-7. Customers can avail deals and offers on Xiaomi’s latest smartphones, accessories and ecosystem products. One of the products on sale is the Mi 10 which is currently priced at Rs 49,999 and 54,99 respectively for 8GB + 128GB and 8g + 256GB variants. During the sale, the phone will be available at an additional exchange offer of Rs 4,000 on the overall value.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Mi_10.png?M2Jmx8boUUzldLNnaRcUqHk.rFyAspXG&size=770:433"},{"heading":"Zoom brings in lighting adjustment, noise suppression, other features: Here is how to use them","summary":"Zoom has brought in lighting and noise adjustment features, filters and reactions to make the video calling experience more fun. Users can now adjust the settings of how they appear on a Zoom call. They will have granular control over the intensity of touch-ups and lighting adjustment. They can adjust brightness and skin smoothening as per their discretion. The options can be used to enhance the lighting in low light situations. If it is set on Auto by default.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_5.09._0.png?HftXv_4sJrRb7GXgppVIvp1NRRns3CXf&size=770:433"},{"heading":"Amazon Prime Day: Sony ZV-1 gets Rs 10,000 off, GoPro Hero 8 Black with Rs 3,000 discount","summary":"Amazon India has conducted a two-day exclusive sale for its Amazon Prime members. The amazon Prime Day Sale started at 12 midnight on august 6 and will go on till august 7 - the tech nerds can avail special offers and deals across different categories.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Sony_ZV_1_Amazon_Prime_Day_Sal_0.jpeg?BuIwr7WSNJKLXnfUbEJrAvDcEzxHgQfI&size=770:433"},{"heading":"Realme 6 Pro, Realme C3 now available in new colourways in Flipkart Big Saving Day sale","summary":"The realme 6 Pro and Realme C3 now come in new colourways. The mid-ranger has a new Lightning Red variant while the budget warrior is also introducing the Volcano Grey colour option on the new model. There are no other changes to both the two, meaning the specifications and prices are still the same.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/realme_6_pro_lightning_red.jpeg?8QEwzWMCXbajdZwhSLqvjCi5kUp156tD&size=770:433"},{"heading":"Facebook removes Trump’s campaign video claiming children are immune to coronavirus","summary":"The campaign statement was deemed harmful and flagged by Twitter and Facebook. The tweet violated the Twitter Rules on COVID-19 misinformation, a twitter spokesperson said. This was the first time that Facebook removed the said video because of coronavirus policy. Facebook has received criticism for not taking action against hate speech as compared to Twitter who is known for flagging misleading content from the US President’s account.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_2.47._0.png?Qnl_8qnfLUpoG0dxN0xsK0.dcgysZNMs&size=770:433"},{"heading":"WhatsApp rolls out Advanced Search Mode for Android beta users ","summary":"Whatsapp has rolled out the advanced search mode with the latest android beta version 2.20.197.7. The feature lets users search for images, videos, files, audio, links, etc in the search bar that is provided on the app. If the beta testers are using the compatible version of WhatsApp beta, they can likely receive the Advanced Search mode. This feature is under-development and there has been no official word by the company about the same.ALSO is also working on multi-device support.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-03-16_at_12.10_0.png?ZVSLetDcTTzaYGcC7gFe8gL7UNwOSLm7&size=770:433"},{"heading":"Apple iPhone 11 gets a discount of Rs 8400 on Amazon Prime Day sale: Should you buy it?","summary":"The iphone 11 has received a price cut of Rs 8400 during the amazon Prime Day sale. The two-day sale has been exclusively curated for the Amazon Prime users and is also an attempt by the e-commerce website to attract more people to get the Prime Membership. This is the first time apple iPhone has gotten such massive discount ever since it was launched in India. Meanwhile, amazon is proving an exchange offer to users. Buyers can also avail of the no-cost EMI option provided by Amazon.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-03-17_at_4.01._0.png?8wq2Xf3IP1tklLuY9Vsk5sCVULbBxh_8&size=770:433"},{"heading":"Realme Days Sale now live: Buds Air Neo at Rs 500 off, X2 Pro with Rs 3,000 discount, and more","summary":"Realme will let you buy the popular Realme X2 Pro at Rs 3,000 off under the sale. The recently-launched Realm Buds Air Neo truly wireless earbuds are on sale with Rs 500 discount - and there are a couple of discounts on using credit\/debit cards from select banks. Over and above this discount, you are eligible to get Rs 1,500 discount for using Citibank credit or debit card or have an ICICI Bank credit card.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/realme_buds_air_neo_3.jpeg?Q0g88FpuUVBuV1WBq.OtOU.rv.NiKFD.&size=770:433"},{"heading":"Amazon Prime Day: OnePlus Nord, Samsung Galaxy M31s, Xiaomi Redmi 9 Prime first sale today","summary":"The amazon Prime Day sale went live earlier today and it will go on till august 7. A lot of smartphones and earbuds will also be on their first sale during amazon prime day sales - the Nord is one of the most affordable devices by OnePlus. The nord is powered by an 8MP octa-core processor and comes with full HD+ fluid AMOLED display.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-07-21_at_9.09._0.png?vk4fsMifJ2QL1i5fkLPFaRFb9_P_Wtnx&size=770:433"},{"heading":"Now, Mi Browser used in Xiaomi phones banned in India along with 14 other apps","summary":"The government of india has added 15 more Chinese apps to the list of banned apps in the latest development. These apps include photo editor AirBrush, video tool MeiPai and camera editor BoXxCAM among others. The Mi Browser Pro that came inbuilt with Xiaomi, Redmi, Poco smartphones has also been banned in latest move. In late July, India banned 47 apps that were clones of the 59 Chinese app that was first banned over security concerns.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_12.59_0.png?i1W78PsY6pDyShZ1FOaehSyBv9Zb4lr7&size=770:433"},{"heading":"Samsung Galaxy Note 20, Note 20 Ultra India price revealed, pre-orders begin with discounts and offers","summary":"The galaxy Note 20 and the Galaxy note 20 Ultra 5G will be available at a price to match its premium stature. The company has also opened pre-bookings for its flagship devices, which are priced at Rs 77,999 and Rs 1,04,99 in India. Samsung has said that consumers can prebook their Galaxy Note 20, and Galaxy Not 20 ultra 5g starting today on Samsung.com and across leading retail stores.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Galaxy_Note20_Series.jpeg?ZouBmVdAFFCc0uUGQevjVCMKIytwy6C6&size=770:433"},{"heading":"Asus ROG Zephyrus G14 with up to AMD Ryzen 9 4900HS launched in India, price starts at Rs 80,990","summary":"Asus has announced that ROG line-up's flagship product will be coming to India, powered by the AMD Ryzen 9 4900HS processor with up to 8 cores and 16 threads, for powerful performance. The laptop also comes with a custom cooling system, and an RTX 2060 MaxQ GPU from NVIDIA. Features include UHD resolution Pantone validated 100% sRGB color-accurate display.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/G14_Black_and_White_0.png?uVzDJKSGGY7mPld4gt7OrF_gFgk0KPwq&size=770:433"},{"heading":"Google brings in Link Previews and Smart Compose feature for Android and iPhone users","summary":"New features include new commenting interface in docs on android, email notifications for Gmail on mobile and dark mode for Docs, Sheets and Slides. The feature will only be made available to GSuite customers and not for users with personal accounts. Also: Smart Compose: This feature is aimed at helping users write error-free documents fast and effortlessly through suggestions. It helps users reduce grammatical errors and spelling mistakes.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-06_at_11.02_2.png?mFeOogt3HOBMjy85uYyWpQ9Qt3h3_9SF&size=770:433"},{"heading":"India can make TikTok-like apps, building business model more difficult: Nandan Nilekani","summary":"The problem is that india is yet to be a big digital advertising market like China and the US . Most of these products essentially in India don?t make money, but they are here for strategic reasons . For now apps like TikTok are in India because they want a slice of a country?s large userbase, something that they will be able to monetise in future . If you want to have an Indian product, they don't have the revenue from other countries to cross-subgragra","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-04_at_9.25.-770x433.png?tARNbtS37WSPSW7ADPfSwuPWu7URNEOG"},{"heading":"TikTok distances from Beijing in response to India app ban","summary":"The social media app was banned in india this week following a border clash with china . The ban upset India's growing legion of TikTok stars . It has become one of the fastest-growing social media apps . India is its largest market by user, followed by the u.s., the largest market in the world . A legal challenge is unlikely to be successful, given india has cited national security concerns for the ban, a source tells Reuters this week the ban is likely to be gragragra gra","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/tiktok-770x433.jpeg?hzme4yTjVAD0vCMVWlj0_dvLMWWarph7"},{"heading":"Redmi K30 Ultra spotted with quad cameras, pop-up selfie camera and Mediatek processor","summary":"Redmi could be making a new phone reportedly to be called as Redmi K30 Ultra . The phone could launch alongside the Redmis K30 and K30 Pro . It has been spotted with a codename ?Cezanne? . Coding further reveals that the phone will come with four cameras on the back and a pop up periscope selfie camera. The main camera is expected to have a 64MP sensor . This could be Xiaomi's first phone with Mediatek chipse -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/redmi-770x433.jpeg?DZ4rXan_F39sYJfKLlFpw56baKrTm2Av"},{"heading":"Affordable OnePlus Nord teased again in new promo video, key design elements revealed","summary":"Oneplus has been constantly teasing its upcoming mid-range smartphone, the OnePlus Nord . The phone is scheduled to be priced below the $500 mark and feature competitive specs for the price . Expected to be launched in the coming days, the phone has now been teased again . Leaks suggest the display on the phone could be an AMOLED panel with a screen size of 6.4-6.5 inches running at a refresh rate of 90 Hz . Under the hood, the device is expected to have a triple .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord1-770x433.jpeg?ssy622d3kXctS9qMMFFmM1yytt2ENyv0"},{"heading":"LinkedIn found copying iOS clipboard data, says it is a bug","summary":"The popular professional social networking website LinkedIn has called a major privacy invasion on its part a bug . A LinkedIn user earlier this week highlighted that the app was copying the contents of iOS clipboard on every keystroke . The company has responded to this claim saying that it is 'a bug and not a deliberate move' a week ago Tiktok was accused of stealing what is on my clipboard every single time I type a keystroke.I don't have a way to know for sure. Though .. .-","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/link-770x433.png?c889kmhJUSEmWMhFAVHt2_h2j2U2W2cs"},{"heading":"PUBG player in Punjab reportedly lost Rs 16 lakh from parents' bank accounts, made to work at scooter repair shop","summary":"A 17-year-old boy in Punjab lost nearly Rs 16 lakh from his parents' bank accounts on PUBG . The whopping sum of money was spent on buying in-app items over a month's duration . Parents claim the huge amount was set aside as savings for the teenager's father's medical expenses . Boy told his parents that he would use the mobile phone for studying online . He also emptied his mother's provident fund and his own account, according to the report","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_erangel2-770x433.jpeg?.TQqRD40VlvGOMxlmvCZwQDf2_RAT1pU"},{"heading":"Google may integrate Chat into Gmail app, Google Meet noise cancellation to roll out in India soon","summary":"In a recent report on the development of Google?s products, it is noted that Google Chat may soon be integrated into Gmail mobile apps for Android . The report analysed the decompiled version of an application which Google uploaded to the PlayStore . These decompiled files also called APKs showed strings of code that suggest Chat could come as part of the new integration . In related news, Google has announced that its noise cancellation feature for video calling app Google Meet will be rolled out soon in India. Apart from India, the noise cancellation . Gragra","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-03_at_5.30.-770x433.png?KekCJUkfw8l4MfW2h36Yn1NPqujMe.ep"},{"heading":"Redmi 8 receives price hike in India, now retails for Rs 9,799","summary":"Xiaomi has again hiked the price of one of its best selling phones in India, the Redmi 8 . The price has now been increased to Rs. 9,799. This is quite interesting as the phone had seen a price hike just last month, and also shortly before that. The phone comes with an HD+ IPS display with Gorilla Glass 5 protection on top . It comes packed with a 5000mAh battery with 18W fast charging support, among other features . Xiaomi has also hiked its price of the redmi","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Redmi_81-770x433.png?VtLdWcCG.3RSvzwBhc1pptakB2SnUuGh"},{"heading":"Twitter drops words like slave, master, blacklist from programming to make vocabulary more inclusive","summary":"Twitter is dropping words from further usage in a bid to make its language more inclusive . The changes in words will be expanded to terms linked to discrimination based on sex, age and disabilities . In programming lingo, blacklist refers to items that are automatically denied, typically forbidden websites .Twitter aims to finish its twitter engineering project by the end of 2021. Github owned by Microsoft dropped the word master. Google Chromium web browsers will be replaced with legacy status.Gendered pronouns .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-03_at_2.26.-770x433.png?6vm__bEO7pZIE0hlqohVlr5bKYe.PgK."},{"heading":"Xiaomi MIUI Security app comes to Play Store, promises faster upgrades and better security","summary":"Xiaomi has announced its MIUI Security app for the Play Store . The app comes pre-installed in Xiaomi smartphones . Moving it to the play store will help bring faster updates . This news comes after the company announced the roll-out of MIUI 12 for thirteen of its phones . It comes with a number of new features and visual upgrades over its predecessor . Interestingly, Xiaomi also claims that it is the first mobile operating system that has passed T?V Rheinland?s ?Android System Enhanced Privacy Protection","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Mi1-770x433.jpeg?K44Me7vLddZfFmw4S_T.palvkRywpSrZ"},{"heading":"Motorola One Fusion with Snapdragon 710 SoC?launched: All you need to know?","summary":"Motorola has launched the Motorola One Fusion in Latin America without much fanfare . The phone packs some interesting features but the company has not revealed anything about the price so far . By the looks of it, the smartphone will most likely target the budget audience . Motorola one fusion will be available from July 2 across various countries in Latin america . It will also arrive in Saudi Arabia and UAE in the coming months, the company blog revealed . This is the first time the phone has been launched in the u.s. And is available","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-03_at_1.56.-770x433.png?s8VviVrehZdYQQeQPvK5Cv8yZEHc787J"},{"heading":"Likee app taken down from Google Play Store, App Store to comply with ban","summary":"Like, owned by Singapore-based bigo technologies, has been taken down from the app store . The company announced that the app will temporarily take down the app . Earlier, Bigo Live was removed from the Play Store and App Store . Government of india issued an interim order on 29 June 2020 to block 59 mobile apps, including Likee . Like was TikTok?s less popular rival in india and the company claimed that it at one point in time was downloaded more than 400 million times in the country. 59 Chinese","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-03_at_1.25.-770x433.png?WZ6V3uipAMsFEpKw3jxDuYfO_sLMdXEl"},{"heading":"OnePlus TV U1, OnePlus TV Y series launched in India: Price, specifications and features","summary":"Oneplus is looking to expand its footprint into the smart TV market in the country. The three new TVs have been launched in India as Amazon exclusives and will also be available via the company's website.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_TV_U1-770x433.jpeg?al33Gw7.ArESx326yE_0Xkuchox2g.h7"},{"heading":"GoPro to boycott Facebook and Instagram to stop hate speech online","summary":"Campaign #StopHateforProfit is picking up steam on the internet. The aim of the campaign is to stop promoting hateful content that's present across the social platforms.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/GoPro_Hero_8_0-770x433.jpeg?us8iFT2Y.xt_Ot3Chn2mg.xGF6amOg6a"},{"heading":"Samsung Galaxy Z Flip sees discount of up to Rs 15,000, Samsung Care+ programme also launched","summary":"The foldable smartphone from Samsung is now available to buy for Rs 1,08,999. The price of the galaxy Z Flip was slashed by Rs 7,000 in the last month - a price that is still Rs 1,000 cheaper than its launch price in india. If you have select handsets to trade-in, you can buy it for the same price.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/galaxy_z_flip-770x433.jpeg?DtTsEzLHOa3lTHqMWFuz1IM8RuMVn7bN"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"}]