[{"heading":"MOTN survey finds Indians unhappy with Rahul Gandhi's criticism of Modi govt","summary":"Only one out of four people said Rahul Gandhi's criticism was sensible. But a majority think he made baseless allegations against the modi government, according to the MOTN poll surveyed by the india today group-Karvy Insights Mood of the Nation (MOTN) 2020 poll survey. The poll showed that 38 per cent of 12,021 respondents think the government made basesless accusations against him. While 25% said they did not I didn't even take note of his attacks.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/GettyImages-1071816458.jpeg?DXMP0Xsouw5_l2JX80z025GjoQGT1fJf&size=770:433"},{"heading":"70 per cent feel govt should spend more on health and defence: MOTN","summary":"68 per cent of respondents said the government needs to increase spending on both public health and defence. Only 7 people want government to pick defence over healthcare, according to the Mood of the Nation poll. The survey comes at a time when India is the third worst-hit nation by coronavirus globally and has more than 20 lakh cases of viral infection. Of this, 60,7384 are still active cases, which need proper care and attention from healthcare facilities.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/pjimage_2.jpeg?b2WpV_wGmhvuxtZi6q7.hmz1WVp_jZx1&size=770:433"},{"heading":"Mood of the Nation: One-third Indians not ready to pay more for non-Chinese goods","summary":"Nine out of 10 Indians favoured boycott of china-made products. Only 67 per cent said they were ready to pay more for non-chinese goods. Despite anger reflected in the Indian Today Group-Karvy Insights Mood of the Nation (MOTN) 2020 survey, 30% said no, they weren't ready. 90% say they would like China products to be banned in country, and over 90% have supported India's decision to ban Chinese origin apps to counter the Chinese aggression.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/AFP_000_1JN78I.jpeg?f7p5hIBt62YrHudVvBCjfUWb4vk6gGJy&size=770:433"},{"heading":"Amit Shah most popular Modi cabinet minister: Mood of the Nation poll","summary":"39 per cent of Indians believe amit Shah is the best performing minister in the Modi cabinet. He has been behind some of the most historic decisions taken by the government in recent years, including repealing Article 370 in state of jammu and Kashmir and getting the contentious Citizenship Amendment Bill passed through both houses of parliament despite BJP not having enough numbers in upper house.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RTX7N5MP.png?TchsEsTJsIner5RpLK32CVna_hIugPhR&size=770:433"},{"heading":"Mood of the Nation: 9 in 10 in favour of boycotting Chinese products","summary":"Nine out of 10 Indians favour boycott of china-made products. 90% said they would like to ban products in the country, but seven per cent were not in favour of it, according to the survey. The majority of support (92%) came from people aged between 18-24 years. 'boycott China products' call began after a fatal border clash between the two countries in eastern Ladakh on June 19.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/large-journalists-and-others-p.jpeg?oCO2n.UUbm2K4If68z9MZRytqHOAwsw4&size=770:433"},{"heading":"Mood of the Nation poll: 53% Indians say will not go to theatres after reopening","summary":"Theatres have been shut since mid-March in india. The new stage of Unlock factors in cinemas, but there is a glimmer of hope for the green light in the cinema industry. Whether audiences feel confident enough to return to one is as immediate as is what they can watch. Public places such as gyms and salons were shut across India as part of lockdown after country saw steep rise in novel coronavirus cases.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RTS367WT.png?Cc1vk6HFHcXR.rOfR.7PXcltBEB8vMqQ&size=770:433"},{"heading":"58% interested in taking loans under govt schemes to tackle economic crisis: MOTN","summary":"58 per cent said they were interested in taking loans to tackle the economic crisis. A total of 12,021 interviews were conducted across 97 parliamentary constituencies across 19 states in India - despite the Modi government's promise to open up the credit lines, it was not easy convincing bankers to lend because of the losses their businesses were making. The remaining 33% were carried out in urban areas in the country, according to the Reuters report. India reopened businesses in June after months of lockdown.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/gettyimages-509157422-594x594.jpeg?xxEc6BXkU5UhCzB5hjVZ6Hu9K.k8Wgxm&size=770:433"},{"heading":"Coronavirus pandemic biggest concern for India, finds Mood of the Nation poll","summary":"70 per cent of Indians believe the Covid-19 pandemic is the biggest problem facing the nation currently. Every month since January 30, India has accounted for a growing share of the world's coronavirus cases - and now makes up nearly 10% of new cases each day. In fact, over the past few days, india has reported more cases daily than the two worst-hit nations. Despite the rising number of cases, the government has failed to curb the transmission of covid19.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/AP20208360284573.jpeg?FzmuuAai.jXIqw4N_hYkPdZJnOleI_gP&size=770:433"},{"heading":"Akshay Kumar is the Khiladi of Bollywood, finds Mood of the Nation poll","summary":"'khiladi' has been chosen the nation's Hero No. 1 by a majority of 24 per cent respondents in the MOTN poll. Amitabh Bachchan is close behind with 23% votes, while Shahrukh Khan takes the third spot with 11% votes.Salman Khan, whose popularity fell to single digits, secured the fourth rank with support of 10% of the respondents.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/AFP_000_EI9O9.jpeg?YOkQWn3faFoR6152BgM2bxf.bxwVs0ZR&size=770:433"},{"heading":"Calicut flight mishap: PM Modi, political leaders offer condolences for those killed in tragic incident","summary":"The flight was coming from Dubai and was part of India's Vande Bharat mission. The fuselage broke into two after the aircraft overshot the runway at Kalipur airport on friday evening. A team of the National Disaster Relief Force (NDRF) has been dispatched to Kozhikode from Malappuram in Kerala. Sources in Air India say the relief aircraft is on standby from Delhi to Mumbai and is waiting for the weather to clear up.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/calicut_flight.jpeg?C6mxDY814f_nde9vf8QJEbtZdTvfvasD&size=770:433"},{"heading":"Mood of the Nation poll: Deepika Padukone keeps her crown as India's Heroine No. 1","summary":"India Today-Karvy Insights Mood of the Nation (MOTN) survey reveals Deepika Padukone has kept her crown. Priyanka Chopra is close at second spot with 14 per cent votes, while Katrina Kaif takes the third rank with 13 percent votes - aishwarya Bachchan ranks fourth in the list with 10 per percent votes.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/large-88005500_20180724_001_77.jpeg?HOQdH7W8ibABE4JD1nPjdA.cnQjkCJEm&size=770:433"},{"heading":"Mood of the nation: Majority feel India's response to Covid as better than other nations","summary":"48 per cent think that India's response to the coronavirus pandemic has been better than the rest of the world. Only 7% of people said they felt the response was 'worse' than other countries, according to a survey compiled by the u.s. Mrs daniel smith, who is currently the third most affected country due to covid-19 cases, is at par with others in handling the crisis.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RTS3FZMK__1_.png?PLq1bCUCvuXa0gYlQ25NKcbotOVa0z.D&size=770:433"},{"heading":"77% Indians satisfied with PM Modi's handling of Covid-19 crisis, shows MOTN survey","summary":"77 per cent of people are satisfied with PM Modi's handling of the coronavirus pandemic in india. This is according to the findings of a bi-annual Mood of The Nation survey surveyed by the India Today Group based on the results of this year’s poll. The number of respondents who believe his performance has been 'outstanding' and 48% of those who think he is doing well is high.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/large-plasma-donors-are-seen-a.jpeg?x6gWr78ObjpC8iLQ.4oZe1zOtvmWe21_&size=770:433"},{"heading":"Be prepared for any eventuality: Army Chief Gen Naravane cautions field commanders","summary":"Army chief Gen Naravane has asked field commanders to be vigilant in border areas.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Army_Chief_MM_Naravane__PTI_.jpeg?QUmWmIiE.36Uhs0hsDSmfAOs6_a2V0ki&size=770:433"},{"heading":"Chinese whispers censored: How China's Communist Party has lens on dissent by overseas students","summary":"The online portal allows Chinese citizens to identify and call out their own for 'political crimes' this comes after the recent controversy in Australia over an article published on its website raising concerns about human rights in china and other regions like Hong Kong under its control. It was a chance for the world to see how China handles democratic dissent and political activism.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/CHINA_STUDENT_REUTERS.jpeg?MqtLptMcEknqK1YTGv72Z7gK_Rd6CYVY&size=770:433"},{"heading":"IPS officer Vinay Tiwari: I was put in quarantine to hinder investigation of Bihar Police in Sushant death case","summary":"Ips Vinay Tiwari landed in Mumbai to investigate the case on august 2. He was 'forcibly quarantined' for 14 days by the brihanmumbai Municipal Corporation (BMC) if the death case wasn't, the officer would have been allowed to leave before completing a 14-day quarantin to slow down the investigation of the Bihar Police.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/vinay_0.png?S4U8KAVcM64zNuxmOoSBkNjjtX9QUdQT&size=770:433"},{"heading":"Fact Check: No, Salman Rushdie never said Muslims destroy a nation in the name of Islam","summary":"Author of the well-known book Satanic Verses Salman Rushdie has said that the only goal of Muslims in the world is to destroy nations by terrorism. The message reads: \"Muslims, whether they live in Pakistan or India, Nigeria or Syria\" the author has requested twitter to take action against the people who are circulating it.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/salman_tweet.png?mFPDbzaIVji0FE_qyAVGIOEC0m.q5Fzm&size=770:433"},{"heading":"Anupama Pathak death: Accidental Death Report converted to FIR for abetment to suicide","summary":"Anupama Pathak was found hanging at her Mumbai home on august 2. The actress had gone live on facebook and asked people not to trust anyone. Police recovered a suicide note from her residence - but it was converted to FIR for abetment to suicide. She accused Jha of taking her two-wheeler in may and refusing to return it to her later. In her note, she mentioned company in Goregaon, where she had invested Rs 10,000 but the company wasn't returning her money.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/anupama-pathak_0.png?UeBHi_kswkTYCINeYLIPM1B32KufCePX&size=770:433"},{"heading":"National Handloom Day: PM Modi, top ministers urge India to be 'vocal for handmade'","summary":"Prime minister and top ministers took to social media on friday. They asked people to be \"vocal for handmade\" products to strengthen efforts for a self-reliant India on the occasion of the national handloom day. On national Handloom Day, we salute all those associated with our vibrant hand-loom and handicrafts sector. They have made commendable efforts to preserve the indigenous crafts of our nation.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/PM_N_Modi__PTI_.jpeg?IXncYLj_bm4ncmF_O.BVom_nL_.P7CiE&size=770:433"},{"heading":"Women's World Cup postponed until 2022 due to coronavirus pandemic","summary":"The women's world cup has been postponed until 2022 due to the novel coronavirus pandemic. The decision to delay in the 12th edition of the premier 50-over tournament was taken at the ICC Board Meeting on tuesday in new zealand and england in february, a statement from cctv on friday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/mithaliraj.jpeg?6OJ606P1qSGOGCebq85S63HAgV.YGOzl&size=770:433"},{"heading":"MP govt relaxes night curfews, Bhopal sees partial lifting of lockdown","summary":"The madhya Pradesh government relaxed night curfews by two hours and partially lifted weekend lockdowns in coronavirus-affected districts of the state. The move comes after chief minister reviewed the situation on Thursday and noted that the conditions have improved, he said. A total of 73.6 per cent has been imposed in the region, which is now 16th position with regards to the number of active cases, the official says.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Drone__PTI_.jpeg?OAv7TqCD2jtQzs6liMHUicOJ9T9QAMSw&size=770:433"},{"heading":"Fact Check: No, these cars were not damaged in recent Beirut explosion","summary":"A picture of rows of cars badly damaged along with smoke all around is being widely circulated on social media. The claim is viral mainly on the Facebook in English and Urdu languages. It has been shared with the caption, “After the devastating explosion, burnt imported cars on Beirut.”India Today Anti Fake News War Room (AFWA) has found the claims to be misleading. The picture being shared on twitter is related to the 2015 explosion which occurred in china.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/image_1.jpeg?NuLLOj1HWNhivc4nuG8p905D9W8_YI2V&size=770:433"},{"heading":"CINTAA Chairperson Amit Behl welcomes Bombay HC's move to allow actors, crew above 65 years to shoot","summary":"Amit Behl welcomes the decision to allow actors and entertainment crew above 65 years to participate in shoot. The HC quashed Maharashtra government's orders barring senior citizens from outdoor shoots and studios today (August 7). He also congratulates actor Pramod Pandey, who had filed an PIL in Bombay High Court on July 21. \"we are hoping everybody stays safe and we are back to... Healthy shooting ecosystem soon.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/amit_behl_cintaa_chairperson_w.png?nRx7kJS_UjB91dNJxCfqUbeBKROCvJ9G&size=770:433"},{"heading":"Delhi: Salary unpaid, man robs, stabs employer, arrested with two others and one juvenile detained","summary":"Police arrested three and detained one juvenile in a murder cum robbery case. The main accused Sonu was the employee of victim Dheeraj and had dispute with him over his salary dues. He told his juvenile friend about this who further introduced him to Kawaljeet, Anil and Kuldeep. Sonu informed them that there is an amount of Rs 50,000 from the shop in Tilak Nagar which the victim used to take home.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/IMG_20200806_192641.jpeg?4EKVkZo43dv._HpVlqy1m3_3ILbmeJJz&size=770:433"},{"heading":"TV actor Sameer Sharma's last Instagram posts hint at depression, loneliness","summary":"Actor Sameer Sharma was found dead at his apartment on friday. The 44-year-old actor died by suicide two to three days ago, according to the police. He had been a television actor for the last 14 years and had seen many ups and downs in his career. His Instagram is filled with his poems.sameer was battling liver disease, which kept him away from work for some time. In the past few weeks, sameer had shared many cryptic posts on social media.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sameer_sharma_committed_suicid_2_0.jpeg?cHluqQCsDESyzV_63mzp8lOToLvor2Kd&size=770:433"},{"heading":"Coronavirus: Help a call away for home isolation patients in Bihar","summary":"The nearest Covid care centres have been provided with the database of the patients under home isolation in Bihar. A system has been created to ensure that specialised medical care reaches them in the shortest possible period in case of any medical need. The state health department has set up control rooms at dedicated covid-19 hospitals, which are headed by probationary IAS and IPS officers, and officers of provincial services and health care workers have also been stationed there.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/PTI_corona_new.jpeg?JWvdxejX3TJ5tee1bHutZbftKJhJB3BM&size=770:433"},{"heading":"Good governance, socio-economic development reflects return to 'complete normalcy' in J&K: MEA","summary":"Several positive changes have taken place in terms of development in Jammu and Kashmir in the last one year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/CRPF_vehicle_Lal_Chowk_Srinaga.jpeg?3jyA0fXkXB0Fuk1tLonXmiekL8HNXPRz&size=770:433"},{"heading":"Pakistan should refrain from communal incitement: India rejects criticism of Ram temple construction","summary":"India strongly rejects pakistan's criticism of construction of the Ram temple in Ayodhya.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Anurag_Srivastava.png?6_JE7tYbp8ChUEkOICHzQY8_2Gi2sqAA&size=770:433"},{"heading":"Kerala gold smuggling case: Swapna Suresh had established links with CM Pinarayi Vijayan's office","summary":"Key accused in the Kerala gold smuggling case established a link in NIA court. Swapna Suresh had casual association with the chief minister's office through former principal secretary to the CMO M Sivasankar, who was also her mentor, despite repeated pleas from the CM, the court said. During the investigation, they discovered that she was working even after resigning and was being paid USD 1,000 as rmuneration.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Swapna_Suresh__PTI_0.jpeg?9qZHBX0oamqsjfwwuWWcn3Fs0GEuCsrx&size=770:433"},{"heading":"Heavy rains, landslides cripple Sikkim","summary":"Heavy rains in the low-lying areas of Sikkim on Thursday triggered panic among people living along the Rangit river. The rain has affected people in areas such as Legshep, Reshi, Rohtak, Baiguney, Pippaley, Sikkip and Jorethang, officials said. Authorities have issued a red alert and cautioned people from going towards the river.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rain_rep_pti.jpeg?c7wL6SjtKZ6QxS.cYJgKohSMTxvaR6dc&size=770:433"},{"heading":"Sushant Singh Rajput death: CBI files FIR against Rhea Chakraborty but can't investigate in Mumbai","summary":"The central bureau of Investigation (CBI) has filed an FIR against actor Rhea Chakraborty. However, the federal probe agency will not be able to investigate the case in Mumbai and in other places in Maharashtra. Experts have told India Today TV that the government’s notification recommending CBI probe gives consent for the agency to exercise territorial jurisdiction in the whole state of Bihar.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rhea_SSR_1_0_0.jpeg?jYH7QUg30.AVU5sndearkQ6JXPRGftiX&size=770:433"},{"heading":"J&K: LG designate Manoj Sinha arrives in Srinagar, to take oath on Friday","summary":"The 61-year-old former minister of state for railways will succeed Girish Chander Murmu who resigned from the post late on Wednesday night. Mru served as the first lieutenant governor after the Centre revoked the special status of the erstwhile state and sliced it into two union territories. It is tipped to be the next Comptroller and auditor general of India - served in the office for just over nine months.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Manoj_Sinha_file__PTI_.jpeg?Mry09xkLt9nFVOkPranp.mXGLvJbt3L0&size=770:433"},{"heading":"Rohit Sharma's adorable photo with wife Ritika Sajdeh: Just two weirdos in love","summary":"India vice-captain Rohit Sharma shared an adorable photo of his wife in his pose. The photo is being widely shared on social media and the caption has caught the attention of the fans. \"just two weirdos in love,\" he wrote.Rohit returned from new Zealand as early as the first week of February and hasn't played competitive cricket since. A calf injury kept him out of ODI and Test series.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rohitritikasajdeh.jpeg?827dSQk.BhFmInj20zd9zRR9izKuMo3v&size=770:433"},{"heading":"Gaganyaan: Astronauts-elect complete training on abnormal descent module landing in Russia","summary":"The four astronauts-elect for india's first manned space mission Gaganyaan have completed training in Russia on crew actions in the event of an abnormal descent module landing. They were in good health and determined to continue their training, a subsidiary of Russian space organisation Roscosmos said on friday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202005\/Tweetreosccps-647x363.jpeg?7GTR6DT7XgVVjtFXanjUFrJ8Dn5Gx66C&size=770:433"},{"heading":"IMD forecasts heavy rains, thunderstorm in parts of Madhya Pradesh","summary":"Heavy rainfall accompanied by thunderstorm and lightning was very likely to occur at isolated places in eastern parts of the state, the IMD said. A total of 14 cm rainfall was recorded in rehti area of Sehore district during this period, an official said. It is so far received 13 per cent less than the average rainfall in the country. The iMD forecasts are valid till Friday morning, but it's valid until friday morning..","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Bhadbhada_Vishram_Ghat_drain_B.png?ey0UAsnKn78of.fpV9u2sVcJzHgIYeOU&size=770:433"},{"heading":"Madhya Pradesh woman arrested for killing cousin over suspicion of affair with husband","summary":"A 35-year-old woman allegedly hacked her cousin to death on suspicion that she was having affair with her husband. The incident took place at padhkar village, 45 km from the district headquarters, the police said.Roshani lost her cool when she saw Lalita talking on mobile phone.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/PTI_dead-770x433.jpeg?gwCjldIc57V1UIVC4kz0hzz4d5I_BoNE"},{"heading":"No one safe in UP?s jungle raj, says Priyanka Gandhi; Congress to launch e-campaign against crime","summary":"The party launched an?e-campaign? through various social media platforms against the 'worsening law and order situation? in the state.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Priyanka_Gandhi_PTI_1-770x433.jpeg?xtcW5PheD9g2oX084QijNMn_YRF6pLka"},{"heading":"Assam: Govt allows certain relaxations during lockdown in Guwahati, Kamrup","summary":"The assam government has allowed certain relaxations during the ongoing lockdown in Kamrup (Metro) district, from July 5 to 12, chief secretary Kumar Sanjay Krishna said on Saturday. The district has reported 2,114 coronavirus cases in guwahati city since June 28 following a surge in the number of Covid-19 cases.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/PTI_assam_lockdown-770x433.jpeg?fc._FLCy2s.L22oGwx.lqVsZWLzET1wf"},{"heading":"Maha: Repayment of loans taken to make Ganpati idols worrying sculptors of Pen, stocks remain unsold","summary":"There are 1.5 lakh idol-making factories in Pen taluka where more than 2 lakh people are employed around the year. The factories sell Ganpati idols at wholesale rates and sell them at a higher rate in other cities across the country. Immediately after the festivities, work on procuring material begins all over again for the next year's celebrations.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/unnamed-770x433.jpeg?4X0zSoh0X5gEF608T7q83vOawsqtLWfT"},{"heading":"As average daily Covid-19 cases come down, experts say Delhi may go past peak in August","summary":"Experts warn that if social distancing and hygiene norms are not adhered to by people, then there could be a surge again. The national capital had reported the highest single-day spike of 3,947 cases per day in the past one week.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/CORONA_REP_PTI_2-770x433.jpeg?xVyhFkY6hIpH7guaFWm_uW8pWeF8vIV0"},{"heading":"Odisha Police seal hotel, arrest groom and kin for flouting COVID norms during wedding","summary":"A surge in coronavirus cases in Odisha's Ganjam district is giving sleepless nights. The district administration sealed hotel Mayfair Gopalpur for hosting the wedding ceremony without adhering to the state government or the MHA guidelines. Five people, including the groom and his father along with three uncles, have been arrested.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Odisha_wedding-770x433.jpeg?es..H1C0ARyTFl_erBBzCxhYODz9l_Xx"},{"heading":"2,505 fresh Covid-19 cases take Delhi's tally to over 97,000","summary":"The death toll from coronavirus infection has risen to 3,004 and the total number of cases mounted to 97,200. On June 23, the national capital had reported the highest single-day spike of 3,947 cases.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/covid_new_reuters-647x363.jpeg?CzIUP.bhVBReg6NCliVXx.03SFufq22W"},{"heading":"Heavy rains lash Maharashtra, north India reels under sultry weather","summary":"India witnessed predominantly sultry weather, with Punjab and Haryana recording above-normal day temperatures. A 12 feet wall collapsed near Khetale Garden in Hajuri area, south of Raigad, recorded 52.6 mm rainfall during the period, while the Ratnagiri city weather station recorded 57.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/RAIN_PTI_1-770x433.jpeg?L_3_S78BhJrFEj7MKKlCFMA6IqTC.mHe"},{"heading":"Noida: Man arrested for hacking into woman's Facebook account","summary":"25-year-old man arrested in Noida for allegedly posting on facebook a woman's pictures. He was identified as Kulvinder Singh, who works as sales executive at private firm in udham Singh Nagar, in Uttarakhand.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/ARREST-PTI_0-770x433.jpeg?TLWcofLZ1AFOLsIwFqZykv2n_QnI8f_x"},{"heading":"Serie A: Cristiano Ronaldo scores from free kick, Buffon breaks record in Juventus win","summary":"Cristiano Ronaldo scores from a free kick for Juventus. Goalkeeper Gianluigi Buffon makes record 648th Serie A appearance for the league leaders as they beat smaller neighbours Torino 4-1 in the Derby della Mole on sunday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/2020-07-04T164943Z_1158993309_-770x433.png?6eh81DCF513.ewSoxAngUkU6qJ8QTxbs"},{"heading":"Kerala: Elephant dies of injuries, officials say may have eaten cracker-laden fruit","summary":"Five-year-old elephant found weak a day ago with fractured jaw . It died last night at attappadi in Palakkad, hardly a month after pachyderm's death . Forest officials suspect the elephant could have bitten into a cracker filled coconut or some fruit . The elephant is suspected to have strayed from neighbouring Tamil Nadu forests as it had not been spotted earlier in any herds by forest officials so far, official said . On may 27, a . .s","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/elephant_reuters-770x433.png?m3qfIwMLQUbmwC1esEu7P0PnI3pSG28n"},{"heading":"WHO halts hydroxychloroquine, HIV drugs in Covid trials after failure to reduce deaths","summary":"Hydroxychloroquine and lopinavir\/ritonavir produce little or no reduction in mortality . Solidarity trial investigators will interrupt the trials with immediate effect, the WHO says . Decision does not affect other studies where the drugs are used for non-hospitalised patients or as prophylaxis . Who sees first results from coronavirus drug trials within two weeksWATCH | Anti-malaria drug hydroxychroloroquiine?s trials to resume, says WHO .","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/2020-07-04T174952Z_578475107_R-770x433.png?cRpo1hAMub53xR1_w9ndZZeyuPDPeVOO"},{"heading":"Assam flood situation improves, 10.75 lakh people still affected, death toll rises to 37","summary":"The flood situation in Assam is gradually improving as the water level of all major rivers is decreasing . But over 10.75 lakh people of 18 districts are still affected due to the current floods . Clear skies over the past three days have brought some relief to the people of assam . However, two people drowned in floodwaters in Morigaon and Tinsukia district on Friday, taking the death toll to 37 . A total of 6,531 people have taken shelter at 171 relief camps set n -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/PTI30-06-2020_000083B-770x433.jpeg?7WDeswhusgyJfR7108lwcvC.mKyxlw6P"},{"heading":"Let us code for Aatmanirbhar Bharat! PM invites techies to take part in App Innovation Challenge","summary":"Prime Minister Narendra Modi on Saturday urged India's tech community to participate in the 'Aatmanirbhar Bharat App Innovation Challenge' the announcement was made by the PM in a post on LinkedIn where he mentioned that india's vibrant tech and start-up ecosystem has excelled because of the enthusiasm of youngsters who are developing and promoting homegrown apps . The government of india will mentor and support existing apps that can be classified in the categories of e-learning, work-from-home, gaming . ..","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/PM_N_Modi__PTI_-770x433.jpeg?ql8js78nb5BCTZ5qz8StJCe4N9ABxO4h"},{"heading":"Covid-19 patient kept in ambulance for one day for want of bed","summary":"64-year-old man succumbed to coronavirus infection in neighbouring Navi Mumbai . He had to be kept in an ambulance for a whole day before he could be admitted to a hospital . Family did not have the money to buy an injection that cost Rs 32,000 . The man, who performed in a music band, died on June 25\"he developed coughing and breathing problem on June 20. We took him to the Navi Mumbai Municipal Corporation''s (NMMC) Covid hospital at Vnn -","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/PTI_ambulance-770x433-770x433.jpeg?Jt5vaZ3Z70hC0FAgwd9OdsUp0HczicG6"}]