[{"heading":"Video of baby elephant learning to control its trunk while drinking water will put a smile on your face","summary":"The 24-second clip shows a baby elephant trying to drink water using its trunk. According to the caption, an elephant’s trunk has up to 40,000 muscles and it takes the babies to learn how to control them. The video went viral after being shared. It was viewed over 2.5k times and received lots of likes as well. Twitterati flooded the comments section with love for the newborn elephant. We recently came across one such video tweeted by the Indian Forest Service officer Susanta Nanda.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/baby_elephant.jpeg?sI4TpX7443JmEGPmie0DL4qqIjy6_t2E&size=770:433"},{"heading":"Celebs describe months of 2020 with new meme challenge. We can relate","summary":"A new trend called the 2020 Challenge took over the social media. The trend was kickstarted by Reese Witherspoon, which is why it is also being called'reesese' the hashtag #2020ChallengeA post shared by Mindy Kaling (@mindykaling) on Aug 4, 2020 at 1:25pm PDTView this post on Instagram2020.com\/ayyii\/cynthias\/sydney.html.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/2020_challenge_0.jpeg?rzNyKtrzC6QflBep972pyh_aS62MUTH3&size=770:433"},{"heading":"Video of bunny stretching sneakily to get cuddles from partner has the internet saying awww","summary":"The clip was originally shared by Twitter account Back to Nature with the caption, “How to surreptitiously stretch within reach of kisses (sic)” after that, Indian Forest Service officer Parveen Kaswan retweeted the video. It garnered over 488k views and around 2k likes.Even the comments section was flooded with people gushing over the bunnies, one user wrote that rabbits love to be cuddled and stroked when approached in the right way.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/bunnies_2.jpeg?qBjREVCdlmlGEjhUQKOWWP9BoY5ML744&size=770:433"},{"heading":"Sonu Sood gives epic reply to student asking for PS4. Internet is impressed, again","summary":"Sonu Sood arranged transportation for stranded migrants so that they could return to their native states. He was met with a rather peculiar request from class 10 student, who asked for the PS4 to be given to the children around him. \"please, sir (sic),\" the actor wrote in his tweet with several sad emojis. His epic reply won the internet, once again; netizens were immensely impressed with his reply.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sonu_sood.jpeg?qFqmHEsbkMP8VkSnx7fVjcD.2ajmwfJH&size=770:433"},{"heading":"Hilarious video of monkey taking nap while sitting under tree goes viral. Netizens can relate","summary":"A video of the moment has left the netizens in splits. The video shows the monkey taking nap while sitting under the tree, and the animal appeared to be deep in sleep before it woke up suddenly. It was hilarious and they took to the comments section to share the instances when such an incident happened with them. If you have done this and can relate to this video, watch full screen till the end of #Shared pic.twitter.com\/9aImikrDzO.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/monkey_sleeps_while_sitting.jpeg?y8mqTLrwYjOnvrC4i9AqpKSP3CSGq7ae&size=770:433"},{"heading":"Internet is impressed with cat's fielding skills. This viral video will show you why","summary":"The clip was shared by former australia cricketer Dean Jones with the caption, \"i have seen worst fielders I can assure you! #whatacatch #gothim (sic)\" it was viewed over 150.7k times and had more than 1.2k retweets. Twitter loved the video and netizens have lauded the cat in the comments section. Even Harsha Bhogle is impresed.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat.jpeg?LMJxpvST6QIHa3HImnqZrAaZ9wcmD4Hu&size=770:433"},{"heading":"Kids caught walking with chicks in their pockets. Netizens love adorable video","summary":"An adorable video of three innocent kids walking with tiny chicks in their pockets has surfaced on twitter. The video was shared by a maths teacher from the u.s. On tuesday, the internet is delighted with the viral viral video, which has garnered over 400k views on netizens' social media accounts. \"awww this is soo cute. Omg,\" wrote another user. E-mail: cnn ireport.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/boy_caught_walking_with_chicks_0.jpeg?XSYH32Vz1zytXb.2cdEGra4thqsE1bZS&size=770:433"},{"heading":"Man's proposal turns into disaster after candles burn down the house. Girlfriend still says yes","summary":"The incident took place in south Yorkshire, England. A man planned to surprise his girlfriend by decorating his house with balloons, wine glasses and 100s of tea light candles. The proposal does sound romantic but it went up in flames because the candles accidentally burnt the whole house down. When he came back, the was flat on fire and three fire engines were on the way to rescue the situation. In the post, netizens took to the comment section to talk about the entire incident.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/117254727_3104236896278158_791.jpeg?2SR7vUVnc8LQrf5yioqwyVv3RJEvibh5&size=770:433"},{"heading":"Anand Mahindra shares video of palm tree swaying in Mumbai rains, asks if it's dance of joy or anger","summary":"The industrialist tweeted the same video with the caption, \"Of all the videos that did the rounds yesterday about the rains in Mumbai, this one was the most dramatic\" it instantly went viral and garnered over 55k views within an hour of being tweeted. It even received 5.1k likes and a lot of comments. Some of the twitter users even had some jokes for the video.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/palm_tres.jpeg?kF1aCgR1WqMYuad2g0L9_o363hwKfK9V&size=770:433"},{"heading":"Beirut explosion: Lebanese bride happy to be alive after blast cuts short wedding video","summary":"Lebanese bride Israa Seblani, 29, posed for her wedding video. The scene is shattered by a deafening roar, and powerful shockwave nearly blows her off her feet.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/beirut.jpeg?iyZqQRjCKd2N56_SjgpqmL69vEnytniI&size=770:433"},{"heading":"Man raises baby parrot after its mother's death. Internet loves heartwarming viral video","summary":"Video shows a man raising an orphaned baby parrot right from its birth from an egg to it being an adult. He shared the video with the caption, \"Sweetest thing to watch\" the parochial mother died, so she raised the baby. \"just beautiful (sic).\"Netizens loved the clip and it managed to garner more than 32.2k views within few hours of being shared online. It's one of the most heartwarming things you will see today.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/parrot.jpeg?u888xfWZ7c2mtzoLaWVxCsyo7IME9Gqp&size=770:433"},{"heading":"Penguins go gift shopping in viral video. Here’s what caught their attention","summary":"Penguins are among the most adorable creatures in the world. A recent video shared by Shedd Aquarium, u.s. Has garnered over 42k views. The video is now being shared online. Click here to watch the endearing video.com\/pegs\/pag.php? share your thoughts about this adorable video with ireport.org.int\/suicide.htm. You can follow us on twitter.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/penguins_go_for_shopping.png?o.un38J4BfnQWG5nDiy5aaKFwUWQXSDQ&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]