[{"heading":"Polish opposition shows rainbow LGBTQ solidarity at President Duda's swearing-in","summary":"President Andrzej Duda was accused of running a campaign laced with homophobic rhetoric. He argued that lesbian, gay, bisexual and transgender people \"are not people, it’s an ideology\" the opposition and members of the international community condemned the ally's words, condemning the protests and slammed the political opposition. The MPs wore rainbow masks at the swearing-in in solidarity with the LGBT community.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_6.27._1_0.png?DfuI_0dtEMY9t9PCHismI9QWlT6b93J6&size=770:433"},{"heading":"Naked man chases wild boar after it steals his laptop. Pics from Germany go viral","summary":"Naked man chased a wild boar and its piglets, after they stole his laptop. The incident took place on friday in Teufelssee, in the grunewald forest in germany, according to the BBC. He was enjoying the nature when the animal snatched plastic bag from him, which also contained the laptop. After Adele shared the pictures on her facebook account, they instantly went viral and managed to garner more than 7.3k likes and 2.3k comments.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/download_2_0.jpeg?1eyyeR4p.bYzzlPOKQSt_VnoUHnpb.0l&size=770:433"},{"heading":"Nagpur Police offers grammar lessons to scammers in hilarious tweet","summary":"Police departments across the country share creative and witty posts on social media. Netizens laughed hard as they addressed a sarcastic tweet to scammers. They posted several screenshots of fraudulent messages sent to people by scammer. The tweet has garnered over 700 likes. It has been shared by the police department since being shared on twitter.com, which is the best tweet I've seen today. If you have any questions, please contact us.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/nagpur_police_tweet.png?jWlx5d2xJz9JCNKAODIMK4iyNXVybBaU&size=770:433"},{"heading":"Lord Palmerston, UK Foreign Office cat, retires as mouse catcher after 4 years of service","summary":"Dubbed Lord Palmerston the Chief Mouser in reference to its mouse-catching duties, retired from diplomatic service. The resident cat at the UK Foreign and Commonwealth Office (FCO) in London will see out his retirement in the English countryside, where he has been spending lockdown already at home of a member of foreign office staff.Both cats have their own social media profiles and are very popular with news photographers on Downing Street duties.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat_1_0.jpeg?EveGVWPQaqauHSjzGt1QY6AJzq7cS5AU&size=770:433"},{"heading":"Coyote's head gets stuck inside glass jar. Viral video shows how conservation officer saved it","summary":"The video was shared on facebook with the caption, \"Conservation Officers in #MapleRidge freed a coyote whose head accidentally got stuck on its head\" the officer was seen removing the jar and lubricating it to make the process less painful for the animal. The footage has garnered more than 22k views, and netizens loved the rescue operation and took to the comments section to praise the officers.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Coyote_rescued.jpeg?FR_9TYLoc5HWOLUrhNvtE5oYmbGMy_Ye&size=770:433"},{"heading":"Sudarsan Pattnaik urges corona-recovered patients to donate plasma with sand art","summary":"Sudarsan Pattnaik created a stunning sand art on the Puri Beach, Odisha. He encourages covid-19 cured people to donate plasma to fight the novel coronavirus. In it, the man and the woman can be seen donating plasma. \"donate plasma, save life. Fight against Covid19,\" the text on his artwork reads. The artist's artwork was inspired by the message imparted by him.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sudarsan_pattnaik_plasma_donat.jpeg?5xuIH9TyGIr6i_R7dq_6sQ4xUoY.v7mL&size=770:433"},{"heading":"This cat’s reaction after hooman kisses it will make you go LOL. Watch","summary":"The clip was shared on twitter by the handle @meowed. It shows a girl kissing its pet cat named Pablo, but instead of being amused or feeling the love, it appears as if the cat got clueless and didn't know how to react. Netizens took to the comments section to express their thoughts. \"hei kitty, kiss her back (sic),\" one user commented. And \"the cat looks petrified (Sic).","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat_reaction_on_being_kissed.jpeg?FiLy6J_aUbxnybzqQ7M_XbwANeNmevuk&size=770:433"},{"heading":"This viral video of a lion cub trying to disturb his mom's siesta will make you smile. Watch","summary":"The 21-second clip has gone viral with over 5,000 views within minutes of being made available online. The video has already collected over 600 likes and netizens gushed over it in the comments section of the post. So cute,\" a user said. \"i thought lion king.... I'm going to have to watch this video. It's not gonna be able to do that,\" the tweeter said of it.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/lionu.jpeg?ykmIJX4YA1wDP6B.luaau0kOUMkB9mSL&size=770:433"},{"heading":"Meerkat runs away after playing prank on capybara. Hilarious video goes viral","summary":"Video shows meerkat teasing a capybara (a rodent) and running away. The video left netizens in splits and they took to the comments section to express their thoughts - and \"this is so cute\" \"why did the one sitting beside got hiccups,\" wrote another user slammed the viral video, saying it's \"so cute,\" he said. \"it is not just us humans, but even animals love doing so.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/meerkat_capybara.jpeg?9tcp3tx.sM1_qg1e1vj.3cg3A1d3mzA_&size=770:433"},{"heading":"Dog with cerebellar hypoplasia enjoys puddle in viral video. His pure joy has Internet smiling wide","summary":"The internet is full of heartwarming videos featuring these endearing creatures. One clip was recently shared by american basketball player Rex Chapman, and it will leave a big smile on your face. The video shows the doggo hopping excitedly towards the puddle and then once he discovers it, the pup enjoys the experience to full extent. This pup is not blind and instead has cerebellar hypoplasia. It is an disease caused by an inadequate development.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/stevie.png?u21mbA3ENYdsryBM8b7.5HAMmwktQqWN&size=770:433"},{"heading":"Pune Police shows how to get Insta’nt safety from coronavirus in new tweet","summary":"The police department posted a tweet to urge people to wear face masks and use sanitisers. They shared an image that will remind you of Instagram. If you are an ardent Instagram user, you must have seen the notification saying 'You are all caught up' Pune police posted the tweet, showing how to get Insta'nt safety from the novel coronavirus. It is pretty simple. You just need to dress up and maintain social distance.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/pune_police.jpeg?lau51PuvizEublthWiLOds7rU.WSC9w6&size=770:433"},{"heading":"Baby elephants tussle at Nairobi Nursery in adorable viral video. Don't miss","summary":"The two-minute clip, shot at the Nairobi Nursery of the centre, shows two baby elephants enjoying their tussle game. A user said: \"if I can’t get someone else to play with me I’ll just push this rock around — or not\" the video was shared on twitter by the Sheldrick Wildlife Trust and the internet enjoyed the clip and shared their views in the comments section of their post that has gone viral.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/elel.jpeg?noqckoGI.lYZhkfVfcOJCSpKalFVXE2b&size=770:433"},{"heading":"Fashion Friday: Deepika Padukone's gajra mohabbat wala and half-sarees in Chennai Express","summary":"Deepika Padukone wore colourful half-sarees in Chennai Express. Her make-up, on the other hand, was basic all throughout the film, including dewy base, light kohl and nude lipsticks. She tied her hair in a plait, adorned with gajras and gold hair accessories. More on that later. If you're looking for something new, you can check out the video below for more details.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/chennaiexpressff.jpeg?Gf684vmVkVAuIIHhKf70mRNjbGCaT2fh&size=770:433"},{"heading":"Miheeka Bajaj makes seashell jewellery look cool for her haldi ceremony. See pics","summary":"Rana Daggubati and Miheeka Bajaj are all set to tie the knot on august 8. The wedding ceremony will be bio-secure and will have a special theme on the day before the lockdown was announced. He will get married to the couple on july 8 in january, which will take place in the city of london on september 25 - november 20 – october 20.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/miheeka_bajaj_haldi_ceremony_s.jpeg?ETxYCVOCAonuITioMNWFBgYvJfXHS.98&size=770:433"},{"heading":"What is the future of fashion shows? Top designers tell us","summary":"The fashion industry is trying to adapt to the 'new normal' this year. It's the first time a designer has showcased his collection at the digital Paris Haute Couture Week in July 2014. He also presented 13 looks in an film. The designer says it was an experience to showcase digitally. But, temporarily, the online showcases have allowed us to compensate for the new trends in fashion shows. Click here for all the latest fashion trends and trends.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/tarun_tahiliani_and_rahul_mish.jpeg?.9K2or_6kmdAJtG.YADZruUt5H907Ean&size=770:433"},{"heading":"Kenya man matches his bright-coloured suits with face masks. See pics","summary":"The 59-year-old jack of all trades modelled his collection of face masks for Reuters. He now has about 160 suits, over 200 pairs of shoes, and 300 hats in colours ranging from saffron yellow to grass green, scarlet and plum. His clothes drew curiosity, then admirers when they first started wearing them 25 years ago. This country has no money, despite the fact that many of us don't know how to wear them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Kenyan_fashionista_James_Maina.jpeg?wHQDCZ0C9FajsQjqzvb2RbbjfRSfTv_M&size=770:433"},{"heading":"Rihanna reveals she felt like a clown in 2015 Met Gala cape gown: I remember being so scared","summary":"The 32-year-old singer wore a yellow floor-sweeping cape gown to the Met Gala in 2015. She was afraid of getting out of the car wearing the gown because she felt overdressed for the occasion, she told Access TV. Reutersshe said she circled like three times, 'i'm not even joking. This is like too much.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Rihanna_at_2015_met_gala_1.jpeg?j0YH.LGYVeYpnKEBPLnONrZ1xO8iBoMD&size=770:433"},{"heading":"Fashion Friday: Birthday Girl Kiara Advani has a lehenga collection worth drooling over","summary":"The actress opted for a pastel pink Manish Malhotra lehenga. The voguish blouse design is among the most stylish blouses you will ever lay your eyes upon, and also the heavily-embellished border can make any girl feel weak in the knees. She has always turned heads in lehengas and made remarkable statements. This week's Fashion Friday will be held on thursday at 8pm on wednesday.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/BeFunky-collage__2__0.jpeg?dQ7.qwge90kDfSGAFkx6B9f9.NbFolK3&size=770:433"},{"heading":"Priyanka Chopra's sage-coloured satin shirt will cost you Rs 73k","summary":"The sky Is Pink actress was crowned Miss India and Miss World in 2000. She recently released a video on Instagram, going down the memory lane and recalling the moment when she won the miss India pageant - but what caught our eye was the stunning sage-coloured shirt that she wore in the video. If you wish to add this shirt in your wardrobe it will cost you Rs 73,323. We are not kidding, Priyanka Chopra's shirt costs Rs.73k.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/imgonline-com-ua-FrameBlurred-_45.jpeg?fLirt6NM3TtxWX8.CYHssizY94Tcagef&size=770:433"},{"heading":"Vidya Balan in red saree for Shakuntala Devi promotions reminds us of Dia Mirza. See pics","summary":"Actress opted for a red silk saree from Studio Medium. She also made heads turn in shibori sleeves while promoting her film Shakuntala Devi in the last few weeks. This ensemble takes on fun twists to the'sarae' with traditional tie dye. #vocalforlocal is innovating with age old techniques. It took us back to special screening of the film Thappad. Dia wore it in green colour and picked from the same label.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_and_dia_mirza_in_s.jpeg?VE4cZzB2dOHorHweo0p_KcXPLLfCQ.XD&size=770:433"},{"heading":"Vidya Balan pairs printed kurta set with pretty jhumkis for Shakuntala Devi e-promotions","summary":"Vidya balan wore a kurta set for the digital promotions of her upcoming film Shakuntala Devi. The actress left us speechless, once again, as she opted for an elegant set to promote the film. She took to Instagram to share pictures in the beautiful ensemble.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_in_mix_match_kurti.jpeg?CZRzWbJdkde39jNRgAiNzETv86q1IxBE&size=770:433"},{"heading":"Vidya Balan’s black chiffon saree comes with a stylish twist. We love it","summary":"The actress has been e-promoting her film for the digital promotions of her upcoming film Shakuntala Devi. She dresses up for each session and shares her photographs on the gram. On monday, she slipped into a beauteous black saree with elaborate golden border. But Vidya's six-yard drape came with red-checkered pleats - making it the half-and-half of voguish number with utmost grace.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/vidya_balan_half_and_half_sare.jpeg?kdFUQEFA8Aqv9MVQ5YHM2z5VLADlqo82&size=770:433"},{"heading":"Nithiin completes his wedding outfit with red matching ornate mask. See pics","summary":"The protective gear which was meant to keep the virus at bay, is now being used as an accessory as well. The couple tied the knot at the Taj Falaknuma Palace amid the presence of only close family members and friends. Several photos from their revelries have been doing rounds on the internet. In some pictures, one also gets a glimpse of the groom's dapper look, completed with an ornate mask.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/nithiin_wears_ornate_mask_at_h.jpeg?Twt_oGpHpS5vB0rp5ebk9axE4_ZEMbJ5&size=770:433"},{"heading":"Fashion Friday: How Vidya Balan made the saree sexy for Millennial Bollywood","summary":"Vidya balan is a national award-winning actor. The 41-year-old star's name rarely pops up, but she is one of the only actors who embraced the six-yards and effortless clothing with such elan and flamboyance. She was even criticised massively for her weight, and the actor has talked about the same in several interviews where she addressed her struggle with weight loss and comments on her fashion.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Fashion_Friday_Vidya_Balan_sar.jpeg?.v9QPt7g41VVs.Z8C8YnmYhxvGtqSowu&size=770:433"},{"heading":"Polish opposition shows rainbow LGBTQ solidarity at President Duda's swearing-in","summary":"President Andrzej Duda was accused of running a campaign laced with homophobic rhetoric. He argued that lesbian, gay, bisexual and transgender people \"are not people, it’s an ideology\" the opposition and members of the international community condemned the ally's words, condemning the protests and slammed the political opposition. The MPs wore rainbow masks at the swearing-in in solidarity with the LGBT community.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_6.27._1_0.png?DfuI_0dtEMY9t9PCHismI9QWlT6b93J6&size=770:433"},{"heading":"Naked man chases wild boar after it steals his laptop. Pics from Germany go viral","summary":"Naked man chased a wild boar and its piglets, after they stole his laptop. The incident took place on friday in Teufelssee, in the grunewald forest in germany, according to the BBC. He was enjoying the nature when the animal snatched plastic bag from him, which also contained the laptop. After Adele shared the pictures on her facebook account, they instantly went viral and managed to garner more than 7.3k likes and 2.3k comments.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/download_2_0.jpeg?1eyyeR4p.bYzzlPOKQSt_VnoUHnpb.0l&size=770:433"},{"heading":"Nagpur Police offers grammar lessons to scammers in hilarious tweet","summary":"Police departments across the country share creative and witty posts on social media. Netizens laughed hard as they addressed a sarcastic tweet to scammers. They posted several screenshots of fraudulent messages sent to people by scammer. The tweet has garnered over 700 likes. It has been shared by the police department since being shared on twitter.com, which is the best tweet I've seen today. If you have any questions, please contact us.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/nagpur_police_tweet.png?jWlx5d2xJz9JCNKAODIMK4iyNXVybBaU&size=770:433"},{"heading":"Lord Palmerston, UK Foreign Office cat, retires as mouse catcher after 4 years of service","summary":"Dubbed Lord Palmerston the Chief Mouser in reference to its mouse-catching duties, retired from diplomatic service. The resident cat at the UK Foreign and Commonwealth Office (FCO) in London will see out his retirement in the English countryside, where he has been spending lockdown already at home of a member of foreign office staff.Both cats have their own social media profiles and are very popular with news photographers on Downing Street duties.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat_1_0.jpeg?EveGVWPQaqauHSjzGt1QY6AJzq7cS5AU&size=770:433"},{"heading":"Coyote's head gets stuck inside glass jar. Viral video shows how conservation officer saved it","summary":"The video was shared on facebook with the caption, \"Conservation Officers in #MapleRidge freed a coyote whose head accidentally got stuck on its head\" the officer was seen removing the jar and lubricating it to make the process less painful for the animal. The footage has garnered more than 22k views, and netizens loved the rescue operation and took to the comments section to praise the officers.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Coyote_rescued.jpeg?FR_9TYLoc5HWOLUrhNvtE5oYmbGMy_Ye&size=770:433"},{"heading":"Sudarsan Pattnaik urges corona-recovered patients to donate plasma with sand art","summary":"Sudarsan Pattnaik created a stunning sand art on the Puri Beach, Odisha. He encourages covid-19 cured people to donate plasma to fight the novel coronavirus. In it, the man and the woman can be seen donating plasma. \"donate plasma, save life. Fight against Covid19,\" the text on his artwork reads. The artist's artwork was inspired by the message imparted by him.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sudarsan_pattnaik_plasma_donat.jpeg?5xuIH9TyGIr6i_R7dq_6sQ4xUoY.v7mL&size=770:433"},{"heading":"This cat’s reaction after hooman kisses it will make you go LOL. Watch","summary":"The clip was shared on twitter by the handle @meowed. It shows a girl kissing its pet cat named Pablo, but instead of being amused or feeling the love, it appears as if the cat got clueless and didn't know how to react. Netizens took to the comments section to express their thoughts. \"hei kitty, kiss her back (sic),\" one user commented. And \"the cat looks petrified (Sic).","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat_reaction_on_being_kissed.jpeg?FiLy6J_aUbxnybzqQ7M_XbwANeNmevuk&size=770:433"},{"heading":"This viral video of a lion cub trying to disturb his mom's siesta will make you smile. Watch","summary":"The 21-second clip has gone viral with over 5,000 views within minutes of being made available online. The video has already collected over 600 likes and netizens gushed over it in the comments section of the post. So cute,\" a user said. \"i thought lion king.... I'm going to have to watch this video. It's not gonna be able to do that,\" the tweeter said of it.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/lionu.jpeg?ykmIJX4YA1wDP6B.luaau0kOUMkB9mSL&size=770:433"},{"heading":"Meerkat runs away after playing prank on capybara. Hilarious video goes viral","summary":"Video shows meerkat teasing a capybara (a rodent) and running away. The video left netizens in splits and they took to the comments section to express their thoughts - and \"this is so cute\" \"why did the one sitting beside got hiccups,\" wrote another user slammed the viral video, saying it's \"so cute,\" he said. \"it is not just us humans, but even animals love doing so.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/meerkat_capybara.jpeg?9tcp3tx.sM1_qg1e1vj.3cg3A1d3mzA_&size=770:433"},{"heading":"Dog with cerebellar hypoplasia enjoys puddle in viral video. His pure joy has Internet smiling wide","summary":"The internet is full of heartwarming videos featuring these endearing creatures. One clip was recently shared by american basketball player Rex Chapman, and it will leave a big smile on your face. The video shows the doggo hopping excitedly towards the puddle and then once he discovers it, the pup enjoys the experience to full extent. This pup is not blind and instead has cerebellar hypoplasia. It is an disease caused by an inadequate development.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/stevie.png?u21mbA3ENYdsryBM8b7.5HAMmwktQqWN&size=770:433"},{"heading":"Pune Police shows how to get Insta’nt safety from coronavirus in new tweet","summary":"The police department posted a tweet to urge people to wear face masks and use sanitisers. They shared an image that will remind you of Instagram. If you are an ardent Instagram user, you must have seen the notification saying 'You are all caught up' Pune police posted the tweet, showing how to get Insta'nt safety from the novel coronavirus. It is pretty simple. You just need to dress up and maintain social distance.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/pune_police.jpeg?lau51PuvizEublthWiLOds7rU.WSC9w6&size=770:433"},{"heading":"Baby elephants tussle at Nairobi Nursery in adorable viral video. Don't miss","summary":"The two-minute clip, shot at the Nairobi Nursery of the centre, shows two baby elephants enjoying their tussle game. A user said: \"if I can’t get someone else to play with me I’ll just push this rock around — or not\" the video was shared on twitter by the Sheldrick Wildlife Trust and the internet enjoyed the clip and shared their views in the comments section of their post that has gone viral.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/elel.jpeg?noqckoGI.lYZhkfVfcOJCSpKalFVXE2b&size=770:433"},{"heading":"Video of baby elephant learning to control its trunk while drinking water will put a smile on your face","summary":"The 24-second clip shows a baby elephant trying to drink water using its trunk. According to the caption, an elephant’s trunk has up to 40,000 muscles and it takes the babies to learn how to control them. The video went viral after being shared. It was viewed over 2.5k times and received lots of likes as well. Twitterati flooded the comments section with love for the newborn elephant. We recently came across one such video tweeted by the Indian Forest Service officer Susanta Nanda.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/baby_elephant.jpeg?sI4TpX7443JmEGPmie0DL4qqIjy6_t2E&size=770:433"},{"heading":"Celebs describe months of 2020 with new meme challenge. We can relate","summary":"A new trend called the 2020 Challenge took over the social media. The trend was kickstarted by Reese Witherspoon, which is why it is also being called'reesese' the hashtag #2020ChallengeA post shared by Mindy Kaling (@mindykaling) on Aug 4, 2020 at 1:25pm PDTView this post on Instagram2020.com\/ayyii\/cynthias\/sydney.html.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/2020_challenge_0.jpeg?rzNyKtrzC6QflBep972pyh_aS62MUTH3&size=770:433"},{"heading":"Video of bunny stretching sneakily to get cuddles from partner has the internet saying awww","summary":"The clip was originally shared by Twitter account Back to Nature with the caption, “How to surreptitiously stretch within reach of kisses (sic)” after that, Indian Forest Service officer Parveen Kaswan retweeted the video. It garnered over 488k views and around 2k likes.Even the comments section was flooded with people gushing over the bunnies, one user wrote that rabbits love to be cuddled and stroked when approached in the right way.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/bunnies_2.jpeg?qBjREVCdlmlGEjhUQKOWWP9BoY5ML744&size=770:433"},{"heading":"Sonu Sood gives epic reply to student asking for PS4. Internet is impressed, again","summary":"Sonu Sood arranged transportation for stranded migrants so that they could return to their native states. He was met with a rather peculiar request from class 10 student, who asked for the PS4 to be given to the children around him. \"please, sir (sic),\" the actor wrote in his tweet with several sad emojis. His epic reply won the internet, once again; netizens were immensely impressed with his reply.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/sonu_sood.jpeg?qFqmHEsbkMP8VkSnx7fVjcD.2ajmwfJH&size=770:433"},{"heading":"Hilarious video of monkey taking nap while sitting under tree goes viral. Netizens can relate","summary":"A video of the moment has left the netizens in splits. The video shows the monkey taking nap while sitting under the tree, and the animal appeared to be deep in sleep before it woke up suddenly. It was hilarious and they took to the comments section to share the instances when such an incident happened with them. If you have done this and can relate to this video, watch full screen till the end of #Shared pic.twitter.com\/9aImikrDzO.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/monkey_sleeps_while_sitting.jpeg?y8mqTLrwYjOnvrC4i9AqpKSP3CSGq7ae&size=770:433"},{"heading":"Internet is impressed with cat's fielding skills. This viral video will show you why","summary":"The clip was shared by former australia cricketer Dean Jones with the caption, \"i have seen worst fielders I can assure you! #whatacatch #gothim (sic)\" it was viewed over 150.7k times and had more than 1.2k retweets. Twitter loved the video and netizens have lauded the cat in the comments section. Even Harsha Bhogle is impresed.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/cat.jpeg?LMJxpvST6QIHa3HImnqZrAaZ9wcmD4Hu&size=770:433"},{"heading":"Kids caught walking with chicks in their pockets. Netizens love adorable video","summary":"An adorable video of three innocent kids walking with tiny chicks in their pockets has surfaced on twitter. The video was shared by a maths teacher from the u.s. On tuesday, the internet is delighted with the viral viral video, which has garnered over 400k views on netizens' social media accounts. \"awww this is soo cute. Omg,\" wrote another user. E-mail: cnn ireport.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/boy_caught_walking_with_chicks_0.jpeg?XSYH32Vz1zytXb.2cdEGra4thqsE1bZS&size=770:433"},{"heading":"Man's proposal turns into disaster after candles burn down the house. Girlfriend still says yes","summary":"The incident took place in south Yorkshire, England. A man planned to surprise his girlfriend by decorating his house with balloons, wine glasses and 100s of tea light candles. The proposal does sound romantic but it went up in flames because the candles accidentally burnt the whole house down. When he came back, the was flat on fire and three fire engines were on the way to rescue the situation. In the post, netizens took to the comment section to talk about the entire incident.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/117254727_3104236896278158_791.jpeg?2SR7vUVnc8LQrf5yioqwyVv3RJEvibh5&size=770:433"},{"heading":"Anand Mahindra shares video of palm tree swaying in Mumbai rains, asks if it's dance of joy or anger","summary":"The industrialist tweeted the same video with the caption, \"Of all the videos that did the rounds yesterday about the rains in Mumbai, this one was the most dramatic\" it instantly went viral and garnered over 55k views within an hour of being tweeted. It even received 5.1k likes and a lot of comments. Some of the twitter users even had some jokes for the video.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/palm_tres.jpeg?kF1aCgR1WqMYuad2g0L9_o363hwKfK9V&size=770:433"},{"heading":"Beirut explosion: Lebanese bride happy to be alive after blast cuts short wedding video","summary":"Lebanese bride Israa Seblani, 29, posed for her wedding video. The scene is shattered by a deafening roar, and powerful shockwave nearly blows her off her feet.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/beirut.jpeg?iyZqQRjCKd2N56_SjgpqmL69vEnytniI&size=770:433"},{"heading":"Man raises baby parrot after its mother's death. Internet loves heartwarming viral video","summary":"Video shows a man raising an orphaned baby parrot right from its birth from an egg to it being an adult. He shared the video with the caption, \"Sweetest thing to watch\" the parochial mother died, so she raised the baby. \"just beautiful (sic).\"Netizens loved the clip and it managed to garner more than 32.2k views within few hours of being shared online. It's one of the most heartwarming things you will see today.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/parrot.jpeg?u888xfWZ7c2mtzoLaWVxCsyo7IME9Gqp&size=770:433"},{"heading":"Penguins go gift shopping in viral video. Here’s what caught their attention","summary":"Penguins are among the most adorable creatures in the world. A recent video shared by Shedd Aquarium, u.s. Has garnered over 42k views. The video is now being shared online. Click here to watch the endearing video.com\/pegs\/pag.php? share your thoughts about this adorable video with ireport.org.int\/suicide.htm. You can follow us on twitter.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/penguins_go_for_shopping.png?o.un38J4BfnQWG5nDiy5aaKFwUWQXSDQ&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"}]