[{"heading":"PM Modi congratulates Mahinda Rajapaksa on being elected next prime minister of Sri Lanka","summary":"74-year-old shrewd leader is back at the top in politics with his three siblings.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Modi_Mahinda_Rajapaksa.png?qRnvJYBcck.RUdhHt6c1iYrS4KNAjQVo&size=770:433"},{"heading":"Lebanon probes blast amid rising anger, calls for change","summary":"Lebanese officials sought to shift blame for the presence of explosives at the city's port. The blast came after an accidental fire ignited a warehouse full of ammonium nitrate in the port of Beirut on thursday, killing at least 135 people, injuring more than 5,000 and causing widespread destruction. If reforms are not made, the country will \"continue to sink,\" the visiting french president says.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Beirut_blast_drone__AP_-647x363.jpeg?ROGKzw0fHLR.WShf2gVG6s9hI7_DNw.q&size=770:433"},{"heading":"Tourism-reliant Thailand defers 'travel bubble' plan as Asia's Covid graph rises","summary":"Thailand has delayed plans for a \"travel bubble\" agreement with select countries. New daily coronavirus cases rise in parts of the world, putting pressure on tourism industry and complicating efforts to revive its battered economy. The island of Phuket has instead proposed receiving direct flights from those countries, with tourists doing two-week quarantines in their hotels before going out. We are asking for travel, charter flights, into Phuket, Phuket Tourist Association President Bhummikitti Ruktaengam said.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Bangkok_temperature__AP_.jpeg?t3V3F02.SXBYUj5jdwNxe7M417gFMwPS&size=770:433"},{"heading":"US: Threat of eviction looms over millions of low-income renters as Congress spars over aid","summary":"Amanda Geno accepted what felt like a dream job offer on march 13. She was laid off in the fall, but was notified the team she would join wouldn't be hiring until 2021, the college said.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/US_FED_protests__AP_.jpeg?iidzhF3ckjorkGMhTigLWkOc2yOt0vej&size=770:433"},{"heading":"Hunted to extinction, beavers get shelter in Britain first time in 400 years","summary":"Beavers were hunted to extinction in Britain more than four centuries ago because people wanted their meat, fur and castoreum. But in 2013 a family was found to be living on the river Otter in Devon, southwest England, and threatened with eviction. Instead, they were allowed to stay for five years under trial spearheaded by the Devon Wildlife Trust charity which studied their behaviour and impact on wildlife and people.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Beaver_trial_britain_0.png?RkvqgRSaTYSWrvx3z2TLi5BI21xA3bsb&size=770:433"},{"heading":"No hoopla: Virus upends Trump and Biden convention plans","summary":"The pandemic is proving to be a tougher obstacle, denying both candidates crucial opportunities to connect with supporters in the final stretch before the Nov. 3 election. The campaigns are looking for alternative ways to deal with the virus and still reach millions of americans through television and virtual events, says one former sen.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/trump_reuters.jpeg?tjjm2K1Kxk_J9T0kas5kEFeHSqM7pPu9&size=770:433"},{"heading":"North Korea's escalating virus response raises fear of outbreak","summary":"North Korea is quarantining thousands of people and shipping food and aid to a southern city locked down over coronavirus worries. The country's response to the suspected case reinforces doubt about its longstanding claim to be virus-free. But an exchange between the u.n. And the united nations is providing new clarity - and actual numbers – about what might be happening in North Korea, which has closed its borders and cut travel, never free-flowing stream by outsider monitors and journalists.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/kiim_jong_reuters.jpeg?6szbM._kwDzOX2A4gUE8ukct8zeFwbtf&size=770:433"},{"heading":"Australia's second-biggest city enters strict new coronavirus lockdown","summary":"A six-week total lockdown in the capital of Melbourne began at midnight on friday. The closure of shops and businesses raises new fears of food shortages, as authorities battle coronavirus infections in new zealand and syria, australia and the u.s. Authorities have reopened the city of about 5 million people in july, bringing 471 new cases and eight deaths in just 24 hours.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/australia2_0.jpeg?KFDESfQXMpxDrXAXDV8vR1zC4F7Og8cT&size=770:433"},{"heading":"Timeline: Thailand's turbulent politics since 2014 military coup","summary":"Protesters are returning to the streets calling for the ousting of the government less than two years after a general election was held. One group has openly criticised the monarchy, citing the need to restore order in the face of street demonstrations against the populist government linked to telecoms tycoon Thaksin Shinawatra, who himself was ousted in 2006 coup in 2006.oct.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Thai_0.jpeg?7wlonzQCeu8XGctCys1dHRRFDiyDQ36Q&size=770:433"},{"heading":"Beirut blast not a nuclear one: Satellite images show ","summary":"Satellite images released by Planet Labs show damage caused by the blast. Damage is observed on satellite imagery up to 500m is massive - all grain warehouses upto 1 to 16 are destroyed completely with all grains burnt. Despite the high intensity the grain silo is still partially standing. The damage to temporary structures has been observed up a distance of 1300m – massive.the damage was observed in the area of 816 hectares around the point of blast.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/2020-08-05T191709Z_1889993908_.png?5mSX.shNsK8525STlXyx_Re048w8RXJ4&size=770:433"},{"heading":"Inside China's cyber war room: How PLA is plotting global attacks","summary":"The latest is the information on a secret People's Liberation Army unit. The u.s. And the european union have issued alerts against the cyber attacks in recent weeks - despite the threat of espionage and evasion of war, sources say. China is said to be conducting passive surveillance of the Indian cyber networks. In china, 50,000 analysts in Chengdu, China are solely stationed to probe and focus on India and its repertoires, including the cybersecurity space.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Chinaarmy2_0.jpeg?3qQC8Juf_mQExYkpWsMxoto8_sHTAG0Z&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]