"{\"Bangladesh Cricket Board wants ICC to extend World Test Championship cycle\": [\"The world test championship (WTC) comprises nine of the 12 Test-playing nations that face off in a two-year cycle. All nations were scheduled to play six Test series - three at home and three away but not all will play the same number of Tests. Unless the current ICC Test Championship cycle is extended there is no way we can play those eight\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Bangladesh-Test-AP_570_850-770x433.jpeg?lhxIoitwyxPN6uzHPcqWNjPXDkP5.u8o\"], \"Klopp's wife Ulla responsible for him choosing Liverpool over ManU\": [\"Jurgen Klopp is hailed for Liverpool's title-winning run in the English Premier League this season. The reds should also be thankful to his wife Ulla for persuading her husband to take up the job at Anfield instead of going to Old Trafford. He is getting the full credit for being the man responsible for taking Liverpool back\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/0_GettyImages-169500094-770x433.jpeg?juXQ_um94pwyyV1Y1ZKyg.0uqK7WTJJq\"], \"Man City will give Liverpool guard of honour, says Pep Guardiola\": [\"Manchester city will give newly crowned premier league champions Liverpool a guard of honour. The teams meet at the Etihad Stadium on Thursday, manager pep Guardiola says. \\\"we will greet Liverpool, when they come to our house, in an incredible way. They cannot complain and of course we are going to do it because they deserve it.'\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/AP20174710088071-770x433.jpeg?w5D1woKt3nJKC54xEi64XrBJvj4NXfmr\"], \"West Indies coach Phil Simmons in self-isolation after attending funeral\": [\"Fast bowler alzarri Joseph said it would not hamper the team's preparations. West indies head coach Phil Simmons has entered self-isolation after attending a funeral on friday and has to clear two COVID-19 tests before he can join the squad on Thursday - but that doesn't really disrupt our preparation.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTX1AO86-770x433.png?HIYYHhdbQTUpcMFcY8pcN8b5afkOF9Vz\"], \"John Carlos, US athletes write to IOC asking them to scrap Olympic protest rule\": [\"The 75-year-old former sprinter is leading a call for rule 50 of the Olympic Charter to be scrapped. He is one of two athletes who famously gave the black power salute on the podium at the 1968 mexican olympics - the first ever to win bronze in the 200metres. The letter calls for the I\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/AP20179582860042-770x433.jpeg?44PvGkVxI_kZ_eNf86gmt_s2BzmwyVuN\"], \"FA Cup: Extra-time Maguire winner takes Man United into semis, Wolves win\": [\"The win extends united\\u2019s unbeaten run in all competitions to 14 matches. It is the 30th appearance in the last four of the FA Cup for the club in a row.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/AP20179709916141-770x433.jpeg?TFnyYzwcdY6iWTIVyv4HA3hx4PYyWeJw\"], \"Serie A: Alberto, Immobile hand Lazio crucial victory against Fiorentina\": [\"Lazio fought back from a goal down to beat fiorentina 2-1 in Serie A on Saturday. Luis Alberto struck seven minutes from time to cut the gap to league leader Juventus back to four points.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/AP20179779404831-770x433.jpeg?qllQzWzGtsjhvZUIKww2bEZJgjxyswUu\"], \"Pant a special player, Indian team management still backs him: Rathour\": [\"Former wicketkeeper-batsman shreyas Iyer has ended the long-debated topic over india's number 4 batsmen in limited-over cricket. The 51-year-old said he hasn't seen a more hardworking cricketer like Virat Kohli in international cricket.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/WhatsApp_Image_2020-06-27_at_1_1-770x433.jpeg?RgONPM26PPnM6jQh1ePIH9aq.ilBtU_T\"], \"MS Dhoni was much calmer as captain in 2013 than in 2007: Irfan Pathan\": [\"Former india all-rounder Irfan Pathan believes that MS Dhoni changed as a captain between the 6-year period. The wicketkeeper-batsman was part of both the 2007 world cup-winning team and the 2013 ICC champions trophy winning team in 2007 and 2013.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/MS_Dhoni-770x433.png?95qmfnKq.WTleNpIHk.zFN1JNMsSKkDD\"], \"La Liga: Barca drop 2 points after 2-2 draw at Celta Vigo\": [\"Iago Aspas struck a late free kick to snatch 2-2 draw at home to the catalans on sunday. The draw put barca back on top of the table on 69 points after 32 games but real madrid can go two points clear at the summit if they beat Espanyol away from home on monday night\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/barca-770x433.jpeg?FAuUMT3Sg5UpmXNIko6EOEzGf2pkRLDe\"]}"