"{\"US imposes visa restrictions on Chinese officials over Hong Kong autonomy\": \"the announcement comes in response to moves by china to impose new security legislation on Hong Kong. he promised to punish the Chinese Communist Party officials who were responsible for eviscerating freedoms in the country. the move comes at a time of intensified US rhetoric against China in midst of Trump's re-election campaign.\", \"Pakistan tour of England: Mohammad Hafeez 'Covid-19 positive' again as per PCB facilitated re-test\": \"mohammad hafeez had tested positive for COVID-19 when the board conducted the first round of tests of all the 29 England bound players due to board the UK-bound flight on Sunday. but the very next day the former Pakistani captain posted a tweet where the result showed that he has tested negative. if convicted of not following quarantine protocol,\", \"Fact Check: Video of coronavirus patients outside hospital is not from India\": \"video shows patients lying on beds in distress outside a hospital. it is being claimed that the viral video is from services hospital in lahore, Pakistan - not from India \\u2013 and from the time when fire broke out in the surgical emergency ward of hospitals and patients evacuated from their building on thursday. the video was posted by sunjay Pari\", \"PCB didn't attend calls of players: Inzamam-ul-Haq slams medical staff after 10 Pakistani players test Covid-19 positive\": \"10 players of the national team tested positive for covid-19 prior to their tour of england. the PCB confirmed that seven more players tested negative for COVID-19, taking the total tally to 10.Fakhar Zaman, Imran Khan, Kashif Bhatti, Mohammad Hafeez, mohammed Hasnain,\", \"China should stop erecting new structures along LAC: India envoy to Beijing\": \"envoy to china says china should stop 'erecting new structures' in order to resolve military standoff along LAC. he says it is entirely China's responsibility to take a careful view of bilateral ties and decide which direction to move forward. china has to stop creating obstructions and hindrances in normal patrolling of Indian troops.\"}"