"{\"Kelly Asbury, director of Shrek 2 and Smurfs The Lost Village, dies at 60\": [\"Writer-director Kelly Asbury died at the age of 60 after a long battle with cancer. He worked on the multinational ABC series the Littles and 1985 feature The Black Cauldro\\\"\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/bfebf-770x433.jpeg?m5UmMWiRG0EGL73jf7VjqA7r_ujiEOwx\"], \"Unlock 1.0: MMRDA commits to abide by project timelines as migrants begin to return in Maharashtra\": [\"Migrant workers have started to return to work in Mumbai, the agency says. A large number of workers are returning to the metro construction sites in the state, an official says. The mrDA has announced that the June 15 advertisement has generated positive response.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Mumbai_worker-770x433.jpeg?Fc3bctRz733T_Rf_7OZe2paqVlOxN_VA\"], \"Waiting for next lock-up death: Cop suspended over objectionable comment on Tamil Nadu custodial deaths\": [\"The police personnel, identified as M Sathish Muthu, was suspended. He made an objectionable comment on the alleged torture of a father-son duo in the town of Tuticorin district, sathankulam, in taylori district of tuniya, and beniks allegedly beaten up by\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Jayaraj_Beniks__Twitter_-647x363.jpeg?zYwXhDBjh0aOp.52IHcppTWPAEFf40Uc\"], \"I had symptoms similar to coronavirus during South Africa tour: England spinner Jack Leach\": [\"The left-arm spinner has suffered from Crohn's disease (inflammatory bowel disease) since the age of 14. He has regained fitness and is now focusing on earning his place in the national team for the next month\\u2019s Test series against west indies - a series which also features newcomers Amar Virdi and Matt\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Leach-770x433.png?f6Xx12Aas34CNhclROyzgfSPLlsHI22W\"], \"Baby elephant plays with its trunk in viral video. So cute, says Twitter\": [\"Elephants are one of the most delightful animals, and the internet is full of heartwarming videos featuring these gentle giants. One such video was shared on twitter by Indian Forest Service (IFS) officer Sudha Ramen. The official shared the clip with the caption, \\\"This calf thinks the trunk is a toy! #Elephant calves\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/elephant_3-770x433.png?bv3b.4fZ1BJ68xw8qgVYWjfB2vG9jKC3\"], \"Planning to provide Remdesivir, Favipiravir for free: Maharashtra CM Uddhav Thackeray\": [\"A new programme called 'Chase the Virus' has been launched in Mumbai. The programme will be expanded to other parts of the state to combat the coronavirus outbreak, tuddhav Thackeray said he has asked prime minister Narendra Modi to extend the PM Garib Kalyan scheme to provide food for the need\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/uddhav_thackeray-770x433.jpeg?yNABgpJoK1WmQOjZpHqx.Q4j51bnoeEN\"], \"Vande Bharat Mission phase 4: Air India to operate 170 flights to and from 17 countries between July 3-15\": [\"The government started the mission on May 6 to help stranded people reach their destinations using special repatriation flights. Scheduled international passenger flights have been suspended in India since march 23 due to the coronavirus pandemic - the first phase was from May 7 to 16, following which the second phase began on July 4. Air India is scheduled to operate 495 chart\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/air_india_reuter-770x433.jpeg?lnji7hR0pHToUPZnSBIdxZW96_ndhVeT\"], \"When will there be talk of defence & security, Rahul Gandhi asks ahead of PM's Modi's Mann ki Baat\": [\"Congress leader Rahul Gandhi asked when will there be talk about the nation's defence and security? he asked in a tweet in Hindi.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/rahul_gandhi_5-770x433.jpeg?.TOaWzWPse86nJ_2X2HB8lMbVKqjPgGK\"], \"Will win both battles: Amit Shah on coronavirus, India-China standoff\": [\"Amit Shah said that he wants to assure the people of India that the country will win both the battles under PM Narendra Modi's leadership. It was the biggest military confrontation in over five decades that significantly escalated the already volatile border standoff in ladakh with China on June 15. Twenty Indian Army personnel, including oscar commander (\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Amit_Shah-770x433.jpeg?03y02df_2GAtJTReQdOCtyZ7mdUlLLAu\"], \"Befitting reply given to those who cast evil eye on Indian territory in Ladakh: PM Modi\": [\"A self-reliant India would be true tribute to the slain soldiers in the truest, deepest sense, PM Modi said. The prime minister said the country honours the spirit of friendship and is capable of giving an appropriate response to any adversary without shying away from the nation's pride to be hurt. People who cast an evil eye on\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/modidsmann-770x433.jpeg?6ycp9YMnqlgwtOT3X3mPeNyxy86yo27M\"]}"