"{\"Joe Root reminds England of West Indies' bowling depth ahead of Test series\": [\"west Indies batsmen must prepare well if they are to get better of a \\u201cformidable\\u201d bowling attack in the three-Test series next month, captain Joe Root has said. he would miss the series opener in Southampton from July 8 should it clash with the birth of his second child with vice-captain Stokes taking the reins\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTX6MG8E-770x433.png?4KtYyfT2F07cYAE0dzMq0SMm6clo28yk\"], \"He looks overweight to me: Franklyn Rose shows concern about\\u00a0Oshane Thomas's fitness\": [\"former pacer Franklyn Rose said he is concerned about the fitness of Thomas. the 23-year-old is currently in England for next month's three-Test series - which will resume international cricket after coronavirus hiatus vs. coroniavirus huasia virus virus in england on july\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Oshane_0-770x433.png?dSy8_y_rdcp7yz3Hw44wjYeAcq1FObri\"], \"Baby elephant gets encouraged by mother to walk in adorable video. Internet loves it\": [\"the video was shared on twitter by Indian Forest Service officer Susanta Nanda. it shows a baby elephant strolling with its mother in the wild, with the caption, \\\"Chaal chaal mere haathi..A young calf, few days old moves on egged by the mother. Cute baby walk (sic).\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/elephant_1-770x433.png?85O3t8AK4ka6CMZiSZRCspVzAsSFku4E\"], \"China grabbed 45,000 sq km\\u00a0of Indian land post-1962 war: Sharad Pawar\": [\"BJP chief Sharad Pawar says matters of national security shouldn't be politicised. he said one cannot forget that china captured 45,000 sq km of Indian land after the 1962 war between the two countries - a matter of nsa and the u.s. the former defence minister said the incident in ladakh cannot immediately be labelled as \", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/PTI20-03-2020_000121B-770x433.jpeg?z8OiZNjCjVyv9ximYA0.wTm83glRBc5R\"], \"Chinese propaganda machinery remains a bridge too far\": [\"china has been ratcheted up to its best performance amid the standoff in eastern Ladakh. the people's liberation army (PLA) releasing video clips and pictures in response to Indian media reports. for example, when India Today broke the news of a Bailey bridge built by Indian Army engineers within 72 hours, the PLA came out with the story of its\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/BR-PRACTICE.001__1_-770x433.jpeg?ijSurGwhRgamQHV3vExGM4BCl0yBi_9R\"], \"Salman Khan lauds Sushmita Sen for her comeback in Aarya: Isse kehte hai Dabangg\": [\"the actress returned to the screen after five years. she was last seen in a Bengali arthouse film, Nirbaak.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/hvh-770x433.jpeg?_knPdn.zt9LM9rBNt2Z54II4wAgMwYX6\"], \"Parts of Navi Mumbai to be under lockdown from June 29 to July 5: Official\": [\"from June 29 to July 5, only essential services will be allowed in the areas declared as containment zone. a total of 70,712 households will impacted by this policy. some areas in Navi Mumbai are:1. Diwale and Karave villages in Belapur2 and Juhu village in Vashi4. villagers have been asking for policies to stop the spread of\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/NAVIMUMBAI-770x433.jpeg?e5gb4xLKu_FEwRhbvGtCd6gnzCG6PveO\"], \"The NBA is coming back, and here's 10 things to know\": [\"the season will resume on July 30 at Disney's ESPN Wide World of Sports complex in Florida. here are 10 things to know about the restarted season:THE RACE FOR 8There are six teams in the race for the No. 8 seed in a Western Conference \\u2014 Memphis, Portland, New Orleans, Sacramento, San Antonio and Phoenix. there are seven games where\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/NBA-770x433.jpeg?M5zLH.HqAJlbHKrrqHmV9xVpfGZ_nbBR\"], \"BJP can fight Congress anytime, fight China now: Saamana\": [\"the BJP and the Congress traded barbs over the funding of Rajiv Gandhi Foundation (RGF) by China. the Shiv Sena said on Saturday that it is time to come together and not squabble with each other. it said: \\\"we have to fight with China. Say what you want to say on this issue\\\"\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/PTICHINA-770x433.jpeg?iSjhPvnF7S.sr2ge_UCWneU2BcpLscJL\"], \"Health ministry issues updated protocol for managing coronavirus cases\": [\"the protocol includes the use of Dexamethasone as an alternative to Methylprednisolone. the drug has already been tested on Covid-19 patients during the'recovery clinical trial'\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Covhealth-770x433.jpeg?KfnMpFF.YNVicYpfx0GaccDDFdvzPWnM\"]}"