"{\"Two Ubisoft senior execs are placed on leave as the company investigates misconduct allegations\": [\"Tommy Fran\\u00e7ois and Maxime B\\u00e9land have reportedly been placed on administrative leave. They are part of the company's editorial team, a group of designers who have \\\"overseen\\\" the development of all of its contemporary titles, from visuals to narrative design. The news comes just days after Ubisoft announced apologizing \\\"to everyone affected by\", \"https://cdn.mos.cms.futurecdn.net/hGM7jQwGfg2FaCGeA5o8d8-320-80.png\"], \"Dr Disrespect has been permanently banned from Twitch\\n\": [\"Streamer Dr Disrespect has been permanently banned from Twitch. He had over four million followers on the streaming platform, as well as an exclusivity contract with the u.s.\", \"https://cdn.mos.cms.futurecdn.net/khcaPF7K67FmxKtUDkaoqb-320-80.jpg\"], \"Outlawed: Everything we know so far about Marvel's teen-centric sequel\": [\"A new government agency called CRADLE (Child Hero Reconnaissance and Disruption Law Enforcement) regulating teen superheroes. The policy, called \\\"Kamala's Law\\\" after Kamala Khan, suffering grievous injuries in the process, came out on march 18, just before the comic book Direct Market went on widespread hiat\", \"https://cdn.mos.cms.futurecdn.net/jAh9NrovbqLV6oATLpMRUC-320-80.jpg\"], \"DC slyly references Batman history in 'Joker War' preview\": [\"The upcoming event 'Joker War' kicks off next month with Batman #95. It's written by James Tynion IV and illustrated by Jorge Jimenez and Tomeu Morey. \\\"we\\u2019re going to shake things up in Gotham City. Bruce Wayne has changed a lot, and the way he operates as Batman is going\", \"https://cdn.mos.cms.futurecdn.net/QfsKSrSaQPKyYRNMJ9LbAe-320-80.jpg\"], \"X-O Manowar joins Valiant's Bloodshot title\": [\"Valiant's flagship title Bloodshot is returning on september 16. X-o Manowar will be guest-starring in the new arc of the comic book, \\\"the long shot\\\" the series is about a hero who is desperately trying to be better despite knowing what he\\u2019s been in his past, writer Tim Seeley tells Newsa\", \"https://cdn.mos.cms.futurecdn.net/FAoqpS4i8QugAmcKnrAYrW-320-80.jpg\"], \"New Pirates of the Caribbean movie starring Margot Robbie in the works from Birds of Prey team\": [\"Margot Robbie and Hodson's pirates film is a separate entity from the franchise reboot. It will not be spin-off of franchise that starred Johnny Depp as Jack Sparrow, but rather female-fronted original story with brand-new characters under the Pirates franchise umbrella (a Pirate Cinematic Universe, if I may)\", \"https://cdn.mos.cms.futurecdn.net/BDYLFUMFJ4uYv3VpXYnY9L-320-80.jpg\"], \"Xbox Lockhart specs may have been revealed after the latest documents leak\": [\"A security researcher posted snippets from the June version of Microsoft's GameCore Development Kit notes. The notes mention \\\"LockhartProfiling modes\\\" alongside \\\"AnacondaProfileing\\\"\", \"https://cdn.mos.cms.futurecdn.net/uXXYC6SBBVsYW22gNfkZAa-320-80.jpg\"], \"The Boys season 2 release date revealed (and you can watch the opening three minutes now)\": [\"The boys season 2 is officially flying our way on amazon\\u2019s streaming service on September 4. The announcement also included the first three minutes of The Boys season 2. That teaser highlighted a Vought board meeting and was soundtracked to The Rolling Stones' \\\"Sympathy for the Devil\\\"\", \"https://cdn.mos.cms.futurecdn.net/BhCz2HxPsZx2q9KbaVoQMY-320-80.jpg\"], \"Destiny 2 Xur June 26 location and Exotics: Where is Xur June 26 - June 30?\": [\"The Destiny 2 Xur June 26 location is down in the EDZ. The snake-faced merchant will stick around until reset time on Tuesday, June 30.\", \"https://cdn.mos.cms.futurecdn.net/wYUwG39v8G4hFPMBD8eH6m-320-80.jpg\"], \"Mass Effect Mordin Solus plush sings, runs tests on a seashell, and is up for pre-order\": [\"Merch specialists Sanshee are currently taking pre-orders for their mass Effect. Mordin Solus Collector's Plush is an adorable recreation of the stalwart Salarian, but only for two more days. The plush sings four different songs when you press his left hand - with batteries included.\", \"https://cdn.mos.cms.futurecdn.net/Sjeo2VyP2ZJUVFbEmC4Bac-320-80.jpg\"]}"