"{\"OnePlus affordable TVs launching on July 2: From price to features, all you need to know\": [\"OnePlus is all set to launch new televisions across the mid-range and entry-level segments in the country next week. the new TVs will attempt to tap into the burgeoning smart TV market in india - with a new teaser pointing at the price of the entry variant model and launching in three sizes. this information is based on \", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/OnePlus12-770x433.jpeg?mKtEXOZhA.r28ZkemNPpHd1INuYnyAuM\"], \"Samsung Galaxy Note 20 Ultra again 'confirmed' to get 108MP camera\": [\"the phone is expected to launch on august 5. the rumoured phone has been leaked again, with a 108-megapixel main camera in the coming week of august. it's not the first time we've heard about the Galaxy Note 20 Ultra getting the same sized lens as was seen on the galaxy S20 Ultra.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/galaxy-note-20-wallpaper-770x433.jpeg?HG7Coc7GKY5kOzOakNkYy1UKx0DiMF_x\"], \"Affordable OnePlus Nord tipped get 32MP dual-selfie cameras\": [\"OnePlus is working on a new mid-range smartphone, which is expected to launch sometime next month. new information about the phone has started leaking online, with the latest reports claiming the smartphone could come with quad-camera set-up. this could be paired with OxygenOS 10 operating system based on Android 10.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/OnePlus_Nord-770x433.png?9F1Z0DdSnH4qP6m1ugCyWD50DDM0clK6\"], \"Facebook to label all rule-breaking posts, even Trump's\": [\"facebook has said it will flag all \\\"newsworthy\\\" posts from politicians that break its rules. separately, facebook's stock dropped more than 8%, erasing roughly USD 50 billion from its market valuation, after the company announced it would boycott Facebook ads through the end of the year over the amount of hate speech and divisive rhetoric on its platform.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Facebook2-770x433.png?ODBDa6JlyQlyScax9ENqIboVwZ1t.5E4\"], \"OnePlus Z aka OnePlus 8 Lite buzzing ahead of July launch, Insta post inspires memes\": [\"OnePlus is working on a new mid-range, more affordable smartphone. the company's @OnePlusLiteZThing Instagram account already amassing over 124 thousand followers within days of going live. if you're wondering why, the firm has also revealed that it will be releasing an exclusive documentary via this Instagram handle starting June 30.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/oneplus_8_Lite-770x433.jpeg?FzBwtzXsMFl.DUTRr_oxvLg0a73JNaUC\"], \"Google expands Business Messages feature through Maps and Search as company vows to support small businesses\": [\"Google is now expanding Business Messages through Maps and Search to help businesses connect with customers. the tech giant has also made a customer service agent accessible so that it's easier for customers to get in touch with the business. in 2018, Google maps for Android and iOS brought in this feature through which customers could directly contact stores.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-06-26_at_3.56.-770x433.png?EVMZMjVaqXHMMIo_380.Gt4H4T4eXNBs\"], \"Amazon Pay\\u2019s Smart Stores feature will let you scan, explore and pay at\\u00a0local stores: Here is how\\u00a0\": [\"smart store feature allows customers to shop at local stores and make payments via QR code. the company announced that the buyers can scan the store\\u2019s QR codes using the Amazon app to explore the products that are available in the stores. amazon Pay has enabled local shops to offer Amazon Pay reward coupons to attract new customers and give the customers a reason to come back to them the next time.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Tent_Card_Counter-770x433.jpeg?C7BvfDWp4tfrsJMMHkJZHRwn8brX_s.Z\"], \"OnePlus CEO Pete Lau teases design of new affordable TVs ahead of July 2 India launch\": [\"OnePlus is all set to launch two new series of entry-level and mid-range TVs on July 2. the company has again teased the products with CEO Pete Lau writing a blog post to explain their design philosophy. he also reveals that the new televisions will bring with them very little in terms of actual bezels and will focus on \\\"what's\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Oneplus_Tv3-770x433.jpeg?lp6BKHRGA0RfJoMQ8b.Orc.ZFQVyM6ed\"], \"Acer refreshes line-up, updates Predator Helios, Predator Triton 300 and Nitro 7 gaming laptops\": [\"the predator Helios 700 is the most powerful and features the company's sliding HyperDrift keyboard. it comes with an overclockable 10th Gen Intel Core i9-10980HK processor and NVIDIA GeForce RTX 2080 SUPER GPUs. the notebook also gets Acer CoolBoost Technology, a vapor chamber, and two\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Acer-Nitro-7-AN715-52-Standard-770x433.png?4J.wGH1UOxvQgt3Da9sv9m6FTIBh1dah\"], \"YouTube likely to come up with TikTok-like short video platform\\u00a0\": [\"the feature would let users create and post a 15-second video on the app. it would be similar to the Bytedance-owned short video app. YouTube is currently experimenting with it and there can be mass rollout only when the testing is over.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-04-02_at_9.56.-770x433.png?Zbgpl3FLkG5vTeVp2c4Qjv8EnBWrPNOM\"]}"