"{\"Pakistan jumps into India-China standoff: Propaganda & rumours galore on social media\": [\"40 Chinese fighters have landed at Skardu airport and 10 have reached Gilgit airport. The same has been picked by many in india, including some in government circles - including in the government sphere sparked by the rumours that the current standoff between India and China is a 'psychological warfare' the latest satellite imagery of June 24, 2020\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Gilgit1-770x433.jpeg?WA7UhXAp.yKbllihiod_eaB.P59pFkKV\"], \"Intl airlines initiate probe against Pak pilots, staff after reports ?of fake licence\": [\"Pia has grounded 150 pilots with fake licences, a media report says. The alleged?dubious? licenses were found in the preliminary report of the plane crash in Karachi last month, which found that 97 people were killed by the crash on may 22. Pakistan's aviation minister said the move would help allay global\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Pakistan_International_Airline-770x433.jpeg?XOdUoyXBen7GcpdR83U97o.4GmujWmMi\"], \"Dylan Frittelli 4th tour PGA Tour player to test positive for coronavirus\": [\"Dylan Frittelli was the fourth PGA Tour player to test positive for the coronavirus. He missed the cut at the Travelers Championship, playing the opening two rounds with Ian Poulter and J.T. Poston. The south african player took a saliva test to take the tour's charter to Detroit, and the result came back positive Sunday\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/PGA_tour-770x433.jpeg?ozBnaYa8JDny9r02AsswhM1jHT9z1jbl\"], \"Shikhar Dhawan, Rohit Sharma understand each other's strengths and weaknesses well: Irfan Pathan\": [\"Former india fast bowler Irfan Pathan said Rohit Sharma and Shikhar Dhawan understand each other's strengths and weaknesses. The pair partnered for india as openers for the first time at the ICC champions trophy in 2013 and made an immediate impact in India' a title-winning run - the 4th spot on the list of opening pairs\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTX6Y1OA-770x433.png?CKmiZg7X8h5rcxHBLrhFExkcEmXYioXQ\"], \"Karnataka coronavirus news updates: Bengaluru cases double in 5 days, stricter norms likely post-July 7\": [\"On June 23, Bengaluru had 1,556 coronavirus positive cases. In the next five days, the Covid-19 cases doubled to 3,419, Karnataka minister said in a tweet. The state government has planned to implement stricter norms in state post-July 7. The restrictions are likely to be imposed post the ongoing SSLC board\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Karnataka-770x433.jpeg?LqsAUaa2BnZve1RI0LDZphHByFYXrK71\"], \"Erica Fernandes in a relationship for three years: He is not from the industry\": [\"The actress never spoke about the love of her life and neither revealed any details about him. In a recent live session, she shared some details of the relationship she shares with her boyfriend. He doesn't like seeing me romance other guys on screen.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/pk_35-770x433.png?0zhCE5nrcLyDSrX4Q9bHksFM.N.uHDQm\"], \"Tamil Nadu: AIADMK leader Arjunan violates lockdown, abuses cops in Salem\": [\"Former AIADMK MLA Arjunan was caught on camera abusing policemen who stopped him at a toll plaza on the Salem-Bengaluru highway on Sunday night. The incident reportedly took place when he was stopped by cops and pushed and kicked an officer on duty. No case has been filed by the police against the\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/salem-770x433.jpeg?x8SGNMlOLjSUGS2wyUlECS9haJ_E4pq_\"], \"Only goal is to save lives, need no credit: Arvind Kejriwal on Delhi Covid-19 situation\": [\"The 5.5 lakh figure was estimated on the basis of a formula shared by the central government. However, even with the highest number of cases in India, Arvind Kejriwal said the number may not be so high and if status quo is maintained, Delhi could even see downward trend soon.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-06-29_at_2.31.-770x433.png?ZfmXQtvMOq.9W0p3tWWoKjIjFcovSGIo\"], \"Woman surprises daughter with 10-week-old puppy in adorable viral video. Her reaction says it all\": [\"A video of the moment is going viral after it was shared on reddit. The video shows the girl's joy as she cuddles the 10-week-old puppy in her arms, her mom asks her to close her eyes and sit patiently on the couch. Her reaction says it all, and netizens marvel at the scenario.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/pp-770x433.jpeg?c1PZcel7UGBRFHLr7OuC.CLDrBGvRksI\"], \"Ex-Delhi cricketer Sanjay Dobal dies due to Covid-19, DDCA pays heartfelt condolence\": [\"Dhobal died on monday morning after failing to recover from COVID-19 infection, a source close to the family said. Dobal was 53 years old and is survived by his wife and two sons - elder Siddhant, who plays first-class cricket for Rajasthan and younger Ekansh. He also played for the famous Sonne\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/sanjay-770x433.jpeg?IeOaaxSCie.nX5wks4l.6c_uD3OEYg8A\"]}"