"{\"Utah Jazz's Rudy Gobert still not fully recovered from Covid-19\": [\"\\\"the taste has returned, but the smell is still not 100 percent,\\\" he says. The all-star and two-time Defensive Player of the Year says of his condition, \\\"it could take up to a year\\\" gobert was diagnosed with the virus on march 11, and the NBA suspended its season following play that night.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/NBA_1-770x433.png?KIbX7Nh6k7vKdpIWuNbgUa9SYwEcU7WG\"], \"I want to take footballing decisions at Barcelona: Xavi\": [\"Former barca great Xavi Hernandez has said he hopes to return to the spanish club as head coach when the timing is right. The 40-year-old coach has been approached by his technical team to replace Ernesto Valverde before Quique Setien was appointed in January.Barca are two points behind leaders real madrid with six matches remaining in the campaign\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTX1E9FO-770x433.png?6FbIhke7cbDpB_xpNUf8VLYbwM5QtHRb\"], \"Still in good position, financially very stable: AELTC CEO on Wimbledon cancellation\": [\"The grasscourt grand Slam was scheduled to start on Monday but was cancelled for the first time since world war two in April. The all England lawn tennis club said its spending plans would not have to be curtailed. It won?t be severely impacted. If you cancel, it?s great to have insurance, said Richard Lewis, who will step down as the CEO\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTS3GDL2-770x433.png?AD.X0P_rnHnHn4R7eRTT7zHPzX.rsdVe\"], \"Dylan Frittelli 4th tour PGA Tour player to test positive for coronavirus\": [\"Dylan Frittelli was the fourth PGA Tour player to test positive for the coronavirus. He missed the cut at the Travelers Championship, playing the opening two rounds with Ian Poulter and J.T. Poston. The south african player took a saliva test to take the tour's charter to Detroit, and the result came back positive Sunday\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/PGA_tour-770x433.jpeg?ozBnaYa8JDny9r02AsswhM1jHT9z1jbl\"], \"Kohli, Rohit and Dhoni headline Aakash Chopra's all-time IPL XI, no Gayle\": [\"Former india batsman aakash Chopra picked his all-time playing XI from the Indian Premier League. He named 8 Indian players in his list of 11 with MS Dhoni as captain and wicketkeeper of his team with David Warner, AB de Villiers, Sunil Narine and Lasith Malinga as his 4 overseas players\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/kohlidhonirohitipl_1-770x433.jpeg?se2ywYOWnwY44w2bSpZorp4pOYK7BnFN\"], \"Popular Delhi cricketer and coach Sanjay Dobal dies due to coronavirus\": [\"Dhobal died on monday morning after failing to recover from COVID-19 infection, a source close to the family said. Dobal was 53 years old and is survived by his wife and two sons - elder Siddhant, who plays first-class cricket for Rajasthan and younger Ekansh. He also played for the famous Sonne\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/sanjay-770x433.jpeg?IeOaaxSCie.nX5wks4l.6c_uD3OEYg8A\"], \"My god! Kyrgios tears into Zverev for partying days after promising self isolation\": [\"A video of the german tennis star went viral on social media. He was seen partying at private club in Monte Carlo at time of'self-isolation' the tennis fraternity is taking baby steps towards resumption after the covid-19 pandemic brought the sporting world to an halt. The calamitous Adria\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/kyrgioszveerv-770x433.jpeg?HJjz.PnWLAWxVOIUgcnsmJt_hK1LlyDI\"], \"Ex-Cricket West Indies boss Cameron joins race for ICC chairman role\": [\"Former cricket west indies boss Dave Cameron has thrown his hat in the ring to succeed Shashank Manohar as the next ICC chairman. The former CWI president will need two nominations to stay in his fray and it is not clear if he will receive the support from cWI chief Ricky Skerritt and had a public spa\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/icclogo_0-770x433.jpeg?cWOfmj.P9AYYKlkF1VrzcTvpZDoyN4cx\"], \"I really want MS Dhoni to come back to Team India: Kuldeep Yadav\": [\"India wrist-spinner Kuldeep Yadav said he misses MS Dhoni. The world cup-winning captain hasn't featured in any competitive match since the 2019 world Cup - despite a sabbatical and missed the home season last year and gave the high-profile new Zealand tour in february this year\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/AP19160546813705_0-770x433.jpeg?RVfQ4HY8M3zrJBdsHZoHQSuyIHrY7QDl\"], \"England team psychologist helping Broad 'train his brain' for cricket without fans\": [\"Fast bowler Stuart Broad is working closely with team psychologist David Young. He is trying to prepare himself mentally to play cricket in times of the coronavirus pandemic.england host the west indies for a three-match Test series.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/RTX7C841-770x433.png?NDJH9oDJ1g0yQXyiYKliNJjkPkhwZBAd\"]}"