"{\"Canon to launch EOS R5 and EOS R6 on July 9 via live streams in the US, Europe\": [\"The brand will launch the new Canon EOS R5 and a new RF lenses on July 9 reportedly. The two cameras will be able to shoot 4K videos at up to 60p resolution, while the full-HD videos are at 120fps, both internally and externally. If this rumour turns out to be true, Canon could release an\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Canon_EOS_R5_Launch-770x433.jpeg?0lbF5WdcjiEmP3giKiqdrhe03o3Pc2JQ\"], \"Controversy around Hindu gods lands Netflix in a soup, boycott hashtag trends\": [\"The #BoycottNetflix hashtag has been trending on the Indian Twitter. The hashtag trended over a particular scene in the movie that attempts to slander an Hindu god and goddess. It was released on Netflix on June 24 as follow-up to anushka Sharma's efforts to revive the horror genre in India.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/bulbbul_netflix-770x433.jpeg?pMx3h4NMt9SNgENVgLM3Vt_5zZmaH3IF\"], \"Facebook likely to roll out dark theme for mobile: All you need to know\\u00a0\": [\"Facebook has made the feature available to some of its users across the globe. This shows that it has not been rolled out for the wider audience and it might take Facebook a while to officially release it for users. Facebook had said that the dark mode reduces the glare and the dimmed lights will not be as harmful to the eyes as the normal mode does.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-04-22_at_1.29.-770x433.png?JTLQIHkc3Sg7xc0HMyGfwyR1wFKBVdue\"], \"Reliance Jio credits 2GB data per day for users as month end nears, check out other plans\": [\"The offer has been made available for users since the past four months since march-end. The post FUP speed comes down to 64 Kbps.Jio started crediting the data pack for some users on Saturday, only Tech noted.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-04-10_at_12.52-770x433.png?BftLC6DR8cSlLZdgw7l4Qf0zJmb33vBx\"], \"SanDisk now offers 1TB pen drive in India that works with smartphones too\": [\"The SanDisk Ultra Dual Drive Luxe comes with a maximum storage capacity of 1TB. It is enough to store 13 full-length 4K UHD movies and millions of MP3 songs, although they both sound dated in the era of online streaming. The pen drive uses the USB 3.1 Gen 1 technology for data transfer.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/sandisk_1tb-770x433.jpeg?Wnox7r8GiYVyA6bube3lOwgk.0dC3kkN\"], \"Instagram likely to come with message sound, video note feature\\u00a0\": [\"Instagram is working on a new feature called video note for its standalone messaging app Threads. It will convert the audio in the videos to live captions, which means users can read out whatever will be said in video. The feature would help the thread users on Instagram understand what their friends are saying and help them respond clearly.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-03-20_at_10.43_2-770x433.png?XIIb.Dc.F3Rw4B2gAn6sqgDOFJgITLRx\"], \"Apple to launch new 10.8-inch iPad in 2020, smaller 8.5-inch iPad planned for 2021\": [\"Apple has announced its plans of a new ARM based family of chips. The upcoming macs aren't the only new products being introduced by apple this year, says analyst ming-Chi Kuo. Meanwhile, the company is also looking to launch new iPad models in the future.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/ipad-pro_2_559_080817014106_0-770x433.jpeg?0YqysjnioouN4JAyoGzKOt.V57TnBTrX\"], \"TikTok caught snooping on iOS 14 users\\u2019 clipboard data, issue addressed\": [\"The video-making app had stated in the past that it would stop reading content on user\\u2019s clipboards, a report by the Telegraph stated. However, it was found doing otherwise quite recently and was caught red-handed. This could be figured out by software update by apple for iOS 14 that sends notifications to users whenever an app is found accessing their data\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Screenshot_2020-06-29_at_12.08-770x433.png?4tLJ3TDcWsDUM2T3vxuH9uGR0s8UKvOk\"], \"Realme Narzo 10 comes in new That Blue colour: Still a good deal at Rs 11,999\": [\"The latest budget smartphone from Realme has a That Blue colour option now. It will sit next to existing That White and That Green variants. The smartphone was launched back in May after delays due to the lockdown, which began at the end of March.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/Narzo_10-_That_Blue-770x433.jpeg?jncL8gQ2hxZ7e17V3igCN0anxWnDPZ2h\"], \"iPhone SE 2020 cameras found as good as iPhone XR\\u2019s in DxOMark review\": [\"The iPhone SE 2020 camera has a 12-megapixel f/1.8 sensor with OIS, PDAF, autofocus, and 5X digital zoom. The overall score is 101, which is similar to that of the iphone XR.\", \"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202006/iphone_se_2020_it-770x433.jpeg?DixsJLZmQLxzrHoiBXJfQ37hZ2F4PbsS\"]}"