[{"heading":"Over 61,000 new coronavirus cases take India’s total to 20.88 lakh, over 42,000 dead","summary":"India has recorded 933 deaths in the past 24 hours, taking the coronavirus death toll to 42,518. Among total 20,88,612 cases, there are 6,19,088 active cases and 14,27,006 cured or discharged cases. India’s recovery rate now stands at 68.32% while the mortality rate is at 2.04%.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/coronavirus_mumbai_pti_1.jpeg?Q.B8PGMvPYqb97349Qi7BMOvCcg_QcQV&size=770:433"},{"heading":"Mute, deaf, blind: Rahul Gandhi corners government on Asha workers' protest","summary":"The government was dumb, but now it is also blind and deaf. Almost 6 lakh Asha workers are planning to go on a two-day nationwide strike against the central government as India continues to combat the deadly coronavirus pandemic, according to reports. Also has promised 2,000 rupees per month to help fight the virus.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/rahul_gandhi_0.jpeg?CzhU_U3FKVwFarrobn9oB62IR2ps_1KG&size=770:433"},{"heading":"Surge in recovery rate, declining fatality rate boost India's efforts against coronavirus","summary":"India's efforts have received a shot in the arm by two significant achievements. The rising recovery rate among Covid-19 patients and the falling fatality rate have remained much below the global average, according to the ministry of health. Also has also helped reduce the number of active cases and increase the percentage recovered cases.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/coronavirusfresh_0.jpeg?NxZbmFlccckGcpupzMME7FMYZsbWmrYq&size=770:433"},{"heading":"Coronavirus: India continues to test more than 6 lakh samples a day","summary":"India continues its track record of testing more than 6 lakh samples for Covid-19. India has done 2,27,88,393 tests in the last 24 hours, the health ministry says. The seven-day moving average in daily tests conducted has significantly improved from around 2.69 lakh on July 14 to around 5.66 lakh.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Coronavirus_RTS2ZZ8O_1_0.jpeg?hmIiZW24eIHJYo1VAeHW2wleYpvNCfW7&size=770:433"},{"heading":"Mumbai: BMC makes home quarantine of 14 days compulsory for domestic travellers","summary":"The brihanmumbai Municipal Corporation (BMC) made 14 days' home quarantine mandatory for all domestic passengers landing in the city. The civic body has also made it clear that the essential workers will have to seek permission to resume their duties two days prior to their landing - stating full details of the work and elaborating the importance of a work. An order issued by Additional Municipal Commissioner P.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/PTI_airport_coronavirus_PPE.jpeg?331bfjHW4Gas0CAKsXjsjECkKoIunjAF&size=770:433"},{"heading":"Despite growing calls to boycott ‘Made in China’ products, India still importing Chinese testing kits","summary":"Documents reveal that india was importing Chinese testing kits to meet its Covid-19 surveillance needs when the People's Liberation Army (PLA) encroaching on Indian land in eastern Ladakh. This led to a violent clash between troops on the night of July 15 where 20 Indian soldiers were killed in the line of duty. Meanwhile, imports of the same continue even today through outsourced firms as per the tender norms.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RT-PCR__PTI_.jpeg?9484crVZNTXLLvleahB4nTEinxAFtqE8&size=770:433"},{"heading":"Switzerland inks deal with Moderna for 4.5 million doses of potential Covid vaccine","summary":"The federal government says it has struck a deal with moderna to supply Switzerland with 4.5 million doses. The deal would make it possible to vaccinate 2.25 million people, because expectations are that two dosages would be needed, it said on friday. It is one of the first such deals by any government with the company, an office statement said. There are thorny debates about who should get the safe and effective Covid-19 vaccine first.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Moderna__Reuters_.jpeg?wi5D3JcJzYxE.THhEQ8FIwPqTM25UDy2&size=770:433"},{"heading":"With Chinese help, Hong Kong offers free universal Covid testing for citizens","summary":"2,500 new infections have been detected since the start of July. The virus first hit the city in late January, nearly 70 per cent of the total since it was first discovered in early january, and deaths have risen to 46.City leader carrie Lam said the government would introduce a free voluntary testing scheme in two weeks' time with support from medical officials from the Chinese mainland. Many Hong Kongers remain deeply suspicious of Beijing as it stamps down on political freedoms.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Hong_Kong_Covid_centre__AP_.jpeg?y5DXDc7lwrWgeZFbh9qEHC1cmhqJFINc&size=770:433"},{"heading":"India hits 2 million cases as health volunteers strike","summary":"62,538 cases in the past 24 hours, raising the nation's total to 2,027,074. 886 people died, for a total of 41,585. Recoveryies are also growing, the ministry said. India has the third-highest caseload in world after the united states and Brazil. Its fatality rate of about 2% is far lower than the top two hardest-hit countries.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/ROUNDUP_PTI.jpeg?Dphh_C_OuOmij4vghhCK9f_t.5xDfvjI&size=770:433"},{"heading":"Sensex, Nifty end flat as virus cases top 2 million","summary":"India's coronavirus infections jumped by a daily record of 62,538 on friday to 2.03 million. The Sensex ended up 0.04% at 38,040.57, while the Nifty closed 0.12% higher at 11,214.80, and the Nasdaq climbed 0.9% on Thursday, down 0.2% to 11.14 million, the third biggest caseload after the united states and brazil - the second biggest in the world despite the covid-19 pandemic.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/sensex_reuters-647x363.jpeg?YV0bVgd4AUoDJrIeSmKmaX4Ugg5ZtVLF&size=770:433"},{"heading":"Africa passes 1 million confirmed virus cases; true number far more","summary":"Africa's confirmed coronavirus cases have surpassed 1 million, but global health experts say the true toll is likely several times higher. More than 22,000 people have died of Covid-19, a virus that has spread beyond major cities \"in distant hinterlands\" the virus is spreading across the world, with few health resources exist and reaching care could take days. Despite the lack of testing, africa has strained to cope as hospital beds fill up and confirmed cases are over half-million, ranking fifth in the global world.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/africa_corona_ap_1_0.jpeg?8fEykf5C_2XtbyyKnJyML.EFiO7UGbyy&size=770:433"},{"heading":"Immunity boosters to comfort food: How Indians are spending during coronavirus pandemic","summary":"The coronavirus pandemic has drastically changed the spending habits of millions in india and most other countries across the globe. More than 60,000 cases were reported in the country due to the rising Covid-19 cases, which has sparked a rise in cases of the deadly virus. The number of cleanliness products on household shelves has also increased significantly.since eating out doesn't seem viable at the moment, comfort food has seen sharp demand in India. Spending more time at home has resulted in increased spending on digital services.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_3.42._0.png?xmRGsb1Nltq9dwyi7SgSOaNbwDv4lVI1&size=770:433"},{"heading":"Serum Institute signs deal with Gavi, Gates Foundation to deliver 100 million Covid vaccine doses","summary":"The vaccines will be prices at a maximum $3 per dose. They will also be made available in 92 countries that are included in Gavi’s COVAX Advance Market Commitment (AMC) the same $3-per-dose price applies in case of these deals as well. I would like to thank @BillGates, @gatesfoundation and @GaviSeth for this key partnership of risk sharing and manufacturing of 100 million doses for the novel coronavirus.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Screenshot_2020-08-07_at_3.18._0.png?14XOGa4tRwXFE3ZSfxRWwAXDp7zJ9p5f&size=770:433"},{"heading":"Indonesia reports 2,473 new coronavirus cases, 72 deaths","summary":"Indonesia reported 2,473 new coronavirus infections on fri, bringing the total tally in the country to 121,226, data from government's Covid-19 task force website showed. The Southeast Asian country also added 72 new deaths on Friday, taking total number to 5,593, the data showed. Also reported a total of 2,447 new infections in Indonesia on the last year, with the number of deaths totaling to 2,483.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/indonesia_corona_RTS.jpeg?gieT4tYmrHl8LM2uBFVxpmvpI_doGL.9&size=770:433"},{"heading":"HP BJP chief tests coronavirus negative, still goes in self-quarantine","summary":"The office of Superintendent of Police (SP) in Shimla has been closed for sanitisation on friday. A police personnel who had visited the SP office on Wednesday tested positive for COVID-19 on the next day, the police said. The BJP chief had recently come in contact with power minister Sukh Ram Chaudhry who tested negative for coronavirus infection on Thursday.Kashyap has self quarantined as precautionary measure.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Coronavirus_2_0.jpeg?ZyHJfjSaEGruGvsiZWRy6I22a.aqSD9q&size=770:433"},{"heading":"DMK launches virtual marathon on Karunanidhi's death anniversary; funds to be used for cornavirus relief","summary":"The virtual marathon was inaugurated by DMK chief MK Stalin on Thursday. The fund generated from the event will be used towards Covid-19 relief in the state. Anyone across the globe can register on www.kalaignarmarathon.com for a participation fee of Rs. 300.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/karunanidhimarathon.jpeg?xbjbmqOOpBAtXXIq6QqcQ_3fOLvUyhfG&size=770:433"},{"heading":"Rahul Gandhi attacks PM Modi govt over India's coronavirus tally crossing 20-lakh mark","summary":"India's covid-19 tally breached the 20-lakh mark. The number of recoveries surged to 13.70 lakh, according to data from the states and union territories. He also tagged a July 17 tweet of his urging the government to take concrete steps to prevent the spread of coronavirus. India is third in the world in terms of the COVID-19 cases after the US and Brazil. India is the third highest-ranking country in europe in regards to the disease.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Rahul_gandhi2.jpeg?_cI_QxJE0osRP1IopantlZtvPjoc2_DP&size=770:433"},{"heading":"Coronavirus: Help a call away for home isolation patients in Bihar","summary":"The nearest Covid care centres have been provided with the database of the patients under home isolation in Bihar. A system has been created to ensure that specialised medical care reaches them in the shortest possible period in case of any medical need. The state health department has set up control rooms at dedicated covid-19 hospitals, which are headed by probationary IAS and IPS officers, and officers of provincial services and health care workers have also been stationed there.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/PTI_corona_new.jpeg?JWvdxejX3TJ5tee1bHutZbftKJhJB3BM&size=770:433"},{"heading":"Southern states continue to reel under Covid-19, AP Minister tests positive","summary":"Southern states recorded 10,000 plus cases for a successive day. Kerala, Karnataka and Telangana recorded highest single-day spikes - more than 100 deaths for the fourth straight day of 100 plus deaths in the state with the fatalities in first six days of this month alone. Tamil Nadu, where the daily cases have stabilised below 6,000 mark for over one week now, logged over 100 death tolls, according to the health department.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/coronavirus_pti_1-647x363.jpeg?gJBEaqpHKR8nfVPd6I3MLMfyoZcoqn7Z&size=770:433"},{"heading":"Himachal Pradesh: 131 people including state minister, his 2 daughters test Covid positive","summary":"131 people tested positive for covid-19 in the state on friday. This is the highest spike of cases reported on a single day in u.s. So far, according to government data. The death toll due to the disease stands at 13, he said. There are 1,142 active cases in Himachal Pradesh at present. 103 more patients have recovered from the infection, the tally of coronavirus cases rises to 3,048.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/himachal_pti.jpeg?UA4MpKJcwWus20hL.9LUkkTcWP488YGv&size=770:433"},{"heading":"Less sensitive antigen tests are beginning to take over Covid-19 testing in India","summary":"Rapid antigen tests now make up 25-30 per cent of india's total Covid-19 testing. Sensitivity ranges from 55-85%, meaning they could miss 15-45% of positive cases. The data is restricted to the dates on which the respective states make these disclosures. This data was compiled from daily state bulletins of four major high-burden states that are reporting this information.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/RT_PCR__PTI_.jpeg?8GnqBbvh3Hke8CdGwX75VnwEksxkB40K&size=770:433"},{"heading":"Tamil Nadu govt issues SOP for reopening gyms: Mandatory faces shields, 6 ft distance and repeated sanitisation must","summary":"The palaniswami government announced that gyms will be allowed to reopen from august 10. The state has been closed since march 24 when the nation was put under lockdown to curb the spread of novel coronavirus. Despite other establishments and businesses being allowed, the government has also allowed the gym to remain closed due to increased chances of virus transmission at these facilities. However, as part of Unlock 3.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/gym.jpeg?j_v8lQnfrnMtdN9WyMo0YUmren26jn46&size=770:433"},{"heading":"Patanjali chased profits by exploiting public fear: Madras HC imposes Rs 10 lakh fine on firm","summary":"The high court slapped a fine of Rs 10 lakh on the company for \"chasing profits by exploiting the fear and panic among the general public\". The defendants have been asked to pay the fine by the end of the month by january 21.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/coronakit-patanjali.jpeg?X4V1xpzSs_WWqZtcTKR6S1iEfnuoafjL&size=770:433"},{"heading":"Coronavirus cases in India cross 20-lakh mark; Maharashtra, Andhra report massive spike in new cases","summary":"India's tally of confirmed cases stands at 19,64,536. This was inclusive of 5,95,501 active cases, 13,28,336 patients discharged after recovery and 40,699 deaths. The official number of total Covid-19 cases remains at 19.64 lakhs as the ministry of health' 'covid' dashboard is updated at 8 AM each morning. A total of 3,16,375 patients have recovered from the infection in the state, 10,854 in last 24 hours.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Sero_survey__PTI_.jpeg?jUlJKEPJpTc6WZORxiocg2URwT.Lv0OB&size=770:433"},{"heading":"Coronavirus: AIIMS study says convalescent plasma therapy fails to reduce mortality risk in Covid patients","summary":"Convalescent plasma therapy is being widely used in the medical treatment of severely-ill Covid-19 patients. The group was divided into two, 15 were given standard treatment protocol and rest were administered plasma treatment. A randomised controlled trial revealed that mortality is similar in both groups with not many clinical benefits for either of the groups. However, larger studies (20,000 Mayo USA) have shown early administration is likely to improve the chances of survival and early diagnosis by testing, monitoring and access to oxygen.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/plasmatherapy-corona-pti.jpeg?i4hcRXAqxd08HA7yQUidjJvgfk4k2fRI&size=770:433"},{"heading":"Tourism-reliant Thailand defers 'travel bubble' plan as Asia's Covid graph rises","summary":"Thailand has delayed plans for a \"travel bubble\" agreement with select countries. New daily coronavirus cases rise in parts of the world, putting pressure on tourism industry and complicating efforts to revive its battered economy. The island of Phuket has instead proposed receiving direct flights from those countries, with tourists doing two-week quarantines in their hotels before going out. We are asking for travel, charter flights, into Phuket, Phuket Tourist Association President Bhummikitti Ruktaengam said.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/Bangkok_temperature__AP_.jpeg?t3V3F02.SXBYUj5jdwNxe7M417gFMwPS&size=770:433"},{"heading":"Unlock-3: Allow hotels, gyms, weekly markets to reopen in Delhi, AAP govt's proposal to L-G","summary":"The government said that in accordance with the unlock guidelines issued by the Centre, it has the right to take decision to allow such establishments in the city. In its 'Unlock-3' guidelines, the centre had allowed opening of yoga institutes and gymnasiums from august 5 but no fresh order has been issued to permit functioning of the establishment - but Lt Governor Anil Baijal had overturned the decision.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/kejri_baijal_pti_0.jpeg?.25Db41bUh6Pd93RKh1OSc8NnJ3st8uz&size=770:433"},{"heading":"E-pass system causing inconvenience to people, remove it: DMK chief MK Stalin tells Tamil Nadu govt","summary":"The DMK chief asks the all India Anna Dravida Munnetra Kazhagam government to do away with the system of 'e-passes' to travel across districts in Tamil Nadu. The chief questioned why the government is still holding on to it and said it's enough if CM and ministers travel in districts but not the people. A spokesman for the department of justice said he would not be able to comment on the issue.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/stalin_pti.jpeg?eHm3uNPcvUIU9lI2YCKgtn3kXauxLEzt&size=770:433"},{"heading":"North Korea's escalating virus response raises fear of outbreak","summary":"North Korea is quarantining thousands of people and shipping food and aid to a southern city locked down over coronavirus worries. The country's response to the suspected case reinforces doubt about its longstanding claim to be virus-free. But an exchange between the u.n. And the united nations is providing new clarity - and actual numbers – about what might be happening in North Korea, which has closed its borders and cut travel, never free-flowing stream by outsider monitors and journalists.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202008\/kiim_jong_reuters.jpeg?6szbM._kwDzOX2A4gUE8ukct8zeFwbtf&size=770:433"},{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]