[{"heading":"Google Pixel 3a series discontinued in US: Pixel 4a coming soon?","summary":"Google has discontinued the Pixel 4a and Pixel 3a XL in the us nearly a year after they were launched as the watered-down versions of the phone. This should indicate that the company is preparing for the arrival of this series that has been in anticipation more than everyone expected.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pixel_3a_it-770x433.jpeg?7bCTaORb5_pI6Dy8XW0zbAg6Hh2b0mtY"},{"heading":"BSNL extends availability of Rs 299, Rs 491 ADSL broadband plans for 90 days, introduces PV 2399","summary":"Bsnl has extended the availability of ADSL broadband plans worth Rs 299 and Rs 491 for a period of 90 days, starting 27th June. The plans dubbed as 50GB CUL will be available till september, beginning with the release of the work-at-home plan for its users until July 26. Both plans require users to pay Rs 500 as","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.32._1-770x433.png?jO8IetOxA.mfCCUdSEZ2lJ1oJmV9eU8b"},{"heading":"Nikon will introduce entry-level Nikon Z5 and three Nikkor Z lenses on July 21","summary":"Rumours suggest the company will announce the Nikon Z5 along with new lenses. These lenses will be a part of Nikkor Z series lenses including the much-awaited f\/2.8 S. This lens may come with screw-on feature for putting on additional filters. The new camera M10-R may launch on July 19 via live streams in the US","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Nikkon_Nikkor_Z_Lenses_New-770x433.jpeg?E8mPvrikegfe0wm.yQ0eXq_4rrYBfnar"},{"heading":"Asus ROG Phone 3 finally gets a release date: Everything you need to know","summary":"The Asus ROG Phone 3 will be launched on July 22, 2020, at the game changer event. The company is better known for making gaming laptops and gaming smartphones, especially the ROg series. It will lock horns with Lenovo Legion gaming smartphone which is also slated to launch this year.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_2.03.-770x433.png?7UmaDoQ21R6It3g07WIsPXOshBYUJy5s"},{"heading":"Pakistan temporarily bans PUBG, calls it addictive and wastage of time","summary":"Pubg has also been cited as one of the reasons for cases of suicide in Pakistan. The temporary ban comes days after india clutched down on 59 Chinese apps and banned them.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/pubg_mobile_bloomberg_amp-770x433.jpeg?5eTFt1llQT2jqBPNkfIt_fKXJM3s_6vY"},{"heading":"Facebook admits sharing users' data with third-party developers","summary":"5000 third-party app developers continued to receive non-public information about users way longer than they should have. The company didn?t receive the number of users who had used the app for the past 90 days. It just revealed personal information including addresses, birthdays, gender, or language spoken was wrongly shared with the apps.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-18_at_10.42-770x433.png?WTwTwmMFWgTclSJvjh3mRoXUn1UPL3nN"},{"heading":"BSNL reintroduces Work at Home plan till 26th July, extends 6 paise cashback offer till 31st July","summary":"The work-at-home plan is available in all circles except for the Andaman and Nicobar circles. New subscribers will get 10 Mbps speed till 5GB data per day, the speed is reduced to 1 mbps - the download and upload limit is unlimited with customers getting 1 free e-mail ID and a GB space. The ISD charges with","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-03-16_at_4.39.-770x433.png?f229.BqVUQnij_Ea.mNgevbKzJ9vxxou"},{"heading":"Zuckerberg tells Facebook employees that boycotting advertisers will be back soon enough, won?t change policies","summary":"Facebook CEO says he won?t change the policies of the company. This was in response to more than 500 advertisers boycotting Facebook as part of?Stop hate for Profit? movement - a threat to small percent of our revenue, or to any percentage of your revenue... Zuckerberg said 'all these advertisers will be back soon enough'","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.49-770x433.png?2tly_LJRvX1VIZVsjT97dvI9kl.gORqb"},{"heading":"Samsung Galaxy Note 20 Ultra images leak, spotted in Mystic Bronze colour","summary":"The phone was spotted in?Mystic Bronze? colour, and complete with a triple camera setup on the back. The new leaked images also show the S Pen. There appear to be no real surprises here, with the stylus looking the same as always.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Samsung_galaxy_Note_20_Ultra1-770x433.jpeg?XxT5c73cpjWFs92xwAdDKsAZQZRIxppE"},{"heading":"Google Play Store, App Store remove all 59 Chinese apps banned by government?","summary":"The list of apps that were banned by the government included UC browser, Shareit, Kwai, CamScanner and others. The apps were nowhere to be found in Apple?s App Store as well, but now there are absolutely no traces of the other 58 apps banned in India.","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/Screenshot_2020-07-02_at_12.00-770x433.png?czItbqYG__LaGnJnFZBuqH6eApBserxl"},{"heading":"DuckDuckGo privacy-focused search engine inaccessible in India, company says could be blocked","summary":"The privacy-centric search engine seems to be unresponsive on all networks, according to several users in India on Twitter and Reddit. A number of twitter users took to Twitter to report that DuckDuckGo is inaccessible for them on multiple networks - including Reliance Jio and Airtel. The effective extent of this issue is not clear, it is","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/duckduckgo-770x433.jpeg?.PC2_SxVgcEVYcIoehs3eeauthGUuCZV"},{"heading":"OnePlus Nord to bring 5G-enabled Snapdragon 765G SoC, 'flagship-level' cameras, confirms company","summary":"The OnePlus Nord will come with a powerful mid-range chipset, the Snapdragon 765G. The information has now been confirmed by Qualcomm's twitter handle and corroborated by u.s. Co-founder, Carl Pei, who in an interview with TechRadar UK, confirmed the device will be powered by the Qualcomm Snapdragon 750G chips","picture":"https:\/\/akm-img-a-in.tosshub.com\/indiatoday\/images\/story\/202007\/OnePlus_Nord12-770x433.jpeg?XvbOtjplNhX6glm0QkmbS89O3ipsDE12"}]